{"tweets": ["#Ethiopia: Watch the very moment the 2019 Nobel Peace Prize is announced.  Presented by Berit Reiss-Andersen, Chair of the Norwegian Nobel Committee.  #NobelPrize #NobelPeacePrize. Courtesy @NobelPrize \n\nTeam Addis Standard would like to Congratulate Prime Minister @AbiyAhmedAli", "Dear our family of @Twitter,\nAt AS we decided to publish our monthly Tweet Activity Analytic starting from October. It includes general content reach, top tweets & average engagement rates. Thank you for trusting AS as your reliable news source! It's what makes us work hard! ", "Ministry of Water, Irrigation and Energy & the #Indian company, Larsen Arsen & Toubro Limited sign a loan agreement amounting €500 million be utilized to address the electricity access deficit in eastern parts of #Ethiopia. @LTI_Global @addisstandard", "#Ethiopia: Some 840 Ethiopians who were in various detention facilities in #SaudiArabia have returned home today on voluntary bases, @mfaethiopia said. Some of them were detained while crossing the #ReadSea while others were in various prisons in #Jazan Region, north of #Yemen.", "Getting Away with Murder: CPJ's 2019 Global Impunity Index spotlights countries where journalists are slain and their killers go free", "Consensus has to be established first within ethnic groups before national unity can be achieved in Ethiopia.", "#Ethiopia unveils jobs creation plan http://v.aa.com.tr/1631987  \"Studies show that up to 14 m jobs need to be created by 2025,\" @Dr_Ephrem said. Agriculture, Industry, Tourism & Services have been identified as sectors that contribute most to the country’s jobs creation blue print.", "#Ethiopia: Million Mathewos, former Pres. of #SNNPRS, is appointed as State Minister at the Ministry of Education, WaltaInfo says. Million was replaced by Ristu Yirdaw as Pres. of the region on Aug. 31 in the wake of the crisis related with #Sidama zone referendum & its handling.", "IGAD Heads of State and Government to convene in the next couple of weeks to decide on who takes up the chairmanship and ES position. Djibouti and Somalia reportedly demanded rotation of key posts in the regional umbrella.", "Flooding in #Somalia has displaced more than 270,000 people of whom 230,000 are in Belet Weyne district. Read more: https://reliefweb.int/report/somalia/ocha-somalia-flash-update-3-humanitarian-impact-flooding-1-november-2019 …", "\"Ethiopia is the biggest prize left in Africa\" Safaricom's CEO Michael Joseph speaks on expansion plans to Ethiopia.", "News: #US trains #Ethiopian law enforcement agencies in Counterproliferation of weapons of mass destruction https://addisstandard.com/news-u-s-trains-ethiopian-law-enforcement-agencies-in-counterproliferation-of-weapons-of-mass-destruction/ … 28 experts from the National Defense Force, Fed. Police, Immigration & Nationality & Customs Commission, among others, participated in the training.", "'Putin's chef' sharpens #Russian propaganda skills in #Africa https://edition.cnn.com/2019/10/31/europe/russia-africa-propaganda-intl/index.html?utm_source=fbCNNi&utm_campaign=africa&utm_medium=social … the operation targeted Madagascar, the Central African Republic (#CAR), #Mozambique, Democratic Republic of Congo (#DRC), #IvoryCoast, #Cameroon, #Sudan & #Libya, & was partially run from Africa", "Update: #Amhara region Supreme Court rules high level corruption suspects should begin to defend case https://addisstandard.com/news-amhara-region-supreme-court-rules-high-level-corruption-suspects-should-begin-to-defend-case/ … The court ruled defendants #BereketSimon & #TadesseKassa should begin presenting  defense statements against prosecutor’s high-level corruption charges.", "#Ethiopia is looking to buy oil from #SouthSudan instead of the #MiddleEast to save money https://www.bloomberg.com/news/articles/2019-10-30/ethiopia-eyes-south-sudan-fuel-to-cut-costly-middle-east-imports … Ethiopia needs 4m tons of refined oil products annually & demand is increasing by between 10% &15% every year, State Minister of Mines & Petroleum, Koang Tutlam, said", "#Ethiopia: At least 15 people died & several others injured when the vehicle they were traveling on overturned & fell into a cliff in #Gergera area, en route #BahirDar to #MertuleMariam, #Amhara region late this afternoon. The injured  are being taken to heath facilities: #AMMA", "Somali Reg State & @MoP_Ethiopia joint consultative workshop about of the final draft of the #Pastoral Dev't Policy & Strategy happened today in #Jigjiga. The outcome of this forum will go in front of the Federal Gov't for final approval then. It's first of its kind in #Ethiopia.", "#Ethiopia News: @icipe launches initiative to benefit 100,000 youth in Ethiopia https://addisstandard.com/news-icipe-launches-initiative-to-benefit-100000-youth-in-ethiopia/ … The $55,601,322, five-year initiative aims to see 100,000 young men & women in Ethiopia secure dignified and fulfilling work along #honey and #silk value chains.", "First vote on impeachment inquiry into President Donald Trump passes US House of Representatives", "#Ethiopia:A total of 78 people were killed following last week's violence in #Oromia region. Nigusu Tilahun, head of the Press Secretariat at the Prime Minister's office also said 407 individuals suspected of inciting the violence have so far been detained https://fanabc.com/english/2019/10/over-400-individuals-suspected-of-inciting-violence-detained-says-pm-office/ …", "Land restoration in #Ethiopia pays off but climate change necessitates many strategies https://phys.org/news/2019-10-ethiopia-climate-necessitates-strategies.html … Pressured by population increases & climate change, Ethiopia's lands have experienced severe degradation. By some estimates, Ethiopia has the worst land degradation...", "Pres ⁦@M_Farmaajo⁩ and ex-Pres Sharif Sheikh Ahmed who is chosen as the leader of the new political alliance had a telephone conversation overnight, according to local media. The call was initiated by ⁦@M_Farmaajo⁩ per http://Jowhar.com ", "As promised we were out with our students & staff of Adihaki, MIT & Kalamino campuses @YirgaWeldu1 @momonafm96 @MekUniETH for the crop harvest campaign near Adigudom  #Tigray - the framers expressed their appreciation to our students from all nations & nationalities #Ethiopia", "THREAD: Diaspora based social media gurus filmed this infamous Bale Robe video, & later attempted to fuel bloodshed with it. This during a period where meaningless bloodshed killed 70 across Oromia. What we know about them and the video they disseminated, thus far. #Ethiopia", "CIA-backed Afghan troops 'committed war crimes': report https://www.bbc.com/news/world-asia-50236357 … @hrw alleges the troops \"committed summary executions and other grave abuses without accountability\". These include extrajudicial killings, forced disappearances and attacks on healthcare facilities.", "Update: A Court in #BahirDar has decided to release Seid Ahmed, #Amhra region Police Commision Assistant Commissioner, on bail today. Seid was one of security officials arrested suspected of taking part in the June 22 killing of senior regional officials https://www.bbc.com/amharic/50245032 …", "#Ethiopia: A protest rally against PM Abiy Ahmed is held today in #Abmo city where he, along with Lemma Megerssa & Shimelis Abdissa, was participating in community discussion regarding recent violence in #Oromia with residents from Ambo & its environs   https://www.facebook.com/BBCnewsAmharic/photos/pcb.1054730971585411/1054730491585459/?type=3&theater …", "#Ethiopia:@NEBGET said today that Ethiopia has accepted to take part in a discussion about #GERD with #Egypt at a meeting to be hosted by the #US. However, he said the meeting is not a negotiation but a mere discussion. Earlier media reports claimed the meeting was a negotiation.", "Sudan Drawing Down Troops in Yemen in Recent Months\nSudan has recently drawn down its forces taking part in a Saudi-led coalition at war with Iran-aligned rebels in Yemen, two senior Sudanese officials said Wednesday.\n\nRead more:", "#Ethiopia: Athlete Haile Gebreselassie said he is considering to sue #Facebook for its own role in fueling the growing numbers of conflicts in Ethiopia. FBC quoted him as saying if the gov't is not taking any measure to this end, he would consider to do so\nhttps://www.facebook.com/fanabroadcasting/photos/a.332889983468414/2567025623388161/?type=3&theater …", "State Minister of Energy Dr. Frehiwot Woldehanna highlights #Nordics world-leading solutions to efficiently integrate wind & hydro, ensuring high level of supply. Provides opportunity for #Ethiopia to leapfrog past fossil fuels to sustainable energy for all #NordicsInEthiopia", "#Ethiopia:A fire that broke out at 4 AM this morning in #Mojo town, in east Shewa zone of #Oromia regional state, destroyed around 60 shops before it was put under control, the town's communication bureau said. The fire broke out at a place called \"Market\" https://fanabc.com/2019/10/%e1%89%a0%e1%88%9e%e1%8c%86-%e1%8a%a8%e1%89%b0%e1%88%9b-%e1%8b%a8%e1%8a%a5%e1%88%b3%e1%89%b5-%e1%8a%a0%e1%8b%b0%e1%8c%8b-%e1%8b%b0%e1%88%a8%e1%88%a0/ …", "#Ethiopia launched @UNODC's #BlueHeartCampaign that aims to raise awareness of #humantrafficking and thereby supporting the fight against this crime and its impact on society. #Ethiopia joined the campaign as the fifth supporting African country and the 1st Eastern Africa.", "Meet the Top 10 CNN Heroes of 2019. Freweini Mebrahtu: Removing the cultural stigma around women's periods.  https://www.cnn.com/2019/10/30/world/cnn-heroes-top-ten-2019/index.html … \"Menstruation is considered taboo in Ethiopia,& girls often miss school or drop out because of their periods.\"\n\n#Ethiopia, let's vote for Freweini!", "Press Statement on the Human Rights Situation in the Federal Democratic Republic of Ethiopia / Press Release / ACHPR https://www.achpr.org/pressrelease/detail?id=451 …", "#wheat Framers Production Cluster (#FPC) in #Dendi Woreda #Oromia #Ethiopia.\n \nImmediate double cropping with #Chickpea after harvest\nLand cultivated = 80 hectares\nFramers in Cluster = 115", "የኢትዮጵያ ወጣት ሆይ እዚህ እዚህ ላይ ነበር መዝመት። ትኩረት ድህነትን፣ የአየር ንብረት መዛባትንና የበረሃ አንበጣን ታግለው ለሚኖሩ የሀገራችን ድንቅ ገበሬዎች።", "#Ethiopia’s Early Warning System and Emergency Response need to be seriously checked & strengthened. We are awfully slow in responding to natural & man-made disasters across the board.", "Governments from the @igadsecretariat countries, UN-agencies, donors and NGO's will meet tomorrow in Addis Ababa to discuss local approaches to #DeliverRefugeeCompact. The conference underlines #Ethiopia's commitment as co-convener of the #GlobalRefugeeForum in Geneva in December", "#Ethiopia News: Ex-#Somali region president pleads not guilty to all charges  https://addisstandard.com/news-ex-somali-region-president-pleads-not-guilty-to-all-charges/ … “Other than administering the [Somali] regional state, I did not commit any crime; I am not guilty,” Abdi Muhamud Omer a.k.a Abdi Iley, said at a hearing today.", "\"The Desert Locust infestation happened when #Ethiopia is dealing w. the impacts of previous & ongoing drought.Currently other insect pests such as the fall armyworm & diseases such as wheat rusts are also serious impediments to agricultural production, food & nutrition security\"", "Alert: Desert Locusts threaten agricultural production in #Ethiopia https://addisstandard.com/news-desert-locusts-threaten-agricultural-production-in-ethiopia/ … \"The swarms have produced hopper bands that have covered more than 174 square km (in 56 Woredas & 1085 kebeles)& are consuming approximately 8700 metric tons of green vegetation every day\"", "Coalition settles for Sheikh Sharif Sheikh Ahmed as chairman – ⁦@Goobjoognews⁩", "Training refugees and Ethiopians for the job market https://www.unhcr.org/news/stories/2019/10/5db729c84/training-refugees-ethiopians-job-market.html … #Ethiopia hosts one of the largest number of refugee populations in #Africa. Most of them come from #SouthSudan, #Somalia, #Eritrea, #Sudan and #Yemen.", "#Ethiopia launches aerial spray to battle desert locust infestation https://fanabc.com/english/2019/10/ethiopia-launches-aerial-spray-to-battle-desert-locust-infestation/ … The desert locust swarms migrated from the M. East through #Yemen & #Somaliland posed a threat in #Tigray, #Afar, #Somali & #Amhara regional states as well as #DireDawa city administration", "We are happy to announce our new partnership with the MasterCard foundation to support the creation of 10 million jobs for Youth and Women in Ethiopia by 2030. An initial investment of $300M is officiated today. @PMEthiopia @DrGetahun @AbebeAbebayehu @MastercardFdn,  #etworks", "Delegates from @Europarl_EN are going to visit the biggest IDP Camp in Somali state, #Qoloji. It isn't the first time #EU visiting this Camp. They were here in December last year with @euronews. The situation remains the same. So that let us see what they say today. @PMEthiopia", "የሰመራ ዩኒቨርስቲ አሁንም የሰላም አምባሳደርነት ቦታው ይዞ ለመቀጠል ተዘጋጅቷል።\nአዳድስ እንግዶቹን በዚህ መልክ ተቀብሏል።\nሁሉም ሰው ከፈለገ ትንሽ ነገር በመሰራት ምሳሌ መሆን ይችላል። #Semera_University #welcoming_fresh_students\n@addisstandard", "#Washington University deepens ties with #Mekelle University in #Africa https://source.wustl.edu/2019/10/washington-university-deepens-ties-with-mekelle-university-in-africa/ … A recently inked agrmnt b/n Washington Univ. in St.Louis & Mekelle Univ. in #Ethiopia will encourage future collaborations in education, scholarship & research b/n the two universities", "Grand Nile compromise-a Sisyphean task? https://www.ethiopia-insight.com/2019/10/29/grand-nile-compromise-a-sisyphean-task/ …\n\"Egypt invokes “established right”, “historical use” or“existing use & right” principles & claims that it is legally entitled to the water share allocated in this agreement.\"\n#Ethiopia #Egypt #Sudan #GERD. Good read!", "Ethiopia expands registration & documentation services for refugees, furthering inclusion of refugees in Ethiopia. An important step to #DeliverRefugeeCompact Registration is supported by EU, Netherlands & Denmark. @EUHomeAffairs @DutchMFA @Denmark_Addis @NLinEthiopia @Refugees", "Journalists Elias Gebru and  Mesganaw Getachew as well as ASRAT media worker Getachew Ambachew were among detainees released in #Ethiopia this afternoon. We call on the govt. of @AbiyAhmedAli to break with the past, and to stop using arbitrary.", "#Ethiopia: @DanielBekele says an estimated 70-80 people were killed in the violence in #Oromia, of whom 10 were killed by security forces & the remaining by stoning & beatings,  among others.Some were also burned.The full investigation will take time, he said & asked for patience", "As many have characterized the recent tragic incidents in #Ethiopia as “የገደለዉ ባልሽ የሞተዉ ወንድምሽ ሐዘንሽ ቅጥ አጣ ሳይወጣ ከቤትሽ”, this is needed for the record. Only few media houses like @addisstandard have dared to report such incidents. #Media #FactCheck", "#SouthSudan and #Egypt sign Landmark Cooperation Agreement at South Sudan Oil & Power 2019 https://africaoilandpower.africa-newsroom.com/press/media/south-sudan-and-egypt-sign-landmark-cooperation-agreement-at-south-sudan-oil-and-power-2019?lang=en … \"This comes a few weeks after President Al-Sisi called upon Egyptian exploration and production companies to increase participation in #African countries...\"", "#Ethiopia: Inter-Religious Council of Ethiopia (#IRCE) condemns recent incident, urge for concerted Effort to Ensure Peace https://www.ena.et/en/?p=10427  The incident which left a scar in all Ethiopians is in contrary to religious and cultural values of peaceful coexistence, it stated.", "A “Feminist” #Ethiopia? What’s Really Behind the Country’s Recent Reforms?  https://www.boell.de/en/2019/10/29/feminist-ethiopia-whats-really-behind-countrys-recent-reforms?utm_source=website&utm_medium=twitter … \"With these new reforms, women are now in the room, but are they ‘allowed to’ make noise?  How loud are their voices in amplifying the concerns of everyday women of  Ethiopia?\"", "STORM #Kyarr ALERT\n\nTropical storm Kyarr expected to blow strong winds and leave rainfall across #Puntland & #Somaliland \n\nTake precautions  Storm might destroy weak structures or cause flash flooding\n\nMore infohttps://bit.ly/32SDo9U \nupdates will follow.", "Hundreds arrested in wake of #Ethiopia violence https://www.bbc.com/news/live/world-africa-47639452?ns_mchannel=social&ns_source=twitter&ns_campaign=bbc_live&ns_linkname=5db835b2cd75fa066f746015%26Hundreds%20arrested%20in%20wake%20of%20Ethiopia%20violence%262019-10-29T13%3A40%3A04.779Z&ns_fee=0&pinned_post_locator=urn:asset:fe256c5d-c601-4671-94f7-050643163c83&pinned_post_asset_id=5db835b2cd75fa066f746015&pinned_post_type=share … \"Police in Ethiopia’s #Oromia region say 359 people have been arrested across the region on suspicion of involvement in the violence that some say was the result of ethnic and religious tensions last week.\"", "Countries of EHoA are hosts to 3.5 m refugees.\n@DanishMFA is currently  implementing #CRRF programmes in Kenya, Uganda, Somalia and Ethiopia, we are making progress on sustainable solutions for refugees and hosts! Together we #DeliverRefugeeCompact", "See background: Among the detainees who were brought to court on Monday are activist/journalist Elias Gebru, secretary of the Addis Abeba care taker council,& Desta Assefa, the wife of Amhara regional state alleged coup ringleader Bir.Gen Asaminew Tsige", "#Ethiopia: 22 people, including junrno Elias Gebru, to be released from prison where they are held without charges.\n\n& as per @Belay_Ma detainees also include members of the political party #NAMA, & of the Addis Abeba Caretaker Council, led by journalist & activist Eskinder Nega", "One of the men, named as Anwar R, has been charged with 59 counts of  murder, as well as rape and sexual assault. The second, Eyad A, has been charged with aiding and abetting a crime against humanity. Both men entered #Germany as asylum seekers https://www.theguardian.com/law/2019/oct/29/germany-charges-two-syrians-with-crimes-against-humanity?CMP=share_btn_tw … #Syria", "News: Maternal,newborn health improves in rural #Ethiopia but inequities still exist https://addisstandard.com/news-maternalnewborn-health-improves-in-rural-ethiopia-but-inequities-still-exist/ … Community-based health programs in parts of rural #Ethiopia, #Nigeria & #India were successful in improving health care for mothers & newborns, but inequities still exist", " East African Photography Award 2019\n\nWinner: @Marthinolly\nWebsite: https://bit.ly/2MepKYH \n#UPPA2019 #EAPA2019", "My reliable source of information @addisstandard .. on last week's events #ethiopia read this", "#Ethiopia's 900-year-old #Shonke village on a mountain [in Ethiopia's #Amhara regional state] https://www.bbc.com/news/av/world-africa-50186119/ethiopia-s-900-year-old-shonke-village-on-a-mountain … \"About 20 generations have lived in the village, but residents now say half of the village's estimated households have left in search of farmlands down the hill.\"", "The body of a businessman identified as Sharif Hassan has been recovered following yesterday tragic boat accident in flooded Beledweyne town; names of other missing victims have been released.", "WATCH: The e-Golfs get polished just before their launch at Kigali Convention Center. \n\nFour electric vehicles will be introduced in #Rwanda through a partnership between Volkswagen and  Siemens under a pilot project. \n\nThe number is set to increase to 20 in the coming months.", "#Ethiopia: We’re open for business says mining minister https://www.miningreview.com/gold/ethiopia-were-open-for-business-says-mining-minister/ … \"The mining sector in Ethiopia is on the brink of evolutionary growth & progress as the country’s first modern gold mine – @kefiminerals’ Tulu Kapi moves into development in October.\" \nPic: Dr. Samuel", "#Ethiopia:Police in #Nekemte city, in East #Wellega Zone,#Oromia Region, said no perpetrator(s) apprehended so far for the killing on Sunday night of Gemechis Tadesse, @ethiotelecom western zone branch head, who was shot multiple times & stabbed to death", "@UNmigration Ethiopia — National Displacement Report 1 (17 June — 30 July 2019). \nPublished 23 October. \nLINK TO REPORT: https://bit.ly/2opI3Bi ", "“Can we even say we have a government?” she asks, millions of Ethiopians share her fear.\n\n#Ethiopia", "This is a sad news!\n\nGovernment of #Ethiopia has sentenced journalist Fekadu Mahitemework, Gihon Magazine Managing Editor, to seven years and fined 7,000 birr today.", "#Ethiopia: The Coach Behind Many of the World’s Greatest Runners https://www.ozy.com/the-huddle/building-a-marathon-juggernaut-in-ethiopia/221285/#.XbfxdtCyo-g.twitter … \"Countless stars from Ethiopia throughout the last few decades have trained under the tutelage of the Adilo family, who, as former athletes, understand the slog.\"", "#Ethiopia: ACWA Power building 250 MW solar PV in Ethiopia https://www.power-eng.com/2019/10/28/acwa-power-building-250-mw-in-solar-pv-to-ethiopia/ … Under the agreement, EEP and ACWA will have a long-term power purchase agreement at 2.52 cents (U.S.) per kWh for 20 years.", "At ተኪ Teki, we have a dream. The dream to create thousands of jobs for persons living with disabilities to build a plastic bag free Ethiopia. \n Filmed in Koshe, Addis Ababa\n#LeaveNoOneBehind #PlasticFree", "#Ethiopia", "Here's my latest,\n“Can we even say we have a government?” says Habiba from Bale Robe.\nHayalnesh Gezahegn, @BilehJelan & I on this one...interviews & context for those seeking greater understanding of the spate of violence plaguing Ethiopia since last week.", "“Can we even say we have a government?” Habiba from Bale Robe is asking. @PMEthiopia Do you have an answer for Habiba? \n\nThank you team @addisstandard.", "#Ethiopia: Analysis: Tragedy struck #Ethiopia, again. “We are dealing with a different scenario.” https://addisstandard.com/analysis-tragedy-struck-ethiopia-again-we-are-dealing-with-a-different-scenario/ … A must read! @ZekuZelalem @BilehJelan", "My heart is heavy! Gemechis&I were together in Jimma University sharing z same Dormitory for years.His dream after college wasn’t to leave his country like we did or join a fancy company in Addis but to move back to his home town Nekemete Wollega&marry his high school girl friend", "Ethiopian National Defense Force members and USARAF staff gather in Addis Ababa to plan the 8th African Land Forces Summit, scheduled for February 2020. #ALFS2020 #Allied2Win @USAfricaCommand\n@USArmy\n@USEmbassyAddis", "At the public job-board around Arat Kilo in Addis, where hundreds of job seekers converge every day to look for openings. These are, however, the “lucky ones“ as many more  job seekers have difficulty accessing information about jobs and vacancies.@Dr_Ephrem #etworks #jobssummit", "The desert locust incidence has spread to Raya Alamata, Raya Azebo & Hintalo Wajerat districts of Tigray. Today we have started Arial control in the region over 150 hectares. The control of this cycle will continue up to December 2019 in partnership with #DLCO-EA, #FAO & #CRC/FAO", "Youth allegedly set ablaze constr. materials of #GEBECONPLC ystrdy in #Amhara region. \n\nThe cause & loss have not been identified.#Gemshu Beyene who also owns 5* hotel in the capital [Elilly Hotel],says 1.2bln ETB is prone to destruction.#Ethiopia Pics@ SM https://bbc.in/2plc05N ", "Vigilantes killed West Region's operation director of @ethiotelecom in Neqemete.", "#Kenya turns to #Saudi investor to make water drinkable in arid #Turkana region https://www.theguardian.com/global-development/2019/oct/28/kenya-turns-to-saudi-investor-to-make-water-drinkable-in-arid-turkana-region-kenya?CMP=share_btn_tw … \"News of the Saudi interest followed a recent announcement by government officials that water held in an aquifer discovered six years ago was not suitable to drink.\"", "Federalism Best for #Ethiopia if Implementation Gaps Bridged https://www.ena.et/en/?p=10388  However, serious gaps were observed in the implementation of the system particularly in self administration, accommodating diversity, land administration, and engagement in national issues.", "The Situation of Beledweyne is moving into extremely tragic situation. the water level is rising & moving fast. There are many families who are still trapped in the town. A boat carrying 18 pple capsized in the heavy floods this morning, 6 people rescued so far,12 still missing.", "KenGen, Tulu Moye Geothermal Operations sign drilling contract - via @addisstandard | #KenGenEnergizingAfrica", "Just before the harvest begin, farmers in Tigray are facing a 1984-type situation because of Desert Locust invasion. Please do something. The Federal Ministry of Agriculture needs to help here.\n @PMEthiopia @amirabiy @Tseday @tselemma @addisstandard @DrTedros @DrSenait", "#Ethiopia: 13, 034 returnees from #KSA & other countries benefited from post-arrival assistance.Non-KSA returnees received health screening, accommodation & food, onward transport assistance, cash grants, psycho-social counseling, economic,& social support https://reliefweb.int/sites/reliefweb.int/files/resources/IOM%20Ethiopia%20-%20Programmatic%20highlights%20-%20September%202019.pdf …", "News: Social enterprise world forum concludes in #AddisAbeba https://addisstandard.com/news-social-enterprise-world-forum-sewf-2019-concludes-in-addis-abeba/ …\nIt is estimated that there are about 55,000 such social enterprises in #Ethiopia according to a British Council research. Among these is Tebita Ambulance, the first private ambulance service...", "The Infestation of Large Locust Army has invaded various places of Tigray. These locust swarms have already caused some damage to food growing in the fields of Raya farmers. The people of Tigray are fighting the invasion & expansion of these desert locusts.\n#Ethiopia", "Loved visit to @UNESCO #WorldHeritage listed #Lalibela churches hewn out of rock in 12th/13th century. An extraordinary achievement given tools/technology available at that time. Highly recommend seeing these cultural treasures in #Ethiopia . @nzinethiopia @TesfaTours", "#Ethiopia: New $5m National Blood Bank inaugurated https://fanabc.com/english/2019/10/new-5m-national-blood-bank-inaugurated/ … \"The new facility will provide the National Blood Bank Services with the capacity to receive a much-increased volume of blood donations, screen and process blood products more efficiently....\"", "Ethiopians are actively participating in the National Blood Donation Campaign. \n\n2,305 donated +registered online and 3,127 donated (online registration is on progress) \nA total of 5,432 People have donated so far. \nMy most profound gratitude goes to all the voluntary donors.", "#Ethiopia's gender revolution: The road towards equality https://www.france24.com/en/africa/20191025-ethiopia-s-gender-revolution-the-road-towards-equality … via @FRANCE24", "Plagues of locust endangering the livelihoods of millions in Tigray and Wollo as well as Eritrea, Yemen and Sudan. The international community and authorities need to urgently step up their action.  https://m.youtube.com/watch?v=UsZIdXggHTg&fbclid=IwAR1_oEJYEp6z-Kv1tqzr_JQ5kaURq7XIQ5Bon83YdsKcNLHpxASx4-NiDd0 …", "Update: 67 Killed in #Ethiopia Unrest, but Nobel-Winning Prime Minister Is Quiet\nhttps://www.nytimes.com/2019/10/25/world/africa/ethiopia-protests-prime-minister.html …  \"[@AbiyAhmedAli ’s] failure to return to Ethiopia when the protests broke out, or to say anything to try to calm the tensions, has disappointed some  Ethiopians.\"", "A powerful music video about preventable pregnancy related maternal deaths by popular #Ethiopian musicians - Lib Yaleh featuring by Zeritu Kebede @ZerituOfficial & Tadele Gemechu - Official Music Video https://youtu.be/rsOeJFYro2Y  #Ethiopia \n\nNo Woman Should Die While Giving Life!", "የአንደኛ እመት ተማሪዎቻችን በፍቅር መቀበል ጀምረናል:: የኹሓ ከተማ ማህበረሰብ አባላትም በተለያዩ ዝግጅቶች ተማሪዎቻችን \"እንኳን ደህና መጣቹህ\" እያሉ ነው::  @MekUniETH @momonafm96 @Atakltihailese1 @goitom_tegegn", "Local bosses may fill the party-sized hole in #Ethiopia’s next election https://www.ethiopia-insight.com/2019/10/25/local-bosses-may-fill-the-party-sized-hole-in-ethiopias-next-election/ … \"In the forthcoming elections, new & unpredictable factors will interact. First & foremost, the recent democratic opening, primarily the return & release of opposition elements...\"", "#Tanzania arrests four #Chinese workers for slow work https://www.bbc.com/news/live/world-africa-47639452?ns_mchannel=social&ns_source=twitter&ns_campaign=bbc_live&ns_linkname=5db271a06ea85e066965f279%26Tanzania%20arrests%20four%20Chinese%20workers%20for%20slow%20work%262019-10-25T08%3A02%3A49.714Z&ns_fee=0&pinned_post_locator=urn:asset:39b8e205-e1ec-4cd2-adc0-2315bbd41984&pinned_post_asset_id=5db271a06ea85e066965f279&pinned_post_type=share … The contractors were arrested because of slow progress in a state-funded project in the coastal city of Dar es Salaam.", "I assured z Ambassadors of Canada, HE Mr. Antonie Chevier,  Germany, Mrs. Brita Wagner @GerEmbAddis, UK, Dr. Alstair Mcphail @UKinEthiopia & USA, Mr.Michael Reynor @USEmbassyAddis that my gov't is fully committed to settle z concerns raised by families of z crash victims ET 302.", "#Ethiopian journalist attacked while reporting clashes https://www.bbc.com/news/live/world-africa-47639452?ns_mchannel=social&ns_source=twitter&ns_campaign=bbc_live&ns_linkname=5db2d7856ea85e066965f2e1%26Ethiopian%20journalist%20attacked%20while%20reporting%20clashes%262019-10-25T12%3A18%3A06.281Z&ns_fee=0&pinned_post_locator=urn:asset:d2022e4a-2166-4903-925a-25c91d208605&pinned_post_asset_id=5db2d7856ea85e066965f2e1&pinned_post_type=share … Muktar Jemal of Voice of America said he was attacked in #Adama city \"while covering clashes between supporters and critics of influential activist and journalist Jawar Mohammed.\"", "#Ethiopia Military-Linked Group Seeks Asset Sales, Debt Write-Off\nhttps://www.bloomberg.com/news/articles/2019-10-25/ethiopia-military-linked-group-seeks-asset-sales-debt-write-off?cmpid%3D=socialflow-twitter-africa&utm_content=africa&utm_source=twitter&utm_medium=social&utm_campaign=socialflow-organic … \"Metals & Engineering Corp. hired valuers to assess its businesses operating in industries from hi-tech engineering to automotive, Brigadier General Ahmed Hamza, the director general, said.\"", "#Ethiopia and The Republic of Ireland Signed a Financing agreement on the Productive Safety Net Program (PSNP IV)  amounting to 10M Euro. The agreement is to enhance and improve vulnerable and food insecure households’ livelihood, resilience to shocks, food security & nutrition.", "#Sudan, #SouthSudan resolve border disputes https://www.theeastafrican.co.ke/news/africa/Sudan--South-Sudan-resolve-border-disputes-/4552902-5321920-lcrf5w/index.html … \"Sudan and South Sudan have made a major breakthrough in border talks that concluded on Tuesday in Khartoum leaving only five areas subject to further negotiations.\"", "Today @malmostad inaugurate a Freedom of Expression Library. It will be named The Dawit Isaak Library to honour writer and journo #Dawitisaak imprisoned w/o sentence in #Eritrea since 2001. @BetlehemDIsaak @abraham_zere @EsayasIsaak @PENsweden @RSF_RUG and others take part.", "#Somaliland & #Ethiopia Working Towards Stronger Trade Ties https://www.horndiplomat.com/2019/10/24/somaliland-and-ethiopia-working-towards-stronger-trade-ties/ … “Somaliland & Ethiopia have a warm & historical tie that is anchored on trade & Security Cooperation. We are continuing to enhance our cooperation on trade, infrastructure dev't & education.”", "“I love music and I want to give back to Ethiopia as the country opened its door to me”, says Somali refugee Dadir  when meeting High Profile Supporter @itsbettyg \n\nDadir is lead singer in the wining band of Melkadida Talent Show 2018. 26 Oct, Melkadida Talent Show 2019 is on", "Update: Following request by #Oromia regional state, members of the national defense force are dispatched to places affected by latest protests, violent confrontations & clashes. Places include #Ambo, #Bishoftu, #Adama, #BaleRobe, #Mojo, #DireDawa & #Harar https://fanabc.com/2019/10/%e1%89%a0%e1%8a%a6%e1%88%ae%e1%88%9a%e1%8b%ab-%e1%8a%ad%e1%88%8d%e1%88%8d-%e1%8b%a8%e1%8d%80%e1%8c%a5%e1%89%b3-%e1%88%98%e1%8b%b0%e1%8d%8d%e1%88%a8%e1%88%b5-%e1%89%a0%e1%89%b0%e1%8a%a8%e1%88%b0/ …", "#Ethiopia- #Qatar: Spokesperson of Qatar's Ministry of Foreign Affairs, Lolwah Alkhater, meets Ethiopian ministers, officials https://www.gulf-times.com/story/645390/Alkhater-meets-Ethiopian-ministers-officials … … Alkhater reiterated Qatar's support for the positive reforms Ethiopia is taking and called for promoting bilateral relations.", "Let’s push a little further !! We are closer to our today’s #Challenge #10,000!!! We can make it !!! @yaregal3 @amirabiy @BelayAbiy @greencitiesET @addisstandard @DrSenait @DrTsion @dahabesha @Samru_Q @GetachewSS @EliasMeseret Tomorrow will be #DonationPicsChallenge!!! Exciting!!", "News:Food markets near #Ethiopia's poor provide too little diversity at too high a price https://addisstandard.com/news-food-markets-near-ethiopias-poor-provide-too-little-diversity-at-too-high-a-price-new-study/ … The rural poor in  tend to live near lower-quality markets that sell fewer food groups at high prices,adversely impacting the health of children in these communities", "#Ethiopia National Displacement Report https://displacement.iom.int/system/tdf/reports/DTM%20Ethiopia%20R18%20National%20Displacement%20Report%20v5.pdf?file=1&type=node&id=6851 … \"According to the data collected in July 2019, 1,642,458 individuals (321,537 households), are internally displaced across 1,163 sites in #Ethiopia. This reflects a 26.5% decrease since the May 2019 data collection.\"", "BREAKING: Indonesian report says Lion Air jet crashed due to aircraft design flaws, inadequate training, maintenance issues.", "#US Seeking to Mediate Feud Over Nile Dam https://www.voanews.com/africa/us-seeking-mediate-feud-over-nile-dam … \"The Trump administration has invited the foreign ministers of #Egypt, #Ethiopia & #Sudan to Washington to discuss a giant hydropower dam project on Ethiopia's Blue Nile...\" #GERD", "Alleged killer Ibrahim Issak-Hussen fled to #Ethiopia https://www.thespec.com/news-story/9660202-alleged-killer-ibrahim-issak-hussen-fled-to-ethiopia-hamilton-police/#.XbKpEXyH-vo.twitter … #Canada Border Services Agency notified Hamilton police that Ibrahim flew from Toronto to Ethiopia on the morning of Oct. 20, less than 36 hrs after the fatal shooting of 29-year-old Obsa Junedi-Mohamed", "#African Refugees Evacuated from #Libya Tell Horror Stories in #Rwanda\nhttps://www.voanews.com/africa/african-refugees-evacuated-libya-tell-horror-stories-rwanda … The 189 migrants are mostly #Eritreans but also #Somalis, #Ethiopians &  #Sudanese. They say they still want to make the dangerous journey to #Europe.", "In a major shift, the leader of ONLF Mohamed Omar Osman announced in Jigjiga that ONLF will change the name if stakeholders bring a name which will unite the Somali people. ONLF mega-conference will be held in Godey in early Nov. where changes are expected", "Alex Lewis returns from an #Ethiopian challenge https://www.itv.com/news/meridian/2019-10-24/alex-lewis-returns-from-an-ethiopian-challenge/ … A man from Hampshire has returned from his latest challenge with a fascinating story of endurance and adventure. [Alex Lewis] has scaled #Ethiopia's highest mountain with one of the country's top athletes.", "LATEST; the no of killed amid protests in #Ethiopia reaches at least 27. \n\n- Dodola 6 (today 4)\n- Dirree Dawa 5 (today 4)\n- Baroda 5\n- Ambo 5 (today 2) \n- Harar 3 \n- Adama 2 \n- Hammarressa 1 \nhttps://bbc.in/2BHoU0M \n#Ethiopia #Ethiopian #Oromoo", "Dr Kuang Tutlan, State Min. of Mines & Petroleum said some 4,000 barrels supplied to markets from the gas field in #Ogaden, #Somali regional state. Ethiopia also plans to commence construction of 760-km crude oil pipeline from #Ogaden to Djibouti this yr. https://www.facebook.com/watch/?v=1059282791069392 …", "And of the 50% revenue for a given region where the resource is found, 10% of it will be disbursed for the specific area where the resources is found while 40% of it will be for other parts of the region including the specific area where resource is found, as per Dr Kuang Tutlan.", "#Ethiopia: The new formula for revenue share b/n federal & regional states from oil exploration incomes: revenue share will be 50% for federal gov. & 50% for a given regional state where the resource is found. Of the 50% federal revenue, 25% will be disbursed to other regions.", "#Ethiopia More than 400 undocumented migrant workers have returned from Saudi Arabia today. Many of them young men. Some barefoot. An MoFA official said returnees are being given 1600ETB for travel fee to hometowns but some have said they haven’t received any. 1/", "News: Food markets near #Ethiopia's poor provide too little diversity at too high a price: new study https://addisstandard.com/news-food-markets-near-ethiopias-poor-provide-too-little-diversity-at-too-high-a-price-new-study/ … “But the touted solution to this problem has always been farm-level diversification, with little policy focus or research on the physical markets...\"", "#Ethiopia activist appeals for calm after 16 killed in clashes https://reut.rs/2ojMxJK  In Ambo, 100 km west of the capital, five  protesters had died from wounds from gunshots and stones since Wednesday, #Oromia regional police commissioner Kefyalew Tefera told Reuters", "92 Ethiopian migrants were assisted to voluntarily return to Addis Ababa from #Bosasso #Puntland; under https://migrationjointinitiative.org/  in coordination w/ Puntland Ministry of Interior, the Ethiopian Consulate #Garowe & @UNmigration Migration Response Centre #Bosasso\n#AfricaTrustFund", "New Leadership for African Rights Group Presents Opportunity https://www.hrw.org/news/2019/10/23/new-leadership-african-rights-group-presents-opportunity … \"Both @SolomonADersso and @remyngol have played key roles in advancing the protection  and promotion of human rights on the African continent through the  provisions of the African Charter.\"", "#Ethiopia Seeks to Calm Nile Tensions, Vowing More #Egypt Talks\nhttps://www.bloomberg.com/news/articles/2019-10-24/ethiopia-s-abiy-says-talks-with-egypt-can-resolve-nile-dispute …\n“We have no problem with having political negotiations with anyone; it will not disrupt the technical committee’s work,” PM Abiy Ahmed.", "Only two days left for the National Blood Donation Campaign. \nOctober 26, 2019- Let's us all get together to #DonateBlood and #SaveLives \nAlso, \nhttps://bloodbank.moh.gov.et/#/  register to be a regular blood donor.\nLife-4-Life!", "#agriculturalmodernization #Mechanization #AFPwheatcluster", "#Russia writes off more than $20 billion in African debt https://africa.cgtn.com/2019/10/24/russia-writes-off-more-than-20-billion-in-african-debt/ … Putin also said that Russia intends to increase its presence in #Africa at the state level.", "News update: More causalities, road blocks continue for 2nd day as elders, authorities attempt to pacify protests", "#Ethiopia: KenGen,Tulu Moye Geothermal Operations sign drilling contract https://addisstandard.com/news-kengentulu-moye-geothermal-operations-sign-drilling-contract/ … The project with an estimated capacity to generate 150MW will be developed in two phases to produce electric power in the Main Rift Valley & sell the power to Ethiopian Electric Power", "The #Ethiopian gov't has revealed that it will break ground on a satellite manufacturing, assembly, integration, and testing (MAIT) facility in the #AddisAbeba area in Jan. 2020, signaling the start of the second phase of its space development strategy. https://spacewatch.global/2019/10/ethiopia-to-begin-work-on-satellite-mait-facility-with-european-funding/ …", "“What Egypt wants is to make Ethiopia its hydrological colony,” said Zerihun Abebe Yigzaw @FT http://j.mp/2JgpRB6  #Ethiopia’s Prime Minister Dr Abiy Ahmed met with #Egyptian President Abdel Fattah el-Sisi #RussiaAfricaSummit @fanatelevision http://bit.ly/2MzUZiI ", "Denmark has committed DKK 100 million to support innovative approaches to building resilience for #refugees & host populations in #Ethiopia and #DeliveringRefugeeCompact. Pleasure to sign partnership agreement with @WFP today & supporting this programme with @SweinEthiopia", "#Ethiopia-#Egypt: Prime Minister Abiy Ahmed and President Abdel Fattah el-Sisi met today on the sidelines of #Sochi2019 Forum in #Russia. \"The two sides discussed bilateral relations between the two countries and issues of common concern,\" according to @AR_Ethiopia. #GERD", "The Queen has also received His Excellency Mr Fesseha Shawel Gebre who also presented his Letters of Credence as Ambassador from the Federal Democratic Republic of Ethiopia.\nMrs Asegedech Amberber was also received by Her Majesty.", "Must Watch!\nFormer #Ethiopia PM: Labeling me 'dictator' is wrong https://www.dw.com/en/former-ethiopia-pm-labeling-me-dictator-is-wrong/a-50955396?maca=en-Twitter-sharing … \"When there is a communist mentality and there is a Marxist mentality,  there is centralism where you don't utter a word after your party decides on issues, even though you have differences.\"", "OP:ED: The Nobel Prize for Abiy Ahmed: turning an irony in to an opportunity. (A must read by ⁦@DrMehari⁩).", "President Vladimir Putin has opened the first Russia-Africa summit in a bid to try and revive the country's influence in Africa. Putin told the continent's leaders he would seek to double trade in the coming years as Russia plays catch-up to China. http://u.afp.com/Jzrw ", "Update:@ShimelisAbdisa tells OBN that what happened last night at the residence of @Jawar_Mohammed is \"unacceptable\"; said it will be   investigated & those responsible will be held to account. He also blamed \"forces bent on distabilizing\" the region. Vid: https://www.facebook.com/OBNAfaanoromo/videos/689893958167735/ …", "#Russia Vows to Forgive #Ethiopia's Debts Amid Growing Push for Influence in #Africa https://www.themoscowtimes.com/2019/10/22/russia-vows-to-forgive-ethiopias-debts-amid-growing-push-for-influence-in-africa-a67851 … Pres. Vladimir Putin announced Monday that Moscow will soon forgive Ethiopia its debts- the 4th African country as Russia moves to increase its influence on the continent.", "UPDATE:\nTotal of six protesters killed today in #Ethiopia following massive rallies across Oromia region. 3 people shot and killed in Ambo, 2 in Adama and 1 near Harar. \nSocial media reports suggest hign number of casualties. #Oromia", "Calming the Choppy Nile Dam Talks https://www.crisisgroup.org/africa/horn-africa/ethiopia/calming-choppy-nile-dam-talks … Ethiopian officials portray such concerns as quasi-imperialist. “The struggle is b/n a country which wants to ensure equitable &reasonable utilisation & another which wants to maintain a colonial-era treaty of injustice..\"", "#Ethiopia,#Russia sign agreement on coop'n in peaceful use of nuclear energy https://fanabc.com/english/2019/10/ethiopia-russia-sign-agreement-on-cooperation-in-peaceful-use-of-nuclear-energy/ … Rosatom State Nuclear Energy Corporation pointed out that the agrm't would pave the way for dialogue in the nuclear industry,as well as for the implementation of specific projects", "Visited the new facility for mentally disabled people of the Fremntos Fremnatos elders, mentally disabled & children Charity Org #Mekelle - it will accommodate more and will soon be inaugurated. This organisation is making a difference & we @MekUniETH r happy to be associated", "#Eritrean refugees defy border closures only to find hardship in #Ethiopia https://www.thenewhumanitarian.org/news-feature/2019/10/21/Eritrean-refugees-Ethiopia-border-closures … 's “open-camp” policy means refugees don’t have to stay in camps & can work or continue with their educatn. But most Eritreans here have no proof of their academic qualifications.", "H.E. Ambassador Fesseha Shawel had a private Audience with Her Majesty The Queen where he formally presented his #credentials as Ambassador of #Ethiopia to the United Kingdom. The Ambassador was accompanied by his wife, Mrs. Asegedech Amberber.\n\n#EthiopiaInUK \n@PMEthiopia", "#Ethiopia: Anti-Abiy protesters 'killed' in #Ethiopia https://www.bbc.com/news/live/world-africa-47639452?ns_mchannel=social&ns_source=twitter&ns_campaign=bbc_live&ns_linkname=5db04d629b8394066d941efd%26Anti-Abiy%20protesters%20%27killed%27%20in%20Ethiopia%262019-10-23T12%3A58%3A18.603Z&ns_fee=0&pinned_post_locator=urn:asset:ec6457eb-c616-4d58-ac3e-3dcd3a997eaf&pinned_post_asset_id=5db04d629b8394066d941efd&pinned_post_type=share … Three protesters have been killed & several injured after demonstrations against PM Abiy Ahmed turned violent, local officials said. Two protesters were killed in #Adama town and one near #Harar", "Excellent overview from Addis Standard", "PM met with President Vladimir Putin in a bilateral meeting on the margins of the Russia-Africa Summit. The two discussed on areas of cooperation b/n Russia & Ethiopia, in the areas of defense, education, nuclear technology for peaceful purposes & increased trade relations.", "Today’s protest claims 2 in Adama,1 in Hammaressa and 3 others injured in Ambo.", "#Ethiopia Probes Alleged Dam Misspending That Slowed Construction \nhttps://www.bloomberg.com/news/articles/2019-10-23/ethiopia-probes-alleged-dam-misspending-that-slowed-construction?utm_medium=social&utm_campaign=socialflow-organic&cmpid=socialflow-twitter-business&utm_source=twitter&utm_content=business …\nFormer contractor #Metec says some of funds unaccounted for             \nShowpiece GERD is a source of rising tensions with #Egypt", "Invited at National Palace 4 students/36 who sat for national school leaving exam within hours of giving birth!They attended luncheon Pres .Clear indication of changing attitudes on social norms on maternity & revealing their belief in education as life changing opportunity.", "#Ethiopia: Analysis: Protests, security standoff across Oromia, in Addis Abeba.What happened https://addisstandard.com/analysis-protests-security-standoff-across-oromia-in-addis-abeba-what-happened/ … A comprehensive background connecting the dots on why & how tensions have escalated leading up to today's spontaneous protest in Oromia & security standoof in AA.", "A Financial and Technical Agreements amounting to 74.5 Million Euro (approximately  2.4 Billion Ethiopian Birr) were signed today between Ethiopia and the Federal Republic of Germany at a ceremony held at the Ministry of Finance.", "Are we living in a 'constitutional moment'? What does 'learning to live with conflict' mean? I've attempted to raise these & other qns in this piece for AS. Happy reading @halelule @Abdeta2 @abiyetk @girma_mohammed @GirumTweets @Ambachew41 @KjetilTronvoll", "Thank you @addisstandard for well articulated obituary of our dear brother and mentor #EliasMelka that we missed him dearly @ZerituOfficial", "A recommended read of the day. A great piece by @BelachewM . I recommend you to take time and read it.", "Obituary: In memoriam of Elias Melka: A man larger than life https://addisstandard.com/obituary-in-memoriam-of-elias-melka-a-man-larger-than-life-2/ … \"...some songs hold out. They hold out long enough to define a movement, a culture and a generation; no one produced as many of these defining genres as the late Elias Melka.\"", "#Ethiopia: Five people die in motorboat accident in #Gamo Zone  https://fanabc.com/english/2019/10/five-people-died-in-motorboat-accident-in-gamo-zone/ … The accident occurred yesterday at 3pm local time when the vessel with 6 people on board was hit by waves. The boat was traveling from Loka Abaya to #ArbaMinch. One passenger was rescued.", "#Ethiopia: The Ethiopian Communications Authority (@eca_ethiopia) officially kicked off the public consultation process prior to  issuing new telecommunications licenses. http://www.mofed.gov.et/web/guest/-/launch-of-a-public-consultation-regarding-licensing-framework-of-telecommunications-sector-in-ethiopia … This important milestone signals the telecommunication market opening process", "I have registered to donate my blood. \n\nHave you? \nOnce you registered, you will receive a thank you note, a reminder every three months to #DonateBlood, and a notification when the blood you donated is taken to a hospital to be given to a patient. \n\n2,479 have already registered", "The ECA officially launches today a public consultation process prior to issuing new telecommunications licenses", "#Ethiopia: No force could stop #Ethiopia from building #GERD, says Premier https://fanabc.com/english/2019/10/no-force-could-stop-ethiopia-from-building-gerd-says-premier/ … “There is no other option. War cannot be a solution. If necessary, Ethiopia can ready million of people. No force could stop Ethiopia from building the dam,” PM @AbiyAhmedAli", "#Ethiopia to See Telecom Monopoly Breaks as Early as March Next Year https://addisfortune.news/news-alert/ethiopia-to-see-telecom-monopoly-breaks-as-early-as-march-next-year/ …\nProspective operators have until November 22, 2019, to submit feedback on the regulatory framework. \"We expect the country to have three telecom operators starting from April,\"Balcha Reba", "His response came amidst flurry of concerns raised by increasing numbers of politicians, political analysts & observers of Ethiopian politics casting doubts on whether or not the country can afford to hold the coming election and avoid the possibilities of post-election violence.", "PM ⁦@AbiyAhmedAli⁩ defends decision to hold election 2020 - Addis Standard #Ethiopia ⁦@addisstandard⁩", "#Ethiopia News: PM Abiy Ahmed defends decision to hold Election 2020 https://addisstandard.com/news-pm-abiy-defends-decision-to-hold-election-2020/ … \"Even though it's impossible to say we can hold an election which is free of challenges, it is possible to hold a successful election,\" PM @AbiyAhmedAli. #EthiopiaElections2020", "#Ethiopia: On concerns raised from MPs about election 2020, PM Abiy said it was impor't to consider that there can be no elections without challenges,but there will be more problems if the country postpones elections due to these challenges. \"Democracy is an exercise & a culture\"", "Saving #Ethiopia from its enigmatic present https://addisstandard.com/oped-saving-ethiopia-from-its-enigmatic-present/ … In no other time than the present is our future together brutally questioned. Neither have we come so close to democratizing the country. But, we are wondering as to how the country should be governed, @BelachewM", "Jubbaland leader Ahmed Madobe reappoints his current deputy leaders - Mohamud Sayid Aden, and Abdulkadir Haji Mohamed “Luga-Dhere” - as the first and second deputy leaders, respectively.", "The Commission elected its new Bureau which shall serve for two years. The Bureau is composed of Honourable Commissioner Solomon Ayele Dersso as Chairperson and Honourable Commissioner Rémy Ngoy Lumbu as Vice Chairperson. / News / ACHPR", "Update: PM #AbiyAhmed responding to unusually tough questions from members of parliament, that included why his administration insists in holding the election in May 2020 & how the government plans to ensure citizens' basic safety of moving from places to places, which is eroding", "ኢትዮ ቴሌኮም በመላው ሀገሪቱ ለሚገኙ ተማሪዎች የትምህርት ቁሳቁስ ድጋፍ አደረገ::\n#Ethiotelecom donates educational materials to students throughout the country. #Ethiopia @PMEthiopia @SahleWorkZewde @DrGete @FLEthiopia @EyobTolina @UNICEFEthiopia", "It was my pleasure to welcome the Ethiopian Finance Minister Ahmed Shide and Governor Yinager Dessie. I assured them of our strong commitment to support their reform efforts to spur sustainable and inclusive growth. #IMFAfrica", "Congratulations to #Ethiopia for its significant progress in its efforts against #moneylaundering, leading to the recent removal from the FATF-greylist! Denmark has been a proud supporter of this progress since 2013, through the Danish Peace and Stabilization Fund", "We are proud to be the first deaf-run paper bags company in the world. Using sign language to fight against plastic bags, has changed our life. Looking forward to meeting you all @_SEWF \n#SEWF2019 #Socialenterprise", "\"With technical support from the U.N. Food and Agriculture Organization (FAO), Ethiopia has developed a National Forest Inventory to monitor changes in forest cover.\"", "#Ethiopia: Ministry identifies 166 entities engaged in tax evasion, fake receipts https://fanabc.com/english/2019/10/ministry-identifies-166-entities-engaged-in-tax-evasion-fake-receipts/ … \"Of the total entities, 16 were arrested for falsifying records of financial transaction. About 136 entities conducted 6.9 bn birr worth illegal transaction,\" Adanech Said", "#Libya Coast Guard Intercepts Dozens of #Europe-Bound Migrants https://www.voanews.com/africa/libya-coast-guard-intercepts-dozens-europe-bound-migrants … Gassim said a rubber boat with 89 #African migrants, including 16 women and two children,was stopped Saturday off Libya's western town of Khoms, around 120 kilometers (75 miles) east of Tripoli", "The success of #Somaliland and other examples show the limits of Western political thinking on #Africa https://www.horndiplomat.com/2019/10/19/the-success-of-somaliland-and-other-examples-show-the-limits-of-western-political-thinking-on-africa/ … \"...since its unilateral declaration of independence in 1991, Somaliland has enjoyed independent administrative and political systems.\" via @Horndiplomat", "Update: Ambo Univ has today inaugurated a Culture & Research Center named after the late Laureate Tsegaye Gebre-Medhin in the presence of the art community, including Abebe Balcha, who spoke about him titled: “The Person I Know\"; & singer Haacaaluu Hundeessaa, who is his relative", "#Ethiopia: PM @AbiyAhmedAli will appear tomorrow at the HoPR where he is expected to respond to questions from MPs. Parliament is also expected to approve the motion presented by Pres. @SahleWorkZewde at the joint session of both Houses outlining gov. endevours for this fiscal yr", "Impromptu Raves & other offbeat moments from #Lebanon’s revolt\nhttps://www.bloomberg.com/news/articles/2019-10-20/impromptu-raves-and-other-offbeat-moments-from-lebanon-s-revolt … Tens of thousands of protesters took to the streets of Lebanon for the fourth consecutive day,demanding the removal of a political elite they say has lined its pockets at the nation's expense", "#Ethiopia: Recouping the costs of forest conservation https://forestsnews.cifor.org/62524/getting-ethiopia-redd-ready?fnl=en … \"After eight years of hard work, Ethiopia has joined the roster of 39 that have now submitted Forest Reference Emissions Levels for REDD+. In theory, Ethiopia is now ready to defend its forests...\"", "On #AfricanHumanRightsDay, CARD calls for @PMEthiopia Dr. @AbiyAhmedAli to renew his commitment for respecting rights of citizens. We request quick adoptation of revised draft of Anti-terrorism Law (ATP) and due process for those detained with the infamous, existing ATP.", "Ethiopia Signed a Project Support Agreement of over 4.6 Million USD  with the Kingdom of Sweden", "Why do irregular #migrants move from #Africa to #Europe? #ScalingFencesUNDP report shines a light why people move through irregular channels and their experience when they do. Read the full report https://bit.ly/2MRVfqA ", "An amazing debut for Degitu Azimeraw!\n\nShe wins the Amsterdam marathon in a new course record of 2:19:26.", "#SouthSudan's Machar says unlikely to be part of unity government by Nov. 12 https://reut.rs/2oOqVFG  “We in the SPLM-IO won’t be there because we don’t want to put the country into crisis,” he said. “The aspect needed for the establishment of such a government is not there.\"", "#Ethiopian politicians should agree a transition period https://www.ethiopia-insight.com/2019/10/20/ethiopian-politicians-should-agree-a-transition-period-and-use-it-wisely/ … The..transitional period would be one of political   realignment,in which like-minded orgs have the time to coalesce,while others beset by internal differences might break apart & create new alliances", "#Egypt to press for outside mediator in #Ethiopia dam dispute https://reut.rs/2Mwrg8V  “We’re hoping this meeting might produce an agreement on the participation of a fourth party,” an Egyptian FM official told journalists. “We’re hopeful to reach a formula in the next few weeks.”", "#China's model of a censored, highly-regulated internet (aka \"Internet Sovereignty\") is gaining appeal among a growing number of countries along #Beijing's highly-touted #BeltandRoad.", "The Ethio-French research team for the conservation of #lalibela churches. So proud to be part of this incredible human adventure. We’ll do our very best to help our ethiopian friends to préserve their heritage. @EmmanuelMacron @PMEthiopia @franckriester @antoine_petit_", "#Ethiopia: Taking ag-tech from Dunedin to Ethiopia and beyond https://thespinoff.co.nz/partner/chorus/21-10-2019/taking-ag-tech-from-dunedin-to-ethiopia-and-beyond/ …\n“We knew we had to move to a more automated system where farmers & users without knowledge of parasitology or science could rely on a  network of professionals across the world...\"", "Abay Industry’s dev.S.c # Gonder garment project is under commissioning#160 ppl are employed and it will reach 300 at the end of November# We have to focus on job creation.\nCheers!!!!", "“#Ethiopian farmers are eager to obtain new knowledge about the essential  principles of farming: for instance, the utilization of nitrogen-fixing  bacteria, composting, proper plant distribution and new tools to weed  the crops in a timely fashion,”", "How #Ethiopia's ruling coalition created a playbook for disinformation https://globalvoices.org/2019/10/18/how-ethiopias-ruling-coalition-created-a-playbook-for-disinformation/ … \"A deep split that exists within Ethiopia's ruling coalition- EPRDF -was made evident over the last few weeks when a Facebook row broke out between two major political party members. \"", "Addis Standard has grown fast into Ethiopia's leading provider of news, current affairs and opinion. \n\nThe opinion pages refreshing, reflects nation's diversity. It is certainly gaining a lot of credibility. Well done.\n\n@addisstandard\nhttps://addisstandard.com/ ", "PM Abiy launches book on his \"Medemer\" philosophy designed to replace Meles's revolutionary democracy, developmentalism", "#Ethiopia=#Israel: \"It was keisim who performed weddings among the #Jewish community in  Ethiopia, but since the religious leaders’ authority is not recognized  by the Chief Rabbinate here, they have been prevented from marrying Ethiopian Jews'", "#Ethiopia News: PM Abiy Ahmed launches his book \"Medmer\" https://addisstandard.com/news-pm-abiy-ahmed-launches-his-book-medmer/ … \"The 280-page book is the first for the PM since assuming office as Prime Minister and is being seen as articulating the economics, politics and foreign relations road map the country will follow.\"", "I was proud to lead our nation today in restoring our historic monuments of Sayidka, Dhagah-tur, Hawo-Tako, Ahmed Gurey and #SYL. These figures are the pride of all of our #Somali generations. Safeguarding our history reminds us of our historic journey and inspires our future.", "#Turkey, #Ethiopia to enhance #railway sector cooperation http://v.aa.com.tr/1618330  \"We intend to share Turkish State Railways' (TCDD) experience of 163 years with Ethiopia to support the country, thanks to the new deal,\" Ali Ihsan Uygun, general manager of TCDD, said.", "Senait Fisseha: empowering women through reproductive health https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(19)32308-6/fulltext#.XanRXOL0ydE.twitter … “One of my guiding principles is the belief that we cannot accept the status quo,\" @DrSenait on access to reproductive health sevices. #Ethiopia", "#ethiopia this is unacceptable. An annual event planned a year ago. 17 Int’l & 100 local exhibitors, 4000 visitors, focus on livestock industry shut down with no consideration to the negative impact on conference tourism & investor confidence. Clearly, #conference #tourism 1/", "Update: The search for victims of Sunday's landslide in #Konta special district in #SNNPRS has been completed. The total number of victims is 22 while 481 households were displaced & property worth 27 m birr (nearly $1 m) were damaged, as per authorities https://www.ena.et/?p=64887 ", "#Ethiopia News: #SNNPRS Council approves legal framework which makes #Hawassa city accountable to future #Sidama Regional State https://addisstandard.com/news-snnprs-council-approves-legal-framework-which-makes-hawassa-city-accountable-to-future-sidama-regional-state/ … The Council’s decision was voted in favor by 168, while 55 cast their votes against it. Twenty three members have abstained.", "\"One can only hope that the award of the Peace Prize will energize Ethiopians and help to usher in a new system of participatory and competitive democracy, transitional consensus-based federalism, inclusive economic delivery, and sustainable stability.\" - @DrMehari", "#Libya: #African #migrants bribe their way into detention centres-UNHCR http://www.africanews.com/2019/10/18/libya-african-migrants-bribe-their-way-into-detention-centres-unhcr/?utm_medium=AfricanewsEN … Others try to bribe their way to get inside the detention centre in the hope that @UNHCR will resettle them”, he told journalists in Geneva, Switzerland.", "LIVE: Turkish President Erdogan holds news conference about Turkey-Syria military operation.\n\nFor all the latest: https://aje.io/9w7dw ", "#Ebola survivors battle grief and stigma in eastern Congo https://af.reuters.com/article/topNews/idAFKBN1WX0PM-OZATP …", "#Ethiopia @EthiopianATA’s #Agribusiness& #Markets project team expands the National #Market Information System (#NMIS) to additional 52 market places in  #Oromia region. Awareness creation and skills upgrading training provided to ~180 experts over the last week", "#Ethiopia: Ethiopians Working In World Bank Express Readiness To Contribute For Ongoing Reform https://fanabc.com/english/2019/10/ethiopians-working-in-world-bank-group-express-readiness-to-contribute-for-ongoing-reform/ … The Minister briefed the participants regarding the ongoing political, economic and social reform measures in Ethiopia.", "#Ethiopia: 5 #Dutch floriculture companies to invest in #Amhara regional state https://fanabc.com/english/2019/10/five-dutch-floriculture-companies-to-invest-in-amhara-regional-state/ … It will be on 500 ha of land the region at a place called #Kunzila, where Amb. Bengt van Loosdrecht pledged to provide €20 m to improve the livelihoods of residents of the area", "Minister of Peace Muferihat Kamil & State Minister of Peace & Consensus Building Almaz Mekonnen meet w/ Aba Gedas from all across #Ethiopia to recognize & enhance the role of national & regional elders & traditional institutions in #peacebuilding.", "Prime Minister Abiy Ahmed met with leadership of the Afar and Somali regional states to discuss security related issues.\n\n#PMOEthiopia", "Recommended!\nOP:ED: The Nobel Prize for @AbiyAhmedAli: turning an irony in to an opportunity https://addisstandard.com/%ef%bb%bfoped-the-nobel-prize-for-abiy-ahmed-turning-an-irony-in-to-an-opportunity/ … As always,@DrMehari delivers his highly critical, yet powerfully constructive analysis on Ethiopian politics, this time through the prism of a Nobel Peace Prize!", "#Ethiopia: Is al-Shabab looking to Ethiopia? https://p.dw.com/p/3RNgi?maca=en-Twitter-sharing … \"Al-Shabab has mostly struck #Kenya when attacking outside of #Somalia's borders. But after recent arrests of alleged al-Shabab fighters in Ethiopia, is the Islamist group turning to Ethiopia as a new target?\"", "#Ethiopia: #Gedeo & #WestGuji (As of 30 Sep. 2019) https://reliefweb.int/report/ethiopia/ethiopia-access-snapshot-gedeo-and-west-guji-30-september-2019?utm_medium=social&utm_campaign=shared&utm_source=twitter.com … \"The humanitarian landscape in the sub-region remains marked by the needs of thousands of IDPs returned to areas of origin as well as of those who chose to not return...\"", "#Happeningnow @UNWomen Executive Director Dr Phumzile Mlambo-Ngcuka is discussing with @UNEthiopia on #Beijing+25, #GenerationEquality campaign as well as  gender equality and women’s empowerment issues in #Ethiopia @unwomenafrica @MoF_Ethiopia @ChiwaraLetty @swomamo", "#Ethiopia won’t accept other proposals on #GERD: Minister  https://fanabc.com/english/2019/10/ethiopia-wont-accept-other-proposals-on-gerd-minister/ …\n\"#Egypt proposed the dam to release 40 billion cubic meters of water every year, release more water when the Aswan Dam goes below 165 meters above sea level, and invited a third party.\"", "Note from the editors: A while ago @MayorofAddis released a statement dismissing as false the report of @TakeleUma's departure from his position. It came shortly after the meeting by the ODP's Central Committee was finalized. \n\nAS stands by the timing and accuracy of its story.", "We have distributed 15,800,000 Long lasting insecticidal nets (LLINs) worth of 729,900,000 million birr over 3months period procured by @GlobalFund and @GHSupplyChain-PSM. #preventmalaria https://www.facebook.com/509380262907473/posts/649713542207477?sfns=mo …", "#Ethiopia: Deputy Pres. of #SNNPRS, Ristu Yirdaw, said the mushrooming self-administration questions, which are becoming the causes of security crisis in the regional state, are driven from the interests of a few political elites & businesses than reality https://www.ena.et/?p=64790 ", "Ethiopia may use proceeds from liberalising state enterprises to pay off government-guaranteed bad debts in agriculture & manufacturing issued by two key state banks. They in turn could be recapitalised, depending on pending recommendations on their health", "Kenya to roll out free cervical cancer vaccine", "#IGAD meeting on cross border pastoralism ends without deal https://observer.ug/news/headlines/62317-igad-meeting-on-cross-border-pastoralism-ends-without-deal … The meeting held last week in #Entebbe was to see all the 7 countries sign an agreement that would allow cross border pastoralism &how individual countries would provide services to pastoralists..", "#Ethiopia: E-visa Improves Tourist Flow to Ethiopia https://www.ena.et/en/?p=10179  Over 200,000 people from 217 countries visited Ethiopia so far, which the Ethiopian Airlines Group said a result of cooperation between the Group and Ethiopian Immigration Services. @flyethiopian", "Volkswagen (VW) plans to start a ride-hailing business in #Ethiopia. \nThe company is now testing a new ride-hailing business in #Rwanda that it hopes to expand in Africa starting with Ghana and Ethiopia, the Independent, a local media in Rwanda, reported.", "#Africa: Africa loses $45B due to weak financial accounts system http://v.aa.com.tr/1615813  The Public Financial Management Forum, 2019 was held under the theme: Strengthening Public Sector Accounting in Africa.", "HappeningNow: Official opening of the 5th Conference of #African Ministers responsible for Civil Registration in #Lusaka, #Zambia. Ministers seeking to close the identity gap on the continent where over 550m people lack legal identity.\n#LeaveNoOneBehind #CRVS #ID4D #LegalID #SDGs", "#Ethiopia: Nokia partners Ethiopian universities to train students on 4G, 5G http://www.itwebafrica.com/ict-and-governance/373-ethiopia/246571-nokia-partners-ethiopian-universities-to-train-students-on-4g-5g … @nokia The collaboration will support the students in acquiring the right competencies and the necessary skills to succeed in a fast-changing labour market.", "#Ethiopia: Political parties’ views on merger, identity-based, multinational organization https://www.press.et/english/?p=14225# … On the other hand, only a few are organized as multinational parities. Recently, the ruling EPRDF has unveiled  its political project to form a single national party.", "#Ethiopia: Political parties’ views on merger, identity-based, multinational organization https://www.press.et/english/?p=14225 … Recently, the ruling EPRDF has unveiled  its political project to form a single national party.", "Baltimore Democratic Rep. Elijah Cummings has died https://apnews.com/472ab99bda374c3ba906366d2f0a6d00 … \"Cummings became the powerful chairman of a U.S. House committee that investigated President Donald Trump, & was a formidable orator who passionately advocated for the poor in his black-majority district.\"", "#Ethiopia: Unable to stop bouts of violence in its midst, #Amhara region's Peace and Security Council calls for federal army intervention https://addisstandard.com/news-unable-to-stop-bouts-of-violence-in-its-midst-amhara-regions-peace-and-security-council-calls-for-federal-army-intervention/ … a directive has been issued for Fed. Security Forces including the Fed. Defense Forces to take “any lawful measures.”", "#Ethiopia grants equipment to #SouthSudan’s military training https://www.press.et/english/?p=14221 … …  After receiving the support, Gabriel Chanson Chang, Deputy Chair of the  National Transitional Council said that Ethiopia’s role in implementing  the peace agreement process is praiseworthy.", "The United Nations High Commissioner for Refugees (UNHCR) pledges to help South Africa streamline its asylum system and improve access to documentation for refugees and asylum-seekers", "Side discussion at #ARM2019 with hospital CEOs, Regional Health Bureaus, quality directors, associations & partners on #I-Care /#ያገባኛል/ initiative-reform activities for high volume government hospitals. Reform will be piloted in 24 hospitals in EFY2012 & scale up nationwide.", "A delight to meet w/Minister Ergogie to take stock of progress on various national & regional labour mobility & community development initiatives necessary for effective labour migration governance in #Ethiopia ⁦@ErgogieTesfaye⁩ ⁦@moonga_malambo⁩ ⁦@IOMEthiopia⁩", "#Ethiopia: Briefing: Five challenges facing Ethiopia’s Abiy: https://www.thenewhumanitarian.org/analysis/2019/10/16/Abiy-Ethiopia-Eritrea-Nobel-peace-Tigray … (@newhumanitarian) @AbiyAhmedAli", "#Ethiopia: #AbiyAhmed Won the Nobel Peace Prize. Now He Needs to Earn It. https://nyti.ms/2VLsJew  Real peace with Eritrea can only be achieved if a tripartite agreement is reached between the national gov'ts of #Ethiopia & #Eritrea, as well as the regional authorities in #Tigray\"", "#BREAKING: Sudan has ordered closure of its borders with Libya and Central African Republic over security concerns -- first such decision by the ruling Sovereign Council since the fall of autocrat Omar al-Bashir. @AFP", "Ethiopia's State Minister at the Ministry of  Peace Almaz Mekonnen  speaks on inclusive peace as key to integration in Horn. #EthiopianForeignPolicy", "There is a high risk of Ebola spreading to China, Russia, India, Europe and the United States, according to a recent study", "A delegation from Zambia Red Cross visits the Netherlands Red Cross financed Pneumonia Reduction Project in South Gondar Zone of the Amhara Region.", "#Ethiopia: Ethiopia’s homegrown economic reform aims to attract more FDI: DPM  https://fanabc.com/english/2019/10/ethiopias-homegrown-economic-reform-aims-to-attract-more-fdi-dpm/ … He called on Ethiopian investors who took part in the forum to use the opportunity to build business networking, while also inviting Italian investors to invest in Ethiopia.", "#Ethiopia: The Open Society Foundations are investing $10 million in the Cepheus Capital Growth Fund focused on supporting business development in Ethiopia..", "Exclusive interview with @addisstandard where I speak about APO Group’s journey from the inception and the time when ‘Africa’s voice was struggling to be heard’. \nRead- http://bit.ly/2pj24tj \n#APOGroup #Africa #Media #Africanow", "#Ethiopia: @mfaethiopia in collboartion with the gov. of #SaudiArabia repatraited 400 Ethiopians who were detained by the Kingdom's security while crossisng the Red Sea. This brings the No. of Ethiopians who were repatriated from d/t countries in the last 3 months only to 32890.", "#Ethiopia:The winning team developed a phone-based system that would avoid the use  of physical registration cards. Their solution envisioned a central  database managed by @NEBEthiopia that would classify voters into one of 2 groups, rural & urban voters.", "SEASON PREMIERE: Families and investigators are still searching for answers after two Boeing 737 MAX jets crashed. Fault Lines investigates and asks how the aviation industry and U.S. regulators failed. On Al Jazeera on Oct 16 at 22:30GMT | YouTube and http://aljazeera.com/faultlines ", "I am A+ blood donor!\n\nNational Blood Donation campaign is left with 9 days-October 26 to collect 10,000 units of blood, register 100,000 regular donors/day & 300,000 regular donors/month. \n\n#DonateBlood #SaveLives, know your blood type, and get sticker for ur phone, laptop & car!", "#EU Launches RESET Plus Innovation Fund in #Ethiopia https://reliefweb.int/report/ethiopia/eu-launches-reset-plus-innovation-fund-ethiopia?utm_medium=social&utm_campaign=shared&utm_source=twitter.com …  The RESET Plus Innovation Fund resilience is an initiative of the European Union (EU) to foster social innovation that enhances resilience-building in five regions of Ethiopia.", "#Ethiopia: 'This is #Dubai now': Nobel-winning PM's plan to transform #AddisAbeba", "Women in #Ethiopia trapped in cycle of abuse http://v.aa.com.tr/1615319  [Aregash] introduces a 2-year-old boy as her son who was born in #Tripoli.“I was taken to prison & was repeatedly beaten & raped by a prison guard & I got pregnant. My son will never happen to know his father.”", "#Kenya opens #Chinese-built railway linking Rift Valley town to #Nairobi\nhttps://e-news.us/kenya-opens-chinese-built-railway-linking-rift-valley-town-to-nairobi/ … The extension links to the $3.2 billion line between the port of Mombasa  and Nairobi that opened in 2017, also suffering from underutilization of its cargo services.", "#Ethiopia in but #China out as ACE names top 10 targets for #UK consultants https://www.newcivilengineer.com/latest/ethiopia-in-but-china-out-as-ace-names-top-10-targets-for-uk-consultants-16-10-2019/ … #Ethiopia, #Malaysia and #Mexico are among the 10 top targets for UK consultants seeking to export their expertise in post-Brexit Britain, according to new research from ACE.", "Leadership of ODP celebrated Prime Minister Abiy Ahmed earlier today at the Office of the Prime Minister for his Nobel Peace Prize recognition.\n\n#NobelPeacePrize", "Archaeologists have uncovered a \"huge cache\" of more than 20 sealed ancient Egyptian coffins in the city of Luxor", "#Ethiopia: Ethiopia, #Turkey set to increase tourism, agricultural cooperation https://fanabc.com/english/2019/10/ethiopia-turkey-set-to-increase-tourism-agricultural-cooperation/ … Of Turkey’s $6 billion total investment in Africa, about $ 2.5 billion is invested in Ethiopia.", "Sources told AS that ODP’s 9 member Exe. Committee is split into two between those who oppose the move and those who support it. However, the say by the 55 members of the CC will be crucial in deciding whether or not the party is dissolving itself to pave ways for Abiy’s proposal", "In an another development, the 55 member Central Committee of #ODP, which includes @TakeleUma,has convened this morning. The main agenda of the meeting is to discuss on the fate of the party in light of PM Abiy's  recent move to dissolve the existing structure of the ruling EPRDF", "News Alert: Addis mayor exits after meeting with PM Abiy https://addisstandard.com/news-alert-addis-mayor-exits-after-meeting-with-pm-abiy/ … A well placed source told AS that “The Prime Minister told Takele that he will be replaced by Adanech Abiebie [currently the Minister of Revenues], during [a] meeting three days ago.”", "We are excited that @amroteab, Regional Director, @4Afrika came 10th in the 6th Edition of the Choiseul 100 Africa ranking. This edition by Forbes Africa, highlights the top 100, young talented African leaders under 40 playing a critical role in developing the African economy.", "Exclusive: 'Africa's voice was struggling to be heard\": Nicolas Pompigne-Mognard https://addisstandard.com/exclusive-africas-voice-was-struggling-to-be-heard-nicolas-pompigne-mognard/ … AS' @EphreamS sat down for this interview with @APOfounder, who \"set out to solve the problem of #Africa's misrepresentation in the media,\" when he established @APO_source", "Several European countries have now suspended weapons exports to Turkey", "“All we get is repression from Spain.” \n\nViolent protests continue in Barcelona for a second day over the jailing of nine Catalan separatist leaders.", "#Ethiopia: In the last 4 yrs, the Fed Gov't has disbursed a subsidy of 6 bn birr (some $2.3m) to #AddisAbeba Light Rail,which is under the city admin. After having financed the project at a cost of $475m, Fed. gov continued subsidizing it,raising questions https://www.press.et/Ama/?p=20849&fbclid=IwAR0lBS3jd6Xv4Yd4NjEA7qVL-5GpsQPSADZo84GHqMFaV8SKHTfQ4TGFozY …", "Alfred Nobel catches 'Abiy-mania' https://brook.gs/35BNyO0  \"But the Nobel Committee’s announcement is also a call for attention: Abiy has finally taken the lid off #Ethiopia,initiating one of the world’s most impor't political transitions, but also its most fragile.\"@BrookingsInst", "#Ethiopia: @ethiotelecom has closed 47 short code AD services providers for  spamming its customers. Confirming 310 orgs which are currently engaged in short-code ads, the state owned Telecom company warned such service providers to respect the will of its customers: @ahadu_radio", "Hellish scenes as wildfires engulf Lebanon https://aje.io/4hsev ", "Addressing food insecurity is not only about surplus production; it is also about nutrition and nutritious food, said State Minister of Agriculture of #Ethiopia today at #WorldFoodDay", "#Kenya: Uhuru Kenyatta: Delivering heathcare for all in Kenya https://www.ft.com/content/33f5fd0a-db8f-11e9-8f9b-77216ebe1f17 …   The full-scale expansion of Afya Care to the remaining forty-three counties, and, by extension, to every Kenyan, began last month.", "#Ethiopia:At least 20 dead in Burji special woreda, in SNNPRS in a conflict related to recent dismantling of #Segen Wereda which pave ways to the creation of Burji special wereda. The Conflict was b/n those who support & oppose the new arrangement & others asking for a new wereda", "It happened!\nIn FIRST EVER @UNmigration international chartered flight from #Ethiopia, 154 #refugees departed from Addis Ababa to Kassel #Germany under the German #Resettlement program. A second flight is scheduled to depart mid-November with another 220 refugees.", "Ethiopian Prime Minister Ahmed invited Prime Minister Netanyahu to make an official visit to Ethiopia.", "\"Killing without any reason\": Deaths in rural #Ethiopia spark outcry https://news.yahoo.com/killing-without-reason-deaths-rural-ethiopia-spark-outcry-032902013.html?soc_src=community&soc_trk=tw … \nElders from the Bodi community, the main group earmarked for disarmament in the Lower Omo Valley,told AFP nearly 40 people had been killed as of mid-Oct but the toll could be far higher", "“Achieving gender equality is a long term sustainable effort” says HE @SahleWorkZewde at a high level event on “She for Business” organized in presence of the #Finland president", "50 years ago today, the former democratically-elected president of Somalia Abdirashid Ali Sharmarke was assassinated by a body guard while visiting the town of Las Anod. It’s thought the assassination was politically-motivated but details remained largely a mystery for 5 decades.", "#Finland Extends 60 Million Euro to #Ethiopia https://www.ena.et/en/?p=10141  The support is or education, rural development and water, sanitation and hygiene (WASH) program and will be implemented over the next 4 years. Ethiopia is Finland’s biggest development partner in #Africa.", "Update:@NEBEthiopia said #SidamaReferendum postponed to Nov. 20. While coordination b/n the Board & all stakeholders are ongoing,the postponement is largely due to delays in recruitment of election officials & fulfilment of legal & administrative framworks.https://www.facebook.com/fanabroadcasting/posts/2531626756928048?__tn__=K-R0.g …", "#Ethiopia Confident of $1 Billion From #WorldBank for New Program\nhttps://www.bloomberg.com/news/articles/2019-10-15/ethiopia-confident-of-1-billion-from-world-bank-for-new-program … “They have given us some objectives that have to be met every year for another $1 billion,” National Bank of  Ethiopia Governor Yinager Dessie said in an interview in his office.", "#Ethiopia: PM Abiy to launch book on #MEDEMER on Saturday  https://fanabc.com/english/2019/10/pm-dr-abiy-to-launch-book-on-medemer-on-saturday/ … The book, priced at 300 br (approx. $10.5) & available in #Amharic & #AfaanOromoo, will be launched simultaneously in some 20 cities/towns. Its #English version will be released after 3 months.", "#WorldBank asks #Sudan to pay $16bn debt arrears https://www.theeastafrican.co.ke/news/africa/World-Bank-asks-Sudan-to-pay--16bn-debt-arrears-/4552902-5310548-4oa35r/index.html … \"The [Bank's] Country Director for #Ethiopia, #Eritrea, #Sudan & $SouthSudan, Kari Turk, said it would be difficult for international financial institutions to provide any support to Khartoum at the moment.\"", "But that is not the render of the new parliament building Addis Standard. The design that won was the one by Treurniet Architectuur and Michiel Clercx Architectuur http://www.treurniet-architectuur.nl/en-us/projects/africanethiopian/ethiopianparliament.aspx …", "#Ethiopia-n Air Force Academy today graduated 166 pilots and technicians. About 17 of the graduates are pilots.", "The death toll from Typhoon Hagibis has risen to 72 in Japan, as thousands of residents remain without power or water and evening temperatures hover around 15 degrees Celsius (59 Fahrenheit)", "This is so heart breaking. @ZekuZelalem  Thank you so much for revealing this to us. MFA should start an internal investigation on the Ethiopian Counsel office in Beirut and hold them accountable for their incompetence and failure to protect the interest of an Ethiopian Citizen.", "#Sudan/ese peace negotiations launched in Juba https://www.dabangasudan.org/en/all-news/article/sudanese-peace-negotiations-launched-in-juba …  President of #Uganda Yoweri Museveni, #Ethiopia/n PM Abiy Ahmed, and #Egypt/ian PM Mustafa Madbouli affirmed their countries’ support to the #Sudan/ese peace process during the inaugural session. #SouthSudan", "Update: #AddisAbeba deputy mayor @TakeleUma inagurated Shegole Bus Depot, which lays on 52k sqm land and is coomplete with several services including maintainance and body works", "#Ethiopia: \"people involved in [human trafficking] act may be punished with death penalty.\"", "Happy International Day of #RuralWomen!\n\nEmpowering a woman empowers a whole community of women! \n\nHow Francesca's vision is reversing trends and changing lives ", "Follow links below to learn which projects are supported by @WorldBank in #Ethiopia & where they are implemented. Interactive map- http://wrld.bg/37HI50wLwRH  or https://maps.worldbank.org/  @CarrieTurk @Nklingen @addisstandard @MoF_Ethiopia", "Addis Ababa Mayor @TakeleUma officially opened the 21st Annual Review Meeting. On his opening speech, he acknowledged the Health professionals who work tirelessly and emphasized on the need of building Healthy citizens for the prosperous  that we always envision! #ARM2019", "Update: Last week, PM Abiy Ahmed inaugurated his signature park, \"Unity Park\" built using financial aid to the tune of 5bn birr provided by the #UAE. see news: https://addisstandard.com/news-pm-abiys-signature-park-inaugurates-today/ … \n\nIn March last year, the UAE injected $1 bn to help Ethiopia's depleted foreign currecy reserve", "#UAE to provide #Ethiopia with $370m for the construction of a new Parliament building. Tesfaye Daba, Chairperson of House’s Foreign Relations & Peace Affairs Standing Committee, said the decision follows recent visit of Speaker of the House to #AbuDhabi. https://www.facebook.com/hoprparliament/photos/pcb.2209371942502575/2209371695835933/?type=3&theater …", "'Tortured' and shackled pupils freed from #Nigerian Islamic school https://www.bbc.com/news/world-africa-50053725 … Police in northern Nigeria have freed 67 people who had been found shackled at an Islamic boarding school. The pupils, b/n the ages of 7 & 40, told police they had been tortured and abused.", "Update: Public demonstration condemening the killing of civilians by foreign forces & asking answers from the Fed. Gov't happening in various cities in #Afar region. According to information received by AS protests are ongoing in #Awash,#Gawane, #Afambo, #Konnaba & #Galalu cities", "#Ethiopia-#Finland: Pres. Sahle-Work meets with Finalnd's Pres. Sauli Niinisto at the Presidential Palace this morning https://fanabc.com/english/2019/10/finnish-president-to-arrive-in-addis-ababa-today/ … \nPres. Niinisto arrived in AA last night for a two-day official visit. He is also expected to meet with PM Abiy Ahmed for bilateral talks", "#Ethiopia: Living dirt poor in the midst of glamour. Why school feeding in Addis matters most https://addisstandard.com/analysis-living-dirt-poor-in-the-midst-of-glamour-why-school-feeding-in-addis-matters-most/ … Here is the story of children who clollapsed in schools due to lack of nuitrition. School feeding matters most to those with lived experiences of extreme poverty", "Why do newborns die following caesarean section in #Ethiopia? @AddisStandard @ZekuZelalem @globetrotter1_ @amirabiy @lia_tadesse @hgodefay @Abebab @WHOAFRO @tselemma @Tseday @Wazemaradio @AlMariam1 @MahletKS @LiyanaTefferi @girma_mohammed @DrSenait", "#Ethiopia:#Oromia region distributes over 114 tractors to enterprises https://fanabc.com/english/2019/10/oromia-regional-state-distributes-over-114-tractors-to-enterprises/ … @ShimelisAbdisa handed over the 75 hp tractors’ keys to the enterprises at a ceremony in #Shashemene city &said the regional state will import more agricultural machinery worth 4.5 bn br", "Today, International Rural Women's Day, we honour Addise & Alem from rural Ethiopia's young women beekeepers. The honey they harvest might taste like any quality honey; but it’s richer & sweeter when you know beekeepers behind it are getting education, gaining skills, & income.", "#Ethiopia Uses Drones in Bid to Help Improve Food Security\nhttps://www.bloomberg.com/news/articles/2019-10-15/ethiopia-uses-drones-in-bid-to-move-from-famine-to-food-security?utm_source=twitter&utm_campaign=socialflow-organic&utm_medium=social&utm_content=africa&cmpid%3D=socialflow-twitter-africa … “The reason Ethiopia’s agricultural sector has not developed is because we have not leveraged technology,” said @KhalidBomba of @EthiopianATA", "Many thanks for those of you who shared kind words upon coming across the thread on Lensa Lelisa Tufa. FYI...I have just learned that the court trial starts next month. We will be following the hearings and will update you, follow @AddisStandard also at http://AddisStandard.com .", "Link for our previous investigative report about the horrific abuse of Ethiopian domestic workers in #Lebanon, which is also available in pdf.\n\nSpecial Edition: Ethio-Lebanese corpse disposal inc: A bilateral effort to cover-up Ethiopian deaths in Lebanon", "#Ethiopia: Thread in #Amharic from our correspondent Zecharias Zelalem about the plight of Ethiopian domestic workers in Lebanon, a topic of his recent in depth investigation. \n\nStay tuned for the English language thread.", "#Ethiopia: The No. of people killed in y'day's landslide in #Konta special district of the Southern Nations, Nationalities, and Peoples' Regional State (#SNNPRS) reached 18; search for missing 4 more people ongoing, EBC said. The landslide happened after heavy rains in the area.", "In today’s National Day Ceremony held in Mekelle, Abdi Iley era flag of Somali Region was used instead of the correct and current flag of the Somali Regional state. \n\nThis is wrong and cynical. \n\n@addisstandard", "This morning Tony Blair chaired a panel at #FTAfrica summit, with Ethiopia's State Minister of Finance, @EyobTolina & @jose_massano, Governor of the Bank of Angola, to discuss 'Big Economies - Big Changes.'", "@AfarParty's statement about the armed men from #Djibouti was corroborated by Hussein Ali, administrator of the Wereda. Hussein also said that several domestic animals were also killed and properties vandalized. Three of the victims were children while four of them were women.", "#Ethiopia: 16 people, including children, killed in #Afar region  https://addisstandard.com/news-sixteen-people-including-children-killed-in-ethiopias-afar-region-after-armed-attacks-several-wounded/ … The reason for the attack was not immediately established & the perpetrators are at large. Afar region officials blame armed men from #Djibouti, but Ethiopia's ministry of defense denies.", "A total of 3,000 Ambulances were purchased by MoH, regions, city administration, and university hospitals matching funds. 1,200 Ambulances were distributed previously, and 200 Ambulances from the rest 1,800 are distributed today. We will finalize the distribution in six months.", "Artist Kiros Alemayehu has been awarded an honorary doctorate from Mekelle University @MekUniETH - a legend! #Tigray #Ethiopia", "#Ethiopia pushes avocado exports\nhttps://p.dw.com/p/3REWL?maca=en-Twitter-sharing … \nEthiopia's climate makes the country perfect for avocado farming. But its export potential has not been exploited yet. Now a project aimed at small-scale farmers is trying to change the trend.", "Update: Bahir Dar Court allowed 10, 000 br bail for suspects held in connection with the June 22 killing of senior officials. Bail Includes Bir. Gen Tefera Mamo, former head of the region's special force, & Col. Alebel Amare, former head of the region's peace & security bureau", "The Defence partnership goes from strength to strength. Senior officers of The Ethiopian National Defence Force partnered @CranfieldUni and @DefAcUK for the 5 day Strategic Leadership Programme. Big thanks to all involved #trustedpartners @UKinEthiopia #ethiopia @DefenceHQ", "Kenya is in talks for a total of $4.1 billion in loans from lenders including the African Development Bank, China, Japan and the World Bank", "Pasta gaining popularity in #Ethiopia\nhttps://www.world-grain.com/articles/12734-pasta-gaining-popularity-in-ethiopia … \"The growth rates for pasta products in Ethiopia are steadily increasing. But the country’s milling industry has very little access to imported durum wheat qualities.'", "Russia’s Africa summit is the latest step in its resurgence as a global power on the continent", "PM Abiy Ahmed & his delegation arrive in Juba, South Sudan and are received by President Salva kiir Mayardit. PM Abiy will be attending the IGAD Leaders Consultation on Reconciliation of the Sudanese Transitional Government and the Sudanese Armed Group. \n\n#PMOEthiopia", "Why I nominated Abiy Ahmed https://aje.io/4293u  To be clear, I didn't nominate Abiy b/s I believed he had effectively transformed the peace & security landscape in Ethiopia or the Horn of Africa..I nominated him partly b/s I view the #NobelPeace as a call to action: @awolallo", "#Ethiopia: PM Abiy Ahmed & his delegation arrived in #Juba, #SouthSudan, to take part in #IGAD member states consultative meeting aimed at reconciling the Sudanese Transitional Government and the Sudanese Armed Groups, the Ethiopian embassy in Juba said in a statement.", "#Bashir to be handed over to #ICC after local charges https://www.standardmedia.co.ke/article/2001345276/bashir-to-be-handed-over-to-icc-after-local-charges … The new administration in #Sudan has given its first major indication that it could hand over former President Omar al Bashir to the International Criminal Court to face crimes against humanity charges.", "“They beat us with belts. They raped us. Then they fed us. Then they raped us,” 18-year-old Eritrean girl recounts her experience in one of the Libyan detention centers.", "#Remembering: On this day \"14 Oct 2017\", #Somalia capital witnessed saddest day in its history. Truck loaded with explosives exploded at KM5 junction in #Mogadishu, killing more than 580 people, wounding near 350 others.", "#Turkey-#Syria offensive: #Kurds reach deal with Syrian army https://www.bbc.com/news/world-middle-east-50036901 … The Kurds in Syria say the Syrian government has agreed to send its army to the northern border to try to halt Turkey's offensive against them.", "Award-winning all-female produced movie tackles the hidden violence against women in Uganda. https://bbc.in/2MAnSsm ", "Back from displacement, students attend classes at the Baya elementary and secondary school in Gedeo Zone, southern Ethiopia, where UNHCR is investing on expanding the school infrastructure and rehabilitating facilities that were damaged due to communal violence.", "#Ethiopia: At least six people died in #Konta special district of the Southern Nations, Nationalities, and Peoples' (#SNNP) regional state yesterday due to landslides following heavy rains.", "Mortar bombs strike #Somalia/'s Mogadishu airport, six injured: https://reut.rs/2piVJxQ   The missions of the United Nations and African Union, as well as several embassies, are based inside the perimeter fence.", "#Sudan and #Ethiopia agree to establish joint oil pipeline https://www.middleeastmonitor.com/20191012-sudan-and-ethiopia-agree-to-establish-joint-oil-pipeline/#.XaQlNb1w4Qc.twitter … \"This came during a meeting held by Sudanese Minister of Energy and Mining Adel Mohamed Ibrahim, with his Ethiopian counterpart, Seleshi Bekele, in the capital Addis Abeba...\"", "#BREAKING Spain court hands Catalan leaders up to 13 years jail for independence bid", "Remains of #Kenyans who died in #Ethiopia crash headed home https://www.nation.co.ke/counties/nakuru/Ethiopia-plane-crash-victims-to-be-buried-Thursday/1183314-5309448-po7fj6/index.html … The International Criminal Police Organisation (Interpol) announced in September that it had positively identified all the 149 passengers and eight crew who died in the crash.", "#Ethiopia: Ethiopians celebrate National Flag Day https://fanabc.com/english/2019/10/ethiopia-to-celebrate-national-flag-day-on-monday/ … The day is being celebrated with the theme “Our flag is the result of the sum of our diversity and the pillar of our unity.”", "Hunger levels soar in Horn of #Africa as region faces driest summer in over 35 years https://reliefweb.int/report/ethiopia/hunger-levels-soar-horn-africa-region-faces-driest-summer-over-35-years?utm_medium=social&utm_campaign=shared&utm_source=twitter.com … #Ethiopia #Kenya #Somalia", "#14October For many families, the Zoobe Junction attack meant untold anguish of searching for their loved ones, some never to be found. One such family shares their story;\n\n#Zpe17", "Leaders of #Egypt & #Ethiopia to meet on Nile dam standoff: Sisi https://reut.rs/2Mbl4mB  Pres. Abdel Fattah al-Sisi said he would meet Ethiopian PM Abiy Ahmed in Russia to discuss a dispute over a hydropower dam that the Horn of Africa country is building on the River Nile. #GERD", "Horrible indeed, & the news is true. We've been appealing to the #Government of #Ethiopia to stop the aggression on #Afars supported by neighbouring states and terror groups but the negligence continues.@addisstandard @MoP_Ethiopia @PMEthiopia @USEmbassyAddis", "⁦@PMEthiopia ⁦@AbiyAhmedAli⁩ of #Ethiopia being awarded the #NobelPeacePrize2019, ought to lead to increased respect for #FreedomOfSpeech and #FreedomOfAssembly |    Analysis: Addis Abeba sees another round of arbitrary arrest - Addis Standard", "IGAD news was apparently overshadowed by Abiy Ahmed wining Nobel Peace Prize but it appears that during the meeting in Addis Ababa, IGAD Heads of State reached a consensus for Kenya to take over the next Chairmanship of the IGAD Assembly of Heads of State, per diplomatic source.", "- What are the strategic lessons from Ethiopia’s trajectory to economic #growth and industrial transformation?\n- #Ethiopia has initiated an #economic liberalization process. Does ownership matter for economic performance?\nInterview with H.E. Arkebe Oqubay \nhttps://youtu.be/yiIVhg6KAc0 ", "For further background on the arbitrary arrests of thousands of Addis Ababa's residents in September of 2018, my own report for Opride last year.", "This is the second incident of police executing mass arrests across Addis Ababa since Abiy Ahmed became Prime Minister. Below is Addis Standard's coverage of last year's similar rounding up of youths in the capital.", "THREAD: Mayhem in Addis Ababa, as government forces block roads, arrest activists & force the cancellation of a rally. @AddisStandard's coverage of the capital city's standoff a day after Prime Minister @AbiyAhmedAli won the Nobel Peace Prize. #Ethiopia", "The #EU funds the #Libyan Coast Guard to keep migrants out of Europe and detain them in a failed state, where they are at the mercy of militias & human traffickers.The U.N. agencies charged with protecting them have failed, placing migrants in grave danger", "Timeline:\nMay 2019, Kenya reinstated Wajir stopover for all flights from Mogadishu for “security checks”. Move reversed a previous agreement b/w Somalia and Kenya.\n\nAugust 2019, Somalia issued a notice to pilots that all flights to and from Kismayo stopover at Mogadishu airport.", "A delegation from Kenya led by the Majority Leader of the National Assembly Aden Barre Duale has arrived in Kismayo. It’s not clear yet if the plane carrying the Kenya delegation flew directly to Kismayo.", "Kenyan Eliud Kipchoge becomes the first athlete to run a marathon in under two hours, completing the 26.2 miles in 1:59:40\n\nhttps://bbc.in/315mRh7 ", "There are real grievances & marginalisation of Somalis in all #Ethiopian agencies and government employment. #EthiopianAirlines shall seriously consider how it engages the #Somali people in all areas, including employment, airfares, language used during flights to Somali towns.", "#Ethiopia- #Egypt \nPM Abiy Ahmed & Pres. Abdul Fattah al-Sisi held talks over the phone yes'day. Discussion focused on talks being held regarding the Grand Ethiopian Renaissance Dam (#GERD). Ethiopia stood by its decision to reject Egypt's latest proposal.\nhttps://fanabc.com/english/2019/10/ethiopian-egyptian-leaders-hold-talks-over-phone/ …", "An article on \" Maternal and perinatal death surveillance and response in Ethiopia: Achievements, challenges and prospects\" experience of Tigray region was published in PLOS ONE for your reading. #MPNDSR\n@PeterByass @profwendygraham\n@DrSenait @amirabiy", "BREAKING: A delegation from the Kenyan government is set to land Kismayo soon to attend the inauguration ceremony of Jubaland President Ahmed Madobe.The move comes after the Somali government last night suspended direct flights coming from Nairobi to Kismayo. #Somalia", "Etiyopya'da Su-27 düşmüş. Binbaşı rütbesindeki 2 pilot da hayatını kaybetmiş.", "\"At least 10 #Ethiopian migrants are dead after 2 vehicles collided near Berbera port city, #Somaliland on Friday. Reports emerging this morning put the death toll higher at 14, while 6 others are being treated in hospital for injuries-per local media,\"@HarunMaruf\n\nPics:@GeeskaM", "\"Nobody green-lighted this operation by Turkey, just the opposite. We pushed back very hard at all levels for the Turks not to commence this operation.\"\n\nUS defence chief responds to criticism, denies accusations they abandoned the Kurds in Syria https://aje.io/eqct5 ", "The Ministry of Health, Agency Offices, and Regional Health Bureaus’ regular meeting is started today. \nThe agendas are: \nCommunity Based Health Insurance Proclamation\nVerification of transformed Woredas at woreda, zone, region and federal level/ experience sharing (1/2)", "Congrats Prime Minister @AbiyAhmedAli, \nThe 2019 Nobel Peace Prize Laureate.  \nQuick stats about how Africa, Ethiopia & the world reacted today #NobelPrize #NobelPeacePrize via @TrendifyLive , realtime analytics sw w/ #AI capabilities from #Ottawa Canada.", "#Ethiopia: Major Hayelom Tesfaye & Major Sebri Towfik, two pilots of an SU-27 fighter jet, were killed yes'day when their jet crashed at Uke Denkaka area near Bishoftu city. Their jets crashed during an airshow exercise for upcoming graduation on Tuesday. RIP!\nSrc:@Ethiopia24News", "Pictures credit: @HSajwanization", "#Ethiopia: Major landmarks in #AbuDhabi were lit up last night in the tricolor of the #Ethiopian flag in celebration of Prime Minister @AbiyAhmedAli's #NobelPeacePrize.  \n\n#Ethiopia  #UAE.", "Congratulations to my brother & friend Prime Minister @AbiyAhmedAli, 2019 Nobel Peace Prize Laureate. Well deserved! Your remarkable commitment to Ethiopian unity, as well as regional peace and cooperation, are an inspiration to many in Africa.", "Joint Communique Issued at the end of the Official Visit of H.E. Abdallah Hamdok, Prime Minister of the Republic of the Sudan to the Federal Democratic Republic of Ethiopia.\n\n#PMOEthiopia", "I am humbled by the decision of the Norwegian Nobel Committee. My deepest gratitude to all committed and working for peace. This award is for Ethiopia and the African continent. We shall prosper in peace!", "The National Assembly of the People's Power of #Cuba elected H.E. Mr @SalvadorValdesM as Vicepresident of the Republic.  Congratulations!. @CubaMINREX @PMEthiopia @mfaethiopia @AUC_MoussaFaki @AU_KwesiQuartey @AUC_DPA @addisstandard @EthiopianNewsA", "ጓደኛዬ ጠቅላይ ሚንስትር ዐቢይ አሕመድ የኖቤል የሰላም ሽልማትን በማሸነፉ የተሰማኝን ደስታና ጥልቅ ስሜት ለመግለፅ እወዳለሁ፡፡ ጠቅላይ ሚንስትሩ ለቀጠናው ላመጣው ሰላምና ተስፋ ሽልማቱ  ይገባዋል፡፡ @AbiyAhmedAli", "Peace process in Sudan & for the multifaced reform agenda he is spearheading in Ethiopia. The people of Somali Region are beneficiaries of his peace & integration agenda for the Horn of Africa. Congratulations to all Ethiopians, Africans & peace-loving citizens of the world.\" 2/2", "#Ethiopia: Statement from Mustefe Omer, Vice Pres. of #Somali region.  \n\n\"Extremely delighted by the Nobel Committe’s decision to award the Nobel Peace Prize to PM Abiy Ahmed. PM Abiy deserves the recognition for bringing peace between Ethiopia & Eritrea, supporting the...1/2", "#Africa's female Chief Justices: #Sudan, #Ethiopia, #Zambia, #Lesotho, #Seychelles http://www.africanews.com/2019/10/11/africa-s-female-chief-justices-sudan-ethiopia-zambia-lesotho-seychelles/?utm_medium=AfricanewsEN …  The Supreme Court Judge was nominated by the judges’ professional association, which was part of a protest movement that helped oust Bashir in April. @ashenafi_meaza", "Girls have the right to reach their full potential. Every year of secondary schooling a girl receives boosts her earning power by as much as 25 per cent.\n\nOn this #DayOfTheGirl, we celebrate achievements by, with and for girls in the last 25 years and demand more.", "Congratulations Prime Minister @AbiyAhmedAli for being awarded the 2019 #NobelPeacePrize! for your leadership in bringing peace with #Eritrea . Proud to be #Ethiopian ", "\"We identify this as the most significant contribution to peace in the last year.\"\n\nBerit Reiss-Andersen, Chair of the Norwegian Nobel Committee, speaks to us about the choice of this year's #NobelPeacePrize.", "ጠቅላይ ሚኒስትራችን ዶ/ር ዓቢይ አህመድ የ2019 የኖበል ሠላም ሽልማትን አገኙ! እንኳን ደስ አሌት!እንኳን ደስ አለሽ እናት አገር ኢትዮጵያ! በአገራችን አራቱ ማዕዘን: በዓለም ዙርያ የምትኖሩ የዚች የተባረከች አገር ልጆች ሁሉ እንኳን ደስ አላችሁ!", "#ONLF congratulates PM Abiy Ahmed for receiving the Nobel Peace Prize. We confirm that his vision and commitment has facilitated the peace agreement in #Ogaden, #Oromia, #Ethiopia & Eritrea. We have high hopes that his drive to democratise will succeed. Keep going, we support you", ".@AbiyAhmedAli (Amharic: አብይ አህመድ አሊ, Oromo: Abiyyi Ahimad Alii; born 15 August 1976) was appointed the 12th @PMEthiopia on 2 April\n2018.\nHe grew up in a Muslim family & with Oromo Muslim and Christian grandparents #EthiopiaRising @PaulWallace123 https://www.rich.co.ke/media/docs/PX_014NSX0207.pdf …", "Congrats to PM #Aby. Premiata la pace #Etiopia #Eritrea. @GrimoldiPaolo @luigi_matteo #Nobel", "Statement attributable to the UN Secretary-General @antonioguterres on the awarding of the Nobel Peace Prize https://www.un.org/sg/en/content/sg/statement/2019-10-11/statement-attributable-the-secretary-general-the-awarding-of-the-nobel-peace-prize … \"His vision helped #Ethiopia & #Eritrea achieve a historic rapprochement,& I was honored to witness the signing of the peace agreement last year.\"", "Congratulations to our alumnus, Prime Minster Abiy Ahmed (PhD), for being awarded the Nobel Peace Prize for 2019. You have brought a great honour to #Africa, #Ethiopia and @IPSS_Addis. @PMEthiopia @TanaForum", "Congratulations to Prime Minister @AbiyAhmedAli of Ethiopia for being awarded the Nobel Peace Prize. \n\nHis vision helped Ethiopia and Eritrea achieve a historic rapprochement & his leadership has set a wonderful example for others in & beyond Africa.\n\nhttps://bit.ly/33mTN6e ", "News: PM Abiy Ahmed wins the Nobel Peace Prize for 2019 https://addisstandard.com/news-pm-abiy-ahmed-wins-the-nobel-peace-prize-for-2019-2/ … \"No doubt some people will think this year’s prize is being awarded too early. The Norwegian Nobel Committee believes it is now that Abiy Ahmed’s efforts deserve recognition and need encouragement.\"", "I sincerely congratulate @PMEthiopia H.E Abiy Ahmed Ali on his @NobelPrize success this year. He is a deserving winner and I have enjoyed working with him on strengthening regional cooperation.\n\nCongratulations PM Abiy.", "On behalf of Somaliland, I would like to congratulate my brother the Prime Minister of Ethiopia on winning the Nobel Peace Prize for 2019.\n\nYou have inspired the world for signing a peace deal with Eriteria and ending two decades of hostilities. well deserved award @AbiyAhmedAli", "BREAKING NEWS:\nThe Norwegian Nobel Committee has decided to award the Nobel Peace Prize for 2019 to Ethiopian Prime Minister Abiy Ahmed Ali.\n\n#NobelPrize #NobelPeacePrize", "Incredible and historic day for Ethiopian writers with @lemnsissay and @befeqe being awarded the annual Pen Pinter Prize and International Writer of Courage awards. Both gave beautiful & powerful speeches, accepting their awards on stage tonight at the British Library in London.", "#BREAKING: United States imposes sanctions against South Africa's powerful Gupta family, calling them a 'significant corruption network'. @AFP", "Somalia summons Kenya’s ambassador after a Kenyan-registered plane landed in the port city of Kismayo without “official permission”", "#Ethiopia: Community-led enforcement shows the way on ending child marriage in Ethiopia", "Met with HE Tsion Teklu, State #MinisterofEducation. Talked about #Ethiopia’s ambitions to improve education access & quality, esp. early years, girls’ retention, skills dev’t & learning outcomes. @UNICEFEthiopia supports the gov't to invest in young people as drivers of growth.", "#UNHCR applauds #Ethiopia/’s regional peace efforts, support to #refugees https://fanabc.com/english/2019/10/unhcr-applauds-ethiopias-regional-peace-efforts-support-to-refugees/ … In relation to fighting statelessness, Ethiopia pledged to achieve universal registration of refugees and issuance of birth certificates to all refugee children in Ethiopia by 2024.", "Held a meeting with Morocco Amb to Ethiopia Mrs. Nezha Alaoui and Moroccan Association of Pharmaceutical Industry executive director Mrs.Layla Laassel to partner in local production of Pharmaceuticals, training/experience sharing and overall cooperation in the health system.", "BREAKING: An explosion on an Iranian oil tanker has set the vessel on fire near Saudi port city of Jeddah. More soon: http://www.aljazeera.com ", "Wangari Maathai's green belt movement led to the planting of more than 50 million trees. She was awarded the 2004 #NobelPeacePrize.\n\nFor what cause will the Nobel Peace Prize be awarded this year? Find out today.", "Former Presidents Sharif Sheikh Ahmed and Hassan Sheikh Mohamud, along with MPs and other politicians have arrived in Kismayo for the inauguration of Jubaland leader Ahmed Madobe. #Somalia", "Pictorial. #UnityPark, #Ethiopia", "News Update: PM @AbiyAhmedAli 's signature Park inaugurates today https://addisstandard.com/news-pm-abiys-signature-park-inaugurates-today/ … University graduates from different parts of the country have been trained and will work as tour guides. (See some of our selected pictures in the news) #Ethiopia #UnityPark", "Egypt calls for urgent Arab League meeting over Turkey’s Syria operation", "#ReturneeReintegration Project launch. Happening now in #Jigijga. \n\n#JobCreation #Poverty. @ilo", "#Somaliland Ready To Welcome First #Uganda Airlines Flight To #Hargeisa https://www.horndiplomat.com/2019/10/10/somaliland-ready-to-welcome-first-uganda-airlines-flight-to-hargeisa/ … “This is great news not only for Somaliland but also to the entire East African region. We cannot wait for the first Uganda Airlines flight to touch down in Hargeisa.”  @Horndiplomat", "#WorldMentalHealthDay", "We are streaming images from the Syrian-Turkish border as Turkish military continues its offensive there:", "Good news on Ebola: World Health Organization says the epidemic in eastern DR Congo has been squeezed into a 'corner' - just 27 health districts are affected by the virus today, compared with 207 at the peak.", "#Ethiopia: #CBE inaugurates second full-fledged interest- free branch https://www.press.et/english/?p=13823 … According to CBE’s President & CEO Bacha Gina, the Bank appointed #Sharia Advisory Committee in a bid to ensure Sharia compliance thereby boosting customer’s confidence in the service.", "Held a productive meeting with big company investors from 30+ countries along with delegations from Ethiopian Investment Commission on health sector priorities for private investment. Thanks to @AHBSIV organizers, @AfricaHealthFed, especially Dr. Amit Thakker @docthakker.", "#Ethiopia: A maize milling factory built at a cost of 42 m br ($1.5m) in #Gelan town in #Oromia Regional State was inaugurated today in the presence of @ShimelisAbdisa. The mill was financed by Oromia Farmers' Federation & is expected to process up to 2000 quintal maize/day. OBN", "*Pics: PMO", "Pres. Uhuru Kenyatta of #Kenya arrived in #AddisAbeba. In addition to inaugurating #UnityPark, \"the leaders will agree on a date for next ordinary meeting [of #IGAD] likely to be hosted by Kenya, at which Kenya will take over Chairmanship of IGAD,\" as per @HarunMaruf. Pics: FBC", "It's #WorldMentalHealthDay.\nEvery #40seconds someone dies by #suicide.\nIf you are worried about someone, encourage them to seek help; let them know you care.\nIf you're struggling, talk to someone you trust; seek help. However hard things get, there is always hope. Never give up.", "#Ethiopia: @FDREHOPR said the 12th Flag Day will be celebrated on Monday October 14 nationwide under the theme: \"Our flag is the result of the sum of our diversity and the pillar of our unity.\" “ሰንደቅ አላማችን የብዝሀነታችን ድምር ውጤትና የአንድነታችን ምሰሶ ነው::”", "#BREAKING Erdogan threatens EU with refugee influx if it criticises Syria operation", "Keele University lecturer Awol Allo discusses the latest from the standoff between Sudan, Egypt and Ethiopia over multi-billion dollar river Nile dam project", "Update: #Uganda's President Yoweri Museveni is the latest head of state to have arrived at Bole Inter'l Airport. He was received by PM #AbiyAhmed on arrival. Pres. Museveni will join other #IGAD member states heads of government to inaugurate #UnityPark\nhttps://twitter.com/KagutaMuseveni/status/1182240912770027520 …", "Introducing #AddisAbaba Noir, coming to you August 2020 by @AkashicBooks. Featuring some of the most talented #Ethiopian writers from within the country & abroad, edited by me. Mark the date, watch this space for more updates. #Ethiopia #literature #fiction", "#Somalia: The leader of Puntland Said Abdullahi Deni has arrived in Kismayo ahead of they inauguration of Jubaland leader Ahmed Madobe. According to sources, the plane carrying Mr Deni didn’t make a stopover at Mogadishu’s AAIA Airport as instructed by the Federal Govt.", "#Ethiopia: Thread by @BJuweria: \"The #Somali Youth Fed gathered in today to protest against Ethiopian Airlines' discriminatory policies both in terms of hey have called for a 72 hr boycott of the airline @flyethiopian should listen\" #Jigjiga #Mogadishu", "#German Fed. Min. of #Agriculture @juliakloeckner meeting #Ethiopian Min. of Agriculture & Livestock, discussing aforestation, #climate change, development of agricultural sector in #Ethiopia. #Mechanization,  #irrigation, increase of productivity. Great chances in #digitization", "#Ethiopia: Minister of Transport @dagmawit_moges met and held a fruitful discussion with @icao Secretary General, Dr. Fang Liu, on strengthening cooperation on aviation sector, the ministry said. Dagmawit was attending the 40th Session of the ICAO Assembly in #Montréal, #Canada.", "Update: Leaders of #IGAD member state continued arriving in #AddisAbeba. Following Sudan's PM Hamdok, #Somalia's PM Mohamed Abdullahi Mohamed & #SouthSudan's President Salva Kirr arrived at Bole Inter'l Airport.Both leaders were welcomed by their host PM #Abiy.OBN. #UnityPark.", "Leveraging National Statistics Agencies and Country-Owned Surveys for Financial Inclusion Measurement: The Case of Ethiopia https://www.worldbank.org/en/news/feature/2019/10/03/leveraging-national-statistics-agencies-and-country-owned-surveys-for-financial-inclusion-measurement-ethiopia?cid=SHR_SitesShareTT_EN_EXT … via @WorldBank", "World Bank cuts Sub-Saharan #Africa/'s 2019,2020 growth forecast https://af.reuters.com/article/africaTech/idAFKBN1WO1HH-OZATP … “Despite some improvements, the external environment is expected to remain difficult and uncertain for the region,” the bank said in its October Africa’s Pulse report. @WorldBank", "Meeting the State Minister for Women & Child Affairs in #Ethiopia, I reiterated @UNICEFEthiopia commitment to accompany in addressing child rights and #EndChildMarriage in #Ethiopia. #Childnotbride", "BREAKING: Somalia's Puntland Regional President Said Deni and his delegation has arrived this morning in Kismayo for engaging the inauguration of Ahmed Madobe, Mr. Deni has yesterday rebuffed a demand from the federal government not to attend the inauguration of Kismayo.", "#Kenya's 'talking boxes' help girls break their silence on abuse https://www.bbc.com/news/world-africa-49179475 … \"When I started working with the girls, I noticed that girls with serious issues never used to talk,\" Polycom Development founder Jane Anyango", "#Ethiopia: #Sudan's PM Abdalla Hamdok arrived in Ethiopia for his first visit in connection with the inauguration of \"Unity Park\" at the premises of PM Abiy's office. Leaders of #IGAD member states including Uhuru Kenyatta of #Kenya are expected to arrive for the event. Pics: EPA", "#Ethiopia: FEATURE-Faced with climate change and growth, Ethiopia's capital shores up its water supply https://news.yahoo.com/feature-faced-climate-change-growth-053025084.html?soc_src=hl-viewer&soc_trk=tw …  Environmental experts warn that climate change will only make matters worse in the future.", "#Egypt/ian parliament forms ‘special committee’ on Renaissance Dam crisis https://www.middleeastmonitor.com/20191010-egyptian-parliament-forms-special-committee-on-renaissance-dam-crisis/#.XZ7VJoZ4WoA.twitter … ...includes the foreign relations, African affairs, defence and national security committees, & is expected to write a report and send it to the Bureau of Cabinet ... #Ethiopia #GERD", "Facebook expands fact-checking to 15 #Africa/n nations https://africatimes.com/2019/10/10/facebook-expands-fact-checking-to-15-african-nations/ … The social media giant announced ... fact-checking programs will be available in #Ethiopia, #Zambia, #Somalia, #BurkinaFaso, #Uganda, #Tanzania, #DRC, #Coted'Ivoire, #Guinea and #Ghana", "IGAD leaders to converge in Addis\nfor the inauguration of ‘Unity Park’", "Good Morning Ethiopia. Today marks the inauguration of ‘Unity Park’ which is a manifestation of the MEDEMER idea, inviting us to takes stock of our positive capital from the past (our historical and cultural assets) and build upon it for future generations. 1/2", "#Ethiopia - #UK: Head of #NISS meets with #MI6 chief  https://fanabc.com/english/2019/10/head-of-national-intelligence-and-security-service-meets-with-mi6-chief/ … \"NISS said the two agreed to team up efforts and exchange information to contain threat of terrorism by deterring the activities of al-Shabaab and ISIS terrorist groups operating in the #HornofAfrica.\"", "BREAKING: Turkey has summoned the US ambassador in Ankara for an update on military campaign in northern Syria", "Foreign Minister Gedu Andargachew held talks wz the  South Sudanese Foreign Minister Awut Deng Acuil on the progress of  S. Sudanese peace process.They both commended the prevailing peace & underscored on the need for speedy implementation of agreed points.  \n #IGAD #SouthSudan", "News: @NEBEthiopia hosting international conference on elections, election stakeholders https://addisstandard.com/news-nebe-hosting-international-conference-on-elections-election-stakeholders/ … President Sahle-Work remarked that national elections were the only way to proceed to democracy & all stakeholders should make sure that they are held successfully.", "#Ethiopia may give up majority control over its telecom monopoly in a second phase of privatization https://www.bloomberg.com/news/articles/2019-10-09/ethiopia-could-sell-majority-stake-in-state-telecom-monopoly … Ethiopia may give up majority control over its telecommunications monopoly in a second phase of privatization once it’s sold 49% of the company next year.", "#Ethiopia: Ethiopian athletics team return home from #Doha https://fanabc.com/english/2019/10/ethiopian-athletes-return-home-from-doha/ … The athletes were warmly received this morning at the Addis Ababa Bole International Airport by high level government officials, including Dr Hirut Kassaw, Minister of Culture and Tourism.", "#Mozambique says army killed 9 jihadists in the north, in the first official confirmation of a military operation against militants. A local official says a Russian national with government forces was also killed, though Moscow denies any military presence in the country.", "With support from the @QRCS, the @EthioRedCross has supported 650 vulnerable drought affected and food insecure households to breed 2000 goats and 250 heifers worth USD 306,075.95, covering four kebeles of Doba and Tulo woredas of West Hararghe zone, Oromia region.", "#Ethiopian PM emerging as early #NobelPeacePrize favorite https://africa.cgtn.com/2019/10/09/ethiopian-pm-emerging-as-early-nobel-peace-prize-favorite/ … \n\"Asle Sveen, a historian who has written several books about the Nobel Peace Prize, told Reuters the deal made Abiy exactly the kind of candidate Alfred Nobel had envisaged for the prize.\"", "We're working to ensure women have #ASeatAtTheTable of economic policy-making.\n\n“The international trade regime is not benefitting the majority of women and girls. We need a new deal, a green & a purple new deal, for shared prosperity,” UNCTAD's @guldeniz15 tells #WTOPublicForum.", "Pleased to receive Ato Halle, Director of Ethiopian Foreign Relations Strategic Studies Institute at ISS Addis. We explored possible areas of strategic partnerships & technical assistance @issafrica @halelule @mfaethiopia @MoP_Ethiopia", "USAID Mission Director Sean Jones visited Tigist, a poultry farmer in Mojo, Oromia, to see how she has learned to raise healthier chickens w/ help of @FeedtheFuture Value Chain Activity, and increasing production and reaping higher profits as a result. #USInvestsInEthiopians", "Parenting in #Ethiopia: lessons on raising children under tough conditions http://theconversation.com/parenting-in-ethiopia-lessons-on-raising-children-under-tough-conditions-124642?utm_source=twitter&utm_medium=twitterbutton … \"It’s hard to know whether those in Ethiopia in 1984 were permanently affected by the famine because there are biological processes at work which prevent them catching up...\"", "#Ethiopia News: Heavy rains cause flooding in #Somali, #Gambella regions  https://addisstandard.com/news-heavy-rains-cause-flooding-in-somali-gambella-regions/ … 353 households displaced On 2 Oct. In #Gambella; and 2,285 households affected and 853 households displaced following floods in Somali region.", "UN says it's facing its worst cash crisis in about a decade and may default on salaries by November", "The collective wisdom of the people of #sudan the efforts of #Ethiopia andAU brought peace.What we witnessed is that preventive diplomacy nurture cooperation& give us a moment of serenity to reflect that conflict destroys while peace build life.Indeed blessed are the peace makers", "#Sudan has received half of $3bln aid promised by #Saudi and #UAE https://af.reuters.com/article/topNews/idAFKBN1WN13I-OZATP … Ibrahim Elbadawi said KSA & UAE had deposited $500 m in the Sudanese central bank, while $1 billion worth of petroleum products, wheat & agricultural production inputs had been received.", "#Ethiopia: #AddisAbeba Transport bureau said Shegole Bus Depot, a depot built on 52 Sqm & accommodates from 250-300 buses at a time, & incorporates modern car maintenance, including body paint, will be inaugurated on Oct. 13. It was an old depot renovated at a cost of 555m birr.", "#Japan Committed to Support #Ethiopia’s Reform: Ambassador https://www.ena.et/en/?p=10041  “Japan supports PM Abiy Ahmed’s political & economic reforms...We definitely support his initiatives to reconcile and improve relations with Ethiopia’s neighboring countries, including #Eritrea.”", "Beautiful #Ethiopia! Awi Horsemen @addisstandard @WorldBankAfrica @UNDPEthiopia @CarrieTurk @Nklingen", "#Egypt PM says will not allow protests to spread 'chaos'", "News: An #Oromo fashion & literary night held in #AddisAbeba https://addisstandard.com/news-an-oromo-fashion-and-literary-night-is-held-in-addis-ababa/ … The night also saw Afaan Oromoo poetry from more than 5 poets. Accompanied by jazzy music, the poets presented their works that dealt with the culture, history & struggle of the Oromo people.", "A thread: The recent outrage in a town named Adi-Daero are questions about maladministration and most importantly about justice for survivors of Gender Based Violence who have been abused by a security official who has been freed 1/n", "Honored 2 have met HE @SahleWorkZewde, Pres of #Ethiopia 2 discuss increased support 4 #children in the context of ongoing reforms. @UNICEF looks forward 2 her support 2 move forward the flagship agenda on #childmarriage, #EducationForAll, #EndOpenDefecation & #Stunting", "Notice from the editors: We have deleted a tweet scoop outsourced from the state broadcaster, EBC, about the indefinite postponement of discussion to be held b/n @NEBEthiopia & political parties over the recently ratified electoral law. NEBE said the news was a \"misinformation.\"", "President @SahleWorkZewde mentioned priority areas of the health sector on the opening speech of the EFY 2012 at the parliament. \nreform Health Extension and Health Development Army programs based on the in-depth study results\nImplement Essential Health Service Package 1/2", "#Ethiopia/n Airlines jet makes emergency landing in #Dakar http://bit.ly/35mvd7l   The airline said all those onboard were safe. @flyethiopian", "CBE expresses readiness to provide financial assistance to S Sudan’s dev’t projects https://fanabc.com/english/2019/10/cbe-expresses-readiness-to-provide-financial-assistance-to-s-sudans-devt-projects/ … Ambassador Teferi, said the Embassy in collaboration with #Ethiopia/n community, will take active part in the development activities and reconstruction of #SouthSudan.", "Medals: \nMuktar Idris & Solomon Berega: 5000m, men, Gold & Silver;\nLelisa Disasa & Mosinet Geremew: Marathon, men, Gold & Silver. \nLetesenbet Gidey, 10000m, women, Silver; Yomif Kejelcha,10000m men, Silver; Lemecha Girma, 3000m SC, men, Silver; & Guday Tsegay, 1500m women, Bronze", "#Ethiopian emb. in #Doha,#Qatar, sent off the Ethiopian Athletic team who participated in the #WorldAthleticsChamps & brought home 8 medals:2 Gold, 5 Silver & 1 Bronze. is 5th from the world & 2nd from #Africa. Ethiopia's Amb in Qatar, Samia Zecharia Congratulated the athletes", "Direct flight to #Kismayu sparks another #Somalia-#Kenya row  https://www.theeastafrican.co.ke/news/ea/A-flight-sparks-another-somalia-kenya-row/4552908-5303320-g3cm2gz/index.html …\n#Mogadishu has filed an airspace violation complaint to the UN aviation agency, ICAO.", "We were honored to join to @SahleWorkZewde and @NEBEthiopia Chairperson Madam Birtukan Mideksa at today’s NEBE stakeholder conference to outline the roadmap for 2020 general elections. https://bit.ly/2Ow2RS8 ", "The United States is ready to play our part alongside our partners in Ethiopia and the international community in supporting @NEBEthiopia during this most important & foundational of democratic endeavors in elections. https://bit.ly/2Ow2RS8  #USInvestsInEthiopians", "We, the Ministry of Health of Ethiopia, launched our rebranding today. In doing so, we are pledging our continued commitment to serve our community with compassion and collaboration. We are embarking on a path where we strive for excellence in health service with competence.", "Our Regional Director @MohamedFall today visited families who are benefitting through the Urban Productive Safety Net programme in #AddisAbaba. \n\n#Ethiopia\n#ForEveryChild", "#Ethiopia to launch remote satellite https://www.iol.co.za/news/africa/ethiopia-to-launch-remote-satellite-34352363 … The first Ethiopian satellite will be launched in December 2019 from a center in China, said Zewde.", "Ugandan becomes first black woman to visit all countries in the world", "#Nigeria lecturer suspended after @BBCAfrica Eye 'sex-for-grades' film https://www.bbc.com/news/world-africa-49971067 … The Foursquare church, where Dr Igbeneghu is a pastor, have also distanced themselves from him in a statement.", "Ps: Major Aschalew Dese.", "THEY DID IT\n\nJoin us in congratulating Alex, Emebet & the #WildWheelchairsProject team for successfully reaching the Ras Dashen summit.\n\nAlex & Emebet ascended #Ethiopia's highest mountain using a special handcycle designed by @unisouthampton students.\n\n#TuesdayMotivation", "#Ethiopia: #Amhara region special forces killed Sergeant Aschalew Dese, leader of \"Fano\" (a group initially known for leading the 2015-16 protest), in Ebnat Wereda, Dega Melza area in S #Gonder today. Sergeant Aschalew was one of the prisoners released during the govt's amnesty", "Refugees queue up for food distribution in Gambella after humanitarian activities resumed in the camp following a two-week movement restriction triggered by the killing of 2 humanitarians in September,  during the suspension period life-saving assistance to #Refugees was ensured.", "Successfully completed the 7th Ethio-Russian Joint Commission Meeting in St. Petersburg, Russia, between 1-3 Oct. 2019. \nEleven different Joint Protocols, Framework Agreements and MoUs have been endorsed. I Thank all whose efforts have made a success.", " BREAKING - Watch live: Emmanuel Macron pays tribute to officers killed in Paris police HQ knife attack https://f24.my/5cGd.t ", "#Ethiopia: Addis set to host Africa fashion week https://newbusinessethiopia.com/manufacturing/addis-set-to-host-africa-fashion-week/ … …   Waridi Schrobsdorff Founder/CEO of FA254 will be hosting a workshop  and presenting upcoming designers. The designers include from #Ethiopia, #Ghana, #Kenya, #Nigeria, #Rwanda, #Senegal and #SouthAfrica", "Update: On August 05 the court has overruled police's request for 14 more days to remand & investigate the suspects, and told the police to file the charges on or before Aug. 19. The court told the police today, again, to file the charges until Oct. 23. ", "Update: Residents of the city have protested against the court proceeds. Today's hearing took place in a closed court. The Police are using teargas to disperse protestors. Follow live thread here #Ethiopia", "Floods: Over 1,000 people displaced in #Moyale https://mobile.nation.co.ke/counties/Floods-displace-over-1000-people-in-Miyale/1950480-5302440-gpakmc/index.html … Marsabit Governor Mohamud Ali said county disaster management team and humanitarian organisations could not reach the affected families since most of the roads are impassable.", "Ethiopia:A court in Bahir Dar overruled, for the 2nd time, police's request for more time to investigate suspects detained accused of connections with the assassination of #Amhara region senior officials. Suspects included Bir. Gen. Tefera Mamo, former regional Special force head", "Parenting in #Ethiopia: lessons on raising children under tough conditions http://theconversation.com/parenting-in-ethiopia-lessons-on-raising-children-under-tough-conditions-124642?utm_source=twitter&utm_medium=twitterbutton … \"It’s hard to know whether those in Ethiopia in 1984 were permanently affected by the famine because there are biological processes at work which prevent them catching up...\"", "#Ethiopia: Airline went into records after Max crash, engineer says https://apnews.com/5ff095b8b9954b03925410680e8c907d … A lengthy report on a serious accusation by a former employee of @flyethiopian against the airline that includes allegations of human rights violation, which the Airline vehemently denies.", "The 4th Africa Health Business Symposium is held in Addis Ababa with a theme: ”Integrating Africa: Bridging the Health Gap”-- an essential step towards strengthening partnership with the private sector in Ethiopia and Africa. (1/2)\n@AHBSIV @AbebeAbebayehu @docthakker @AfricaCDC", "A total of 263 undocumented #Ethiopia-n nationals returned home from #Beirut, #Lebanon between 3 and 6 October, 2019.", "The founder of @Twitter, Jack Dorsey @jack visiting #Ethiopia #Nigeria, #Ghana, SA in Nov. Dorsey announced this when he recently met 3 very talented Ethiopians, @betelhem_dessie @noelkudu & @GETNETASEFFA (see below). The visit is a great opportunity to showcase #Africa’s talent.", "#Ethiopia:The number of internally displaced people went down to less than 100,000 from a staggering more than 2 million, said President Sahle-Work Zewde on Monday.  Ethiopia reduces internally displaced significantly", "Meet the Silvery-cheeked Hornbill! Like other hornbills, it’s equipped with a signature casque above its bill which amplifies its calls. It’s native to parts of eastern Africa including Ethiopia & Tanzania, where it inhabits a range of forest & savanna habitats. [: B. Dupont]", "Welcomed the USA Ambassador in #Ethiopia Mr Mike Raynor & political officer Mr Andrew @USEmbassyAddis  - I thanked him for the support we are @MekUniETH receiving from the Embassy, discussed the Ethio-Eritrea peace agreement & developments", "Recall: #Ataye is a city in North Shewa zone but it is not part of the  Oromo community special zone, as was mentioned in the scoop above. We regret the error!", "ፕሬዝዳንት ሳህለወርቅ ዘውዴ በተወካዮች እና የፌዴሬሽን ምክር ቤቶች የጋራ ስብሰባ መክፈቻ ላይ ባሰሙት ንግግር አጽንኦት ከሰጧቸው ጉዳዮች ውስጥ በዚህ ዓመት የሚካሄደው #ምርጫ አንዱ ነበር። ፕሬዝዳንቷ ስለ ምርጫው ያሉትን () ይመልከቱ። #Ethiopia", "#AddisAbeba:'New flower' in an old vase https://lsecities.net/archives/addis-ababa-new-flower-in-an-old-vase/ …\n#Ethiopia’s architects & urban planners have long acknowledged that the city’s growth is no longer controlled.\n\n\"When the growth is so fast,you’re not in control of the urban fabric & the way you build,\" Rahel Shawl", "Update: A memorial service commemorating the life of lyricist & composer Elias Melka, 42, was held today at the National Theater in #AddisAbeba. It was attended by families, freinds & senior gov officials including Dr. Hirut Kassaw, minister of culture & tourism & @TakeleUma", "#Ethiopia:5 civilians &3 security forces were killed in #Ataye city & its environs in North Shewa zone, #Oromo community zone in #Amhara region. It happened after an armed man was killed by security forces when he opened fire on them, as per this report \nhttps://www.facebook.com/dw.amharic/photos/a.507141705985597/2815738518459226/?type=3&theater …", "The World’s Next Factory Won’t Be in South Asia\nhttps://www.bloomberg.com/opinion/articles/2019-10-06/why-factories-leaving-china-aren-t-going-to-india … The region is losing out to #Africa and elsewhere in the race to attract manufacturing investment. #Ethiopia", "Update: President Sahle Work revealed that #Ethiopia's first earth observatory satellite will be launched from a #Chinese launching station in December this year.  Earlier it was reported that #China was financing $6 million of the $8 million worth observatory satellite.", "Happening: President Sahle Work Zewde delivering her maiden policy speech at the annual joint session opening of the House of People's Representatives & the House of Federation. #Ethiopia https://www.facebook.com/fanabroadcasting/videos/2117996978305550/?__tn__=kCH-R&eid=ARDmvl0zrU4n-wmboUi5C55YrX5kXr2kZIf_Bt2jtkyDh4cgGd7q8CiHffz_rg91og-gmjt1G4olAPDX&hc_ref=ARSt56NTEaJLsn3lIECfKOIXDoufgWx3DFT09feL_A6NL4Ph8PRHfnPoSv5oKChGHv8&__xts__[0]=68.ARA4n7myoOc3Vg0HdJ4Q1GUl7DCAL6L5k0S00XxaWgNY6BkwWLWHD2FCRGoLJF-mNflkKFcYfR75H5aHBRHk_8Vb-8cRb8ggLoOjWs4UzLFmcfEV5nhqrSV6YJJrwoVhfKeGphUcwwzE0AH7tJsWVhBqnJ7uKJrK1HrFzDxL_EUT7TKbfNknVuzQWiPnaXrLHjl8rIIudOvQ_pdw5MjrSh99dmm7QXdMefME6efXYtLzkG8oI2Js0tok2-f5RVaeid2iXeicBq83RI_hPer1v5_a1HJmUxs3A2IOF6fnSzO-axc40ifXXZGPNB4cfzZd98fIhBENAuFm_F1XOzrkxeL5WyQxFvx_B7zebg …", "#Ethiopia promoting #exports of #Coffee #Sesame #Honey #Pulses #Oilseeds at #Germany #Anuga2019. come Visit us at Hall 11:3 Stand No. B050g-B051g. #TasteOfOrigins #TasteTheFuture @addisstandard", "#Somaliland Counter Piracy Coordination Office Launched Maritime Development Meeting https://www.horndiplomat.com/2019/10/06/somaliland-counter-piracy-coordination-office-launched-maritime-development-meeting/ …\n\"The Maritime water with the facility of #BerberaPort is the most important trade route that connects Somaliland with the rest of the world.\" via @Horndiplomat", "Analysis: University-industry linkages in #Ethiopia: The way forward   https://addisstandard.com/analysis-university-industry-linkages-in-ethiopia-the-way-forward/ … \"Without mastering their 1st & 2nd missions, universities in Ethiopia are trying to follow their counterparts around the world, albeit in a rather haphazard way.\" Must read by @AbbaKayo", "“The implementation of the lowland wheat project will contribute to   achieving Ethiopia’s import substitution efforts in the long term,& will also have an immediate positive impact on improving the livelihoods of the farmers & pastoralists residing in the implementation areas.\"", "News: Lowland wheat initiative kicks off in #Ethiopia https://addisstandard.com/news-lowland-wheat-initiative-kicks-off-in-ethiopia/ … the initiative will be demonstrated on 1,500 hectares along the #Awash basin, 3,200 hectares along the #Wabeshebelle basin, and on 660 hectares along the #Omo basin.", "#Ethiopia seizes large illegal weapons in sting operation  http://www.xinhuanet.com/english/2019-10/06/c_138452005.htm … \"The large illegal weapons cache was seized during a joint operation carried out by the Ethiopia National Intelligence & Security Service and police in Ethiopia's northern #Amhara regional state.\"", "Good morning, #Ethiopia.  New Labour Proclamation No. 1156/2019 is published on the Federal Negarit Gazette effective from September 5th, 2019.", "The most unusual ways many African countries got their names https://qz.com/africa/1722919/  \n\"Even a country without colonial heritage find its names have roots in Europe, such is the case with #Ethiopia, which was never colonized but whose name also has Greek roots\" \nInteresting read.", "#Ethiopia: The annual joint session of House of People's Representatives & House of Federation will open today with maiden speech to be delivered by Pres. @SahleWorkZewde. President Sahle-Work is expected to present the govt’s plan for the 2019/20 Fiscal Year (2012 Ethiopian FY).", "#Ethiopia denounces #Egypt's latest move on dam as disruptive  https://addisstandard.com/news-ethiopia-denounces-egypts-latest-move-on-dam-as-disruptive-pledges-to-continue-with-constructive-talks/ … Egypt's demand for 3rd party came in the backdrop of an unusual statement released by the US State Dep't on Oct. 03, a move many saw as tilting the balance of negotiations in favor of Egypt.", "#Ethiopia: @flyethiopian  would consider buying a stake in South African Airways https://www.bloomberg.com/news/articles/2019-10-06/ethiopian-will-weigh-stake-in-south-africa-s-debt-ridden-airline … \"Ethiopian Airlines Group would consider buying a stake in South African Airways - should South Africa decide to sell equity in the struggling state carrier.\" via @business", "Congratulations to all Africa athletes who once again performed so well. My calculation is that if the African and European athletes were classified as #AU or #EU their team would have ranked respectively 2nd and 3rd best overall!", "ለኛ መኪና የመጨረሻ ሰዎችን አድርስናል!\nሁላችንም በሰላም ገብተናል! 58 አዋቂዎች እና 6 ህፃናት በሰላም ገብተናል! ከኛ ኃላ ለነበሩት በሰላም እንዲገቡ እንፀልያለን!\nበፀሎት፣ ሀሳብ፣ እና እርዳታ ለረዳችሁን ሁሉ እግዚሐብሄር ይስጥልን! ", "#Ethiopia: Yomif Kejelcha (picture from file) won silver in Men's 10000m in the last day of #WorldAthleticsChamps in #Doha, #Qatar. On the track representing Ethiopia were Yomif, Hagos G/Hiwot and Andamlak Belhu. \n\nJoshua Cheptegei of Uganda won the Gold medal. Congratulations!", "BREAKING: #Jubaland buys its own airplane. It made its first trip from #Nairobi to #Kismayo today without stopping-over at #Mogadishu airport as demanded by the Federal Govt. It was carrying politicians to participate Ahmed Madobe’s Presidential inauguration. #Somalia", "We are stranded in a place called Sheno (~80km from #AddisAbeba) for a reason that is not disclosed. No police force is visible. Lots of buses and automobiles are awaiting the opening of the road. #Ethiopia", "እጅግ በተሠበረ ልብ  ... \nየወንድማችን  ኤልያስ መልካ የስንብት ፕሮግራም መስከረም 26 ቀን 2012 ከቀኑ 5 :30 ላይ  በብሔራዊ ቴአትር ይካሄዳል። የቀብር ሥነ ስርአቱም ከቀኑ በ9 ሰአት በጴጥሮስ ወጳውሎስ ቤተክርስቲያን ይከናወናል።", "The Government of the Federal Democratic Republic of Ethiopia commends the Water Affairs Ministers of Ethiopia, Sudan, and Egypt for convening in Khartoum to continue with the trilateral dialogue on the filling and operation of Great Ethiopian Renaissance Dam. 1/4", "Thanks to Musteqbel Charity Institute for organizing a blood donation campaign today. \n\nLet us all take part in the National Blood Donation campaign on October 26, 2019- to collect 10,000 units of blood in a day, register 100,000 donors same day & 300,000 in a month. #SaveLives", "How close was that?\nJust one one-hundredth of a second separated Kenya's Conselsius Kipruto from Ethiopia's Lamecha Girma in the 3,000m steeplechase final at the World Athletics Championships in Doha. Kipruto won after a dramatic sprint finish.\nhttps://bbc.in/2Ota1H3 ", "#Ethiopia denounces #Egypt's latest move on dam as disruptive, pledges to continue with constructive talks https://addisstandard.com/news-ethiopia-denounces-egypts-latest-move-on-dam-as-disruptive-pledges-to-continue-with-constructive-talks/ … AP quoted Egyptian presidency spokesman Bassam Radi as saying that “Egypt was looking forward to an “instrumental role” by the U.S. in the talks.”", "Myself @CrisisGroup and clutch of international rights orgs routinely being sent info on trials of #Sidama activists \n\nYet don't see much reporting in English of gov's alleged violations of due process from unshackled #Ethiopia media and civil society\n\nWhy?", "#Ethiopia: @flyethiopian is close to agreeing a deal with Airbus for as many as 20 narrow-body A220 planes worth more than $1.6 b https://www.bloomberg.com/news/articles/2019-10-04/ethiopian-airlines-close-to-deal-to-order-airbus-a220-planes … #Africa’s biggest & most consistently profitable carrier is in late-stage talks about the purchase of the 100-seater aircraft", "#Ethiopia:As the #WorldAthleticChamps\nwraps up in #Doha, Lelisa Desisa & \nMosinet Geremew brought home Gold & Silver in men's Marathon. The race took place after mid night due to the grilling heat in #Doha, which tested the resolve of our finest athletes.Congratulations!", "#Ethiopia: Gudaf Tsegay (file pictures) won bronze medal in  women’s 1500m at the #WorldAthleticsChamps  \n\nSifan Hassan, Ethiopian born athlete running for the #Netherlands won gold in this category, becoming the first athlete to win 1500 & 10,000 double in #WorldAthleticsChamps", "#Ethiopia: Elias Melka, the renowned lyricist & composer has passed away, FBC reports. He has been receiving treatment for diabetes and kidney complications!\n\nIn Elias Melka's death Ethiopia's contemporary music industry lost a talented and influential figure! RIP!", "More pictures from #Irreecha2019 at #HoraFinfinne and Mesqel Square in #AddisAbeba.\n #Ethiopia #Oromo. \n\nPictures: OBN, Social media.", "#Irreecha being celebrated at #HoraFinfinne in the capital #AddisAbeba for the 1st time in modern Ethiopian history.Hundreds of thousands who came from various parts of the country are gathered at #Mesqel Square starting from early hours. #Irreecha2019. #Oromo #Ethiopia Pics: FBC", "Great night for Ethiopian steeplechase runners as Getnet Wale also finished fourth with a personal best time. Congratulations to both.", "#Ethiopia: Lemecha Girma won silver in Men's 3000m SC at the  #WorldAthleticsChamps\nIn #Qatar. He is not only the first Ethiopian to win a medal in this category in world Athletics championships but also broke the Ethiopian Record in 3000m SC. Congratulations! (Pic 1& 2: file)", "Repeating this video on popular demand! \n\nTeam Addis Standard wishes the #Oromo people and everyone celebrating #Irreecha a happy #Irreehca2019. #Ethiopia.\n\nOur team will be streaming pictures live from the event in #AddisAbeba tommorow!", "Read the full interview here: #Irreecha - The colors, the identity and the pride of Oromo nation", "\"#Irreecha is different from other festivities... in that it provides the #Oromo with mechanisms to understand their worldview...it provides the Oromo in a unique & particular way a system of morality that establishes right from wrong, good from bad or behavior.\" Alemayehu Diro", "#Irreecha - The colors, the identity and the pride of #Oromo nation  https://addisstandard.com/irreecha-the-colors-the-identity-and-the-pride-of-oromo-nation/ … \"The #Oromo have complete sense of ownership, full control and leadership over Irreecha as an institu­tion...Irree­cha is celebrated in the manner that the Oromo would like it to be.\"", "#Ethiopia: The eve program before tomorrow's #Irreecha festivities, thanks giving holiday of the #Oromo people, kick started at #Mesqel square late this afternoon in the presence of senior gov. officials, guests who came from various parts of Ethiopia & thousands of participants.", "Is #Ethiopia back to the dark ages of arbitrary detention of journalists?", "በቀዳማዊት እመቤት ጽ/ቤት የተገነባው ብርሃን የሕፃናት ማሳደጊያ ማዕከል ግንባታው ተጠናቅቆ ዛሬ መስከረም 22 ቀን 2012 ተመረቀ::", "President Buhari is visiting South Africa at a time when the relationship between the two economies is strained. #Xenophobia, particularly, is a distraction from the leadership role that Nigeria and South Africa should play on the continent", "Today UNHCR enters a partnership with regional authorities in Somali Region to support development planning process which includes both refugees and host communities, in line with #CompactRefugees and supported by the EU Trust Fund for Africa ", "In a country not known for its circus talent, Ethiopian troupes are shining in the global spotlight https://cnn.it/332mNQy ", "Exciting news for Glimmer and Ethiopia! The Helmsley Charitable Trust has reinvested in Glimmer with an $8 million grant. The new project will reach 19,000 families to support income growth, food security and better opportunities for women and girls in Oda Bultum, Oromia.", "#Ethiopia: PM meets with #SouthAfrica/n Special Envoys", "But an official from the Ethiopian embassy says the issue of Eritrean asylum seekers did not come up during the Sep.1 meeting between Netanyahu & Abiy.\n\n“Nothing was raised regarding this issue during the meeting. The discussion was about strengthening the bilateral relations.”", "#Netanyahu says he discussed deportation of #Eritreans with Ethiopian PM  https://www.timesofisrael.com/netanyahu-says-he-discussed-deportation-of-eritreans-with-ethiopian-pm/ …\n\"I have the possibility to help you with very innovative projects how to return the people to Eritrea, & to bring them back under wonderful conditions,” Netanyahu qoted PM Abiy.", "Looted #Ethiopian Crown Resurfaces in the #Netherlands https://www.nytimes.com/2019/10/03/arts/design/ethiopian-crown.html#click=https://t.co/rbsHbCVef5 …\nPicture: A priest wearing the crown in Cheleqot, #Ethiopia, in 1993, before it was stolen.\n\nCredit Michael Gervers", "#Kenya money: Did new banknotes help tackle corruption? \nCentral Bank of Kenya governor Patrick Njoroge says the process of withdrawing the bank notes went very well and managed to make worthless cash held by people who did not want it subject to checks.", "Heavy rains fallen on the mountains between #Harar & Babile. Subsequently the floods damaged the bridge in Erer Valley, disrupting the transportation & movement between Hararr and #Jigijga.", "#Ethiopia: According to the minister the government has already selected a five-member committee to manage the bid evaluation process to select the advisor.\nhttp://www.itwebafrica.com/telecommunications/926-ethiopia/246512-ethiopia-initiates-process-to-privatise-ethio-telecom …", "'Aren't We Human Beings?': One Year After the #Lampedusa Refugee Tragedy https://spon.de/aekYJ  \n\"Hardly anyone wants to stay in #Italy, even though the country approved 64 percent of asylum applications last year, more than twice the European Union average.\"\nvia @SPIEGELONLINE", "South Korea's & Qatari Transport Ministers confirmed to me that their countries need to work with #Ethiopia in transport related capacity bulding schemes.", "#Ethiopia:Ambassadors & other diplomatic envoys representing several countries & based in Ethiopia,including #China & #Turkey, arrived in #Mekelle, capital of #Tigray region, for visits to development projects & talks with senior regional officials including V. Pres.Dr.Debretsion", "#Ethiopia: Headline Inflation Keeps Soaring, Hits 18.6pc Rate\nHeadline inflation, an indicator of the cost of living, continues to soar, reaching 18.6pc in September, according to the latest consumer price index from the Central Statistical Agency (CSA). https://addisfortune.news/news-alert/headline-inflation-keeps-soaring-hits-18-6pc-rate/ …", "#Ethiopia:The change in #Somali Region offers an example for the country\nhttps://amp.economist.com/middle-east-and-africa/2019/10/05/ethiopias-most-repressive-state-is-reforming?__twitter_impression=true …\nStability, [Mustefe] says, was the priority when he took office: “We had to  balance the need for justice with the pragmatic reality that we need a  special force here to keep peace.”", "Ambassador Raynor & Afar Regional State President Awol Arba launched new state-of-the-art reverse osmosis water system to provide the first-ever sustainable source of safe drinking water for more than 2,000 people living in the Serdo community of Afar. #USInvestsInEthiopians", "#Ethiopia news: Fresh violence in central #Gonder,#Amhara region, raises questions about further escalation in the area  https://addisstandard.com/fresh-violence-in-central-gonder-raises-questions-about-further-escalation-in-the-area/ … in the absence of independently verifiable account & multiple polarizing accusations from all sides,here is what AS' @EphreamS reported", "Reports suggest attacker, shot dead by police in Paris, is member of staff\nhttp://bbc.in/2nc4edu ", "Five #Eritrean football players disappear in #Uganda - official  https://af.reuters.com/article/idAFKBN1WI1C5-OZATP …\nThe missing players could be planning to seek asylum, which some Eritrean sports players have done in the past while traveling abroad.", "Filwuha Enterprise, Hilton and Ghion hotels will be privatized this fiscal year, Public Enterprise Agency announced today. Preparations are finalized to privatize additional four state-owned enterprises during the same period as well. \n\n#Ethiopia", "#Ethiopia: #AddisAbeba police changed their blue police uniform which has been in use for many years, according to the office of the city's deputy mayor @TakeleUma", "Last night, Ambassador Fesseha and the Public Diplomacy Dept. attended the launch of 'Water Life', an exhibition by #Ethiopia|n photographer @aidamuluneh.\n\nCommissioned by @WaterAidUK, the exhibition @SomersetHouse brings to light issues of water scarcity and its impact on women.", "Analysis: Helping #Ethiopian farmers adapt to drought and flooding  https://addisstandard.com/analysis-helping-ethiopian-farmers-adapt-to-drought-and-flooding/ …\n\"Each household is entitled to half a hectare for agricultural purposes, but demand has outstripped supply to the extent that even steep slopes are now being ploughed.\" #Ethiopia #drought", "#UN Security Council members to visit #Ethiopia https://fanabc.com/english/2019/10/un-security-council-members-to-visit-ethiopia/ …\nThey will be in the Ethiopian capital and home to the headquarters of the African Union (AU) on Oct. 23-24 for annual consultations between the panel and the AU’s Peace and Security Council", "\"'I like the look on their faces, when I tell then that we had Islam in Ethiopia before the hijra to Medinah.' Oh I like this...\"\n\nSpecial episode | Black Muslims respond to Social Media comments: https://youtu.be/DUb2OGBH9WI \n#BlackAndMuslimInBritain #BlackHistoryMonth", "In Sub-Saharan Africa, the 10 countries with comparable data that have reduced extreme poverty the fastest since 2000 are:\n Tanzania\n Chad\n Republic of Congo\n Burkina Faso\n DRC\n Ethiopia\n Mozambique\n Namibia\n Rwanda\n Uganda\n\nhttp://wrld.bg/e36u50wsvZd  #EndPoverty", "We are pleased to meet Mr. Mahamoud Ali Youssouf, Minister of Foreign Affairs of #Djibouti and discussed on bilateral issues. State Ministers Dr. Geremew, Ato Nebil and Ato Asfaw( Director) from Ministry of Education of are in a working visit to Djibouti.", "#AddisAbeba City admin handed over 100 public buses to the city’s transport bureau yesterday. All the buses are to be conducted by women drivers as per @EsheteBekele. The city admin also said it planned to bring in 3000 buses in the near future to east city’s transport shortages.", "#Irrecha forum opens. #Ethiopia https://fanabc.com/english/2019/10/irrecha-forum-opens/ …", "#Ethiopia: Athletes united, but rival fans show Ethiopia’s divides https://www.apnews.com/f29f2cc6720f4f2380ccaecb09570a36 …\n#WorldAthleticsChamps #Doha #Qarar", "A delegation of executives from @ethiotelecom including the chief Ms. Firehiwot Tamiru paid a 3 day visit to Tigray regional state. The delegation also met with the president of Tigray regional state Dr. Debretsion Gebremichael on infrastructure dev't.", "Delighted to participate in the signing ceremony of letter of intent between @MoF_Ethiopia & @badeabank to co-finance the Integrated Agro Parks Program with @AfDB_Group. The Program aims to facilitate the Agri-value Chain setup.", "Since 2007, the U.S. Government has invested more than 442 million U.S. dollars through @PMIgov to help Ethiopia’s malaria control efforts. https://bit.ly/2nGSFvc  #USInvestsInEthiopians #ZeroMalaria", "Hidden for 21 years, #Ethiopian crown set to return home https://news.yahoo.com/hidden-21-years-ethiopian-crown-set-return-home-054141584.html …\n\"A priceless 18th-century Ethiopian crown is set to be returned from the Netherlands to #AddisAbeba after a one-time refugee found it in a suitcase and hid it in his apartment for two decades.'", "Important to clarify that the Ethiopian government has not appointed an advisor as of yet. @MoF_Ethiopia has just issued request for EOI to hire one. KPMG is hired by @ethiotelecom for  own valuation work.", "#Ethiopia dam official blames construction delays on conglomerate #METEC https://reut.rs/2oSGEDc  Belachew said it was unclear exactly how much  METEC was to blame for delays that have put the project five years  behind schedule. Although Abiy blamed METEC for problems last year", "Analysis: Helping #Ethiopian farmers adapt to drought & flooding   https://addisstandard.com/analysis-helping-ethiopian-farmers-adapt-to-drought-and-flooding/ … the village of Berebeyu in #Amhara region is grappling with the realities of climate change, with hundreds of its inhabitants reeling from land losses & poor harvests,or no harvests at all.", "#Ethiopia’s Prime Minister Commissions Artist Elias Sime for New Public Garden https://shar.es/aXDOoG  Later this month, Sime will be honored as one of two winners (along with Njideka Akunyili Crosby) of African Art Awards from the Smithsonian’s National Museum of African Art", "Update: Speaking at the signing ceremony, which was also attended by Lemma Megerssa, PM Abiy Ahmed said that the time when political parties work against each other should come to an end & all parties should focus on complementing each other's efforts to serve the #Oromo people", "News Alert: Political parties representing the #Oromo constituency, including regional ruling party ODP, led by PM Abiy Ahmed, OFC led by Prof Merea Gudina, & OLF led by Dauwd Ibsa, co-signed on a key doc. today pledging to make the transition a success. \nThis story is developing", "An important commentary by @BelachewM on the possible formation of #coalition gov. in #Ethiopia post #election. Raises key questions on #transition if a hung #parliament, which the country needs to be prepared for.", "#Lagos light rail and the problem of accountability https://businessday.ng/columnist/article/lagos-light-rail-and-the-problem-of-accountability/ …\n'In 2012, #AddisAbeba began building its $475m light rail. It finished in record time. Lagos is still working on its $1.2bn rail system – 11 years later with no completion in sight.\" \n#Ethiopia #Nigeria", "PM Abiy Ahmed launched the ‘Beautifying Sheger’ section of the project to be built by the Chinese construction giant CCCC. In his remarks at the event, he thanked the Govt of China for the continued support provided in Ethiopia’s ambitions of greening & cleaning its capital. 1/2", "With more than two billion cups drank every day, coffee is a global force. Learn more here: https://www.bbc.com/reel/video/p07nkgsb/how-the-world-came-to-run-on-coffee?ocid=twmoereel …", "Great read @BelachewM\n\"how are we going to understand ‘the day-to-day affairs of the government’ which are to be performed awaiting the full-term government?\"", "US military shows appalling disregard for civilians killed in Somalia air strike - Amnesty", "Today we had a fruitful discussion with religious leaders invited from all zones & districts of #Tigray region. The discussion was highly focused on problems related to Nutrition, Hygiene and Sanitation, #GBV and HIV/AIDS prevention. All agreed and promised to work hard.", "Deputy PM Demeke Mekonnen inaugurated Eka Kotebe General Hospital today; five floor building that provides services of mental health with 150 beds and general medical services with 200 beds, built with a total cost of 160 Mill ETB.", "Puntland and Jubaland reportedly boycott #SomaliaPartnershipForum via @goobjoognews", "These ambitious young #Ethiopian entrepreneurs, academics and influencers met up at @Denmark_Addis before heading to Copenhagen next week to participate in the Next Generation City Action at the C40 Summit alongside @MayorofAddis.", "Belgium offers a useful lesson when one envisions forming a coalition gov't. At some point this may become a necessity in #Ethiopia. It's written as is. @DrMehari @GirumTweets @girma_mohammed @KjetilTronvoll @abiyetk @merkebachin @TomGardner18 @Soli_GM", "In this must read op:ed @BelachewM argues \"This is becoming increasingly likely due to the growing number of alternatives that are going to fight it out in the election platform compelling us to rule out the old order of an all-EPRDF majority in Parliament,\" & provides lessons.", "Op:ED: The prospect of a coalition gov't in #Ethiopia is real. Lessons from the politics of compromise https://addisstandard.com/oped-the-prospect-of-a-coalition-government-in-ethiopia-is-real-lessons-from-the-politics-of-compromise%ef%bb%bf/ … One of the ‘ifs’ should Ethiopia goes ahead with the election in 2020 is the chance of a coalition gov. formation, both at the central & regional levels.", "Galfata Qabsoo \n***\nSirna walharkaa fuudhinsa Medaliyaa Athelet Feyisa Lelisa Rio fi Hundeefamma ‘Feyisa Lelisa Foundation’ irratti akka argamtan katabajaan affeeramtanittu. \n\nBakka: Galma Barkumee\nGuyyaa: Kamisa Fulbaana 22 (ALI)\nSa’aa: 8 irraa kaasee.", "Proposal on #GERD “is aimed at fulfilling Egypt’s interest only”: #ENTRO https://www.ena.et/en/?p=9851  ENTRO Exc.Dir Fekahmed Negash said that #Egypt’s proposal violated the procedure that should be pursued. It should be #Ethiopia that should come up with a proposal about the filling.", "MU goes in to a tripartite agreement with Embassy of France in Eth., & Alliance Ethio-Francaise of Addis Ababa, to formalise cooperation to develop french Language program at MU @MekUniETH - an opportunity for our students, staff & the community in #Mekelle; internationalization", "#Ethiopia:Nations, Nationalities & Peoples Day Will Cement People-to-People Relations: Speaker of the House of Federation Keria Ibrahim.\nhttps://fanabc.com/english/2019/09/nations-nationalities-and-peoples-day-will-cement-people-to-people-relations-speaker/ …\nThis year’s celebration will include economic aspects & the realization of federalism will be the center of discussions", "Muktar #Edris has had an understated career and was probably the least favored of the #ethiopian team in the 5000m. But yet again, he delivers gold when it matters. Congratulations! #Ethiopia #Doha2019", "Muktar Edris came first, earning #Ethiopia the first gold medal in the ongoing #WorldAthleticsChamps . Muktar  was followed by the young, energetic Selemon Berega, who came second in the men's 5000m. \n\nA remarkable show of talent! \n #WorldAthleticsChamps \n\nPictures: @addojunr", "#Ethiopia: \"Absolute scenes in the #WorldAthleticsChamps 5000m final.\n\nThe 2017 world champion becomes the 2019 world champion.\n\nMuktar Edris wins  for Ethiopia  in 12:58.85.\" @iaaforg", "Our international office in Addis Ababa along with UAE embassy in Ethiopia, hosted a forum to strengthen economic relations between the UAE, Ethiopia & Africa, and signed an MoU with women empowerment accelerator CAWEE to help strengthen the role of women in entrepreneurship.", "#Ethiopia: [Haile] Gebrselassie says runners could have died\nhttps://www.washingtonpost.com/sports/the-latest-gebrselassie-says-runners-could-have-died/2019/09/30/45d04a62-e382-11e9-b0a6-3d03721b85ef_story.html?outputType=amp …\nDistance-running great Haile Gebrselassie says it was wrong to hold the track and field world championships in #Qatar and marathon runners could have died from the heat.\n#WorldAthleticsChamps", "#Ethiopia: Regional Town Gets Solar Farm https://addisfortune.news/regional-town-gets-solar-farm/ …\n#Qoftu town in #Oromia Regional State has been chosen as the site for a solar energy project that has a capacity of generating 250kW of energy.\n\nPicture: file.", "U.S. Ambassador’s Statement on September 30 Attacks in Mogadishu and Baledogle", "The 5th meeting of the National Independent Scientific Research Group (NISRG) of #Ethiopia, #Sudan and #Egypt kicked off in #Khartoum. It is expected to deliberate on agenda items agreed during the meeting of the water affairs ministers held in #Cairo, Egypt on Sep. 15-16. FBC", "Congratulations to #LetesenbetGidey. Silver medalist at #DohaWorldChampionships 10km race for #Ethiopia ", "Ashete Bekere also of Ethiopia powered to victory in the Women's category,Berlin Marathon 2019 in a time of 2:20:14", "Jihadists attack military base where US soldiers train commandos in Somalia, causing casualties - reports", "Djibouti dam financed by Turkish government completed\nThe main body of the dam, built under a deal signed between #Turkey and #Djibouti in 2014 on cooperation on water, concluded its construction and the dam is ready to hold water now.", "#Ethiopia: 'I invented a malaria detector after my brother died' https://www.bbc.com/news/live/world-africa-47639452?ns_mchannel=social&ns_source=twitter&ns_campaign=bbc_live&ns_linkname=5d8df357d18da806558b3910%26%27I%20invented%20a%20malaria%20detector%20after%20my%20brother%20died%27%262019-09-27T12%3A23%3A13%2B00%3A00&ns_fee=0&pinned_post_locator=urn:asset:518c6d98-14ab-4683-ad5b-767e35321d86&pinned_post_asset_id=5d8df357d18da806558b3910&pinned_post_type=share … \n\nTorpout Nyarikjor, an engineer student at #Dilla University in southern Ethiopia, said he was prompted to invent his device after losing his brother to the mosquito-borne disease.", "“Sudan's foreign ministry on Sunday summoned the Egyptian ambassador in Khartoum over the arrest of a Sudanese student in Cairo.” http://www.xinhuanet.com/english/2019-09/30/c_138434499.htm …", "‘There is Nothing that a Woman or a Girl Cannot Do’ @SahleWorkZewde https://www.voanews.com/africa/ethiopian-president-there-nothing-woman-or-girl-cannot-do?amp&__twitter_impression=true …\nFirst of all, I always see the glass half full.If you don't have that perspective, then it can distort your views. 2nd, I think we have to think of where we were like two,three years ago.", "Congratulations team #Ethiopia for sweeping #BerlinMarathon. Men: Kenenisa Bekele 1st at 2:01:41 (2 sec. short of WR), Birhanu Legesse 2nd & Sisay Lema 3rd. Women: Ashete Bekere 1st & Mare Dibaba 2nd. Thank you Kenenisa for the great comeback, thank you all for your inspiration.", "I visited a shelter run by a local NGO in #Jigjiga that opened in 2018. 2500+ victims of rape, violence & torture came to the center within a year. They can only help the most vulnerable as their funds are limited.", "#Ethiopia: Gifaata, a New Year celebration of the #Welayta community in #SNNPRS,was colorfully celebrated y'terday. It came at a culmination of multiple events that ran through the last week including cultural symposium, fashion show & street race, among others! Yoo Yoo Gifaata!", "\"We don't name children just after they are born. We wait.\"\n \nThe Borana people of Ethiopia & Kenya can wait up to three years after their children are born to name them. It all revolves around this traditional ceremony... ", "Police in Nigeria rescued nearly 300 people after a raid on a building, housing an Islamic school, where they were detained and allegedly tortured.\n\nRead more: https://aje.io/878gb ", "This is my piece on the topic of the currently surfacing issue  of independence in #Tigrai with in the purview of #Ethiopia’s politics. I hope you will read it candidly and give your constructive remarks either negatively or positively.", "Ashete Bekere is now the Berlin marathon champion! \nCongratulations #Ethiopia.\nShe ran a new personal best of 2:20:14.", "#SifanHassan takes 10,000m world title with late surge https://www.euronews.com/2019/09/28/hassan-takes-10000m-world-title-with-late-surge …\nThe #Dutchwoman overtook #Ethiopia’s Letesenbet Gidey just before the bell and powered away over the last lap... #WorldAthleticsChamps", "The GOAT is Back: #Kenenisa Runs Stunning 2:01:41 at BMW #BerlinMarathon https://www.letsrun.com/news/2019/09/the-goat-is-back-kenenisa-bekele-runs-stunning-20141-at-bmw-berlin-marathon/ … In one of the most thrilling & surprising marathon performances of all time, #Ethiopia's Kenenisa showed, definitively, why he is the greatest distance runner to ever walk the earth.", "So thrilled to announce that tech pioneer, @betelhem_dessie is joining Kudu Ventures as Partner. She’ll be running Kudu Women, our new $1M female-entrepreneur fund. As #Ethiopia’s first women tech-fund, we’re committed to investing in over 100 female founders by 2022. #KuduWomen", "እንኳን ለብርሀነ መስቀሉ በሰላም አደረሰን ::\n#Ethiopia", "Happy #Mesqel from team #AddisStandard to the followers of Ethiopian Orthodox Tewahdo Church (#EOTC) celebrating the finding of the True Holy Cross of Christ!  #Demera #Mesqel #Ethiopia", "First group of vulnerable refugees evacuated from #Libya to #Rwanda: https://www.unhcr.org/news/briefing/2019/9/5d8dc6e64/first-group-vulnerable-refugees-evacuated-libya-rwanda.html …  The group which landed at Kigali international airport around 9:30 pm local time, included a baby born in Libyan detention just two months ago. 26 of the evacuees were refugee children", "Pictorial: Sunday school students of various Churches marching toward #MesqelSquare to participate in Demera program by #EOTC.The commemoration of #Mesqel, the finding of the True Holy Cross of Christ, is inscribed by #UNESCO as Intangible Cultural Heritage of Humanity. \nPics:FBC", "Update: @ETHZema responds to @NEBEthiopia's statement from yesterday, says it's following #Ethiopia's democratic reforms \"closely and carefully\"", "ነፃ ዋይ ፋይ በመሰቀል አደባባይ\nFree WiFi at Meskel Square #Meskel #Ethiopia #Ethiotelecom", "#Egypt tightens security after call for repeat protests https://af.reuters.com/article/topNews/idAFKBN1WC0SY-OZATP … \"Egyptian security forces closed off entrances to #Cairo’s #TahrirSquare on Friday and deployed police reinforcements after a call for a second week of rare anti-government demonstrations.\"", "State Min. of Foreign Affairs Hirut Zemene & Min. of Water, Irrigation & Electricity Seleshi Bekele briefed the diplomatic community about current status of #GERD. The next round of trilateral meeting b/n #Ethiopia, #Egypt & #Sudan will take place on Oct. 03, in Sudan: Surc: MoFA", "President Sahle-Work Zewde in New York", "Coopr'n in #NileBasin isn't an option but a necessity: @SahleWorkZewde https://fanabc.com/english/2019/09/cooperation-in-nile-basin-is-not-an-option-but-a-necessity-says-president/ … #Ethiopia strongly believes that the utilization of the Nile River shall be based on the principles of equitable &reasonable utilization of natural resources causing no significant harm", "On the sidelines of #UNGA President Sahle Work Zewde shared #Ethiopia’s unique approach to address malnutrition, poverty & the broader #SDG agenda.  \n\n#SEQOTADECLARATION is a new blueprint for dev't that galvanizes 9 sectors to work as one aligned from federal to village level.", "#Ethiopia:In preparation for this afternoon's celebrations of #Mesqel, the founding of the true Cross, by followers of the Ethiopian Orthodox Tewahdo Church (#EOTC), volunteers have joined @TakeleUma to clean up #MesqelSquare, in #AddisAbeba,where the celebrations will take place", "BREAKING: Somalia President Mohamed A. Farmajo tells the UN General Assembly that bilateral negotiations with Kenya over the maritime dispute have not been fruitful, says he wants the @CIJ_ICJ to settle the case. Farmajo pledges that Somalia will abide by the Court’s decision.", "#Ethiopia: Watch Live: President @SahleWorkZewde delivering her speech in #Amharic at the ongoing UN General Assembly: General Debate, 74th session http://webtv.un.org/live-now/watch/general-assembly-general-debate-74th-session/5970440811001#.XYznlns01zM.twitter …", "#Ethiopia appoints Ethio Telecom privatization adviser, seeks another for licensing https://reut.rs/2mTgL55  State Min.of Finance @EyobTolina said that @ethiotelecom had appointed international consulting firm #KPMG to help with a process aimed at selling off stakes in the telecom", "A $63 mn loan agreement was signed today b/n #Ethiopia & Export-Import Bank of #Korea for the construction of #AddisAbeba rapid bus system(B6 corridor) that will cover 11.05 km,17 bus stops & 2 terminals. The loan has 40 yrs maturity period, 15 yrs grace period & 0.01% interest.", "@TakeleUma በከተማዋ ሶስት የህዝብ መዝናኛ ፓርኮችን ስራ አስጀምረዋል፡፡\n\nፓርኮቹ በአጠቃላይ ከ13.9 ሄክታር በላይ ስፋት አላቸው፡፡\n#greenaddis\n#AddisAbaba", "#Measles outbreaks are ongoing in #Amhara (703), #Afar (548), #Oromia (4,611) and #Somali (2,340) regions. 8,202 suspected cases have so far been reported. 50.2% of reported cases are under 5 age group and 25.5% of cases are 15-44 years of age.", "#Ethiopia: 1,282 cases of #Cholera were reported since April 2019.Currently there are active outbreaks in #Oromia, #SNNPRS, #Somali & #Afar regions. \n\n40,340 cases, with no deaths, have been reported in #DireDawa since #Chikungunya outbreak started in Aug.\nhttps://reliefweb.int/sites/reliefweb.int/files/resources/HC-bulletin_August-2019-%281%29.pdf …", "President @SahleWorkZewde will speak at the @UN General Assembly today.  Follow live at http://webtv.un.org  @mfaethiopia @addis_fortune @PMEthiopia @addisstandard @fanatelevision @ebczena", "#Ethiopia: #Sebeta town administration communication bureau in #Oromia special zone said security forces have seized 40 Kalashnikov while being illegally transported in to #AddisAbeba today. The weapons were hidden in code 3 AA plate number vehicle \nhttps://fanabc.com/2019/09/%e1%88%85%e1%8c%88-%e1%8b%88%e1%8c%a5-%e1%8b%a8%e1%8c%a6%e1%88%ad-%e1%88%98%e1%88%b3%e1%88%aa%e1%8b%ab-%e1%89%a0%e1%88%b0%e1%89%a0%e1%89%b3-%e1%8a%a8%e1%89%b0%e1%88%9b-%e1%89%b0%e1%8b%ab%e1%8b%98/ …", "#Khashoggi murder 'happened under my watch,' Saudi crown prince... https://reut.rs/2mKTOkH  “It happened under my watch. I get all the responsibility, because it happened under my watch,” he told PBS’ Martin Smith", "#Ethiopia joined the world on the strike for climate today and the Green Cities family was there to make it happen. \n#Ethiopia\n#Strike4Climate\n#GreenCities\n#GreenLegacy\n#EthioTweeps", "With the generous support of #KOICA, mother's like Russia in hard to reach communities can access health care for their children in Benishangul Gumuz region, #Ethiopia through the community based newborn care intervention. \n#EveryChildAlive\n@KoreainEthiopia", "Jacques Chirac, former French president whose later years were blighted by corruption scandals, has died aged 86", "#Jubbaland forces clash with Al-Shabaab in outskirts of #Kismayu http://goobjoog.com/english/heavy-fights-erupts-in-kismayo-lower-juba/ … According to residents, al-Shabaab militants attacked a military base of the Jubbaland state . The fighting lasted for more than an hour and both sides used heavy ammunition with casualties.", "'Free, but not free': Tortured ex-Bagram inmates struggle to cope @AJEnglish", "In recognition of the 50th anniversary of blood transfusion service in , MoH organized National blood donation campaign to collect 10,000 units of blood in one day- October 26, 2019. \nAlso, planned to register 100,000 regular blood donors in the same day & 300,000 in a month.", "voters who favor the #Sidama Zone to become #Ethiopia’s 10th regional state should mark on the sign of #Shafeta, a Sidama traditional bowl; and voters who want to see Sidama zone to remain part of #SNNPRS should mark on the sign of the #Hut, a Sidama traditional roundhouse.", "#Ethiopia: Electoral Board unveils Sidama Referendum signs https://addisstandard.com/news-electoral-board-unveils-sidama-referendum-signs/ … In a statement @NEBEthiopia sent out to local media, it said that the Board was finalizing preparations to hold the #SidamaReferendum on November 13/2019, the schedule it announced on August 29.", "@AddisAbabaUnive was ranked 13th in Africa and 729th globally in the fifth annual U.S. #NewsBestGlobalUniversities rankings. This new ranking is a testimony to #AAU's dedication and commitment to excellence in higher education,\" said Dr. Yonas Adaye, Director of @IPSS_Addis.", "#Ethiopia: #DHL-@flyethiopian Joint Venture Eyes Further Expansion in Ethiopia - http://aviationtribune.com/airlines/africa/dhl-ethiopian-airlines-joint-venture-eyes-further-expansion-in-ethiopia/ … The #Hawaasa & #BoleLemi stations mainly serve export from the industrial parks, while stations in #AddisAbeba & #Modjo will serve both export and import...", "Over the next 2yrs, #Hamlin’s goal is to expand the #Rehabilitation #Reintegration Program at #DestaMender to 245 #fistula survivors annually. This opportunity will see more women benefit from vocational training, empowered w skills & choices. Learn more.", "Please replace \"20,000 automatic guns\" with 20 automatic guns. We regret numeric error.", "\"Families who lost relatives in fatal #Boeing 737 Max air crashes are set to receive about $144,500 (£116,200) each from the company,\" BBC \n\n \"#Boeing settles 1st Lion Air cases with MAX victims, $1.2 mn per victim,\" AFP \n\n#Ethiopia @flyethiopian", "The first batch of the Ethiopian athletics team that will compete in the 17th IAAF World Athletics Championships arrived in Doha, Qatar.\nhttps://ethiopianembassy.be/2019/09/25/first-batch-of-team-ethiopia-arrives-in-doha/ …", "Ahmed Humed, Afar Police Crime Prevention Bureau deputy head said the arms were seized in Elidar Wereda, Dichato Kebele.They originated from #Yemen & were destined to Ethiopia via southern Elidar,where #Afar  borders #Djibouti. This is the 2nd incident in Afar in less than a week", "#Ethiopia: A joint operation b/n federal intelligence & #Afar region police resulted in seizure of 20,000 automatic guns; a pistol; 42,392 regular ammunition; 8, 484 M14 ammunition; & 45 automatic machine gun ammunition. The arms were seized en route from #Djibouti to Ethiopia", "#Ethiopia’s plans for solar mini grids move forward https://www.pv-magazine.com/2019/09/25/ethiopias-plans-for-solar-mini-grids-move-forward/ … Ethiopia’s state-owned utility the Ethiopian Electric Utility (EEU) has issued an invitation for bids to seek developers to deploy solar mini-grids in 25 villages, with the projects financed by the ADB.", "President @SahleWorkZewde held a bilateral meeting with @SudanPMHamdok on the sidelines of the #UNGA74 General Debate. The president congratulated him on assuming the priemership and wished him success in leading his country through this time of transition.", "The office of #Ethiopia’s attorney general says more than 1,200 people have been killed & more than 1.2 m displaced in clashes in the country over the past year. The office has pressed charges against more than 1,300 ppl,with some 645 now in police custody https://www.seattletimes.com/nation-world/nation/ethiopia-says-1200-plus-killed-in-unrest-over-past-year/ …", "During the Ethiopian-Danish co-lead of the Energy Transition\ntrack at the @UNClimateSummit this week, Danish energy adviser @SvenssonNikolaj was in New York as part of the Ethiopian delegation and had the honour of greeting Ethiopian President H.E. @SahleWorkZewde", "BREAKING: Memo shows President Trump repeatedly prodded Ukraine president to work with lawyer Rudy Giuliani, AG William Barr to investigate Joe Biden.", "#Somalia: Jubaland postpones inauguration of regional leader Ahmed Madobe citing Federal Govt’s move to “block” dignitaries from attending the event. The inauguration was scheduled to take place on Sept 26, no date has been set for the new inauguration.", "#Ethiopia:\"#TPLF will never accept a unity created for the sake of [political] power\" Getachew Reda. https://www.bbc.com/amharic/news-49826385 …\nGetachew said this when asked to comment on recent reports that EPRDF was finalizing preparations to unify as one party called \"Ethiopian Prosperity Party\"", "NEBE disputes EZema's claims of taking part in Board's restructure,new electoral bill https://addisstandard.com/news-nebe-disputes-ezemas-claims-of-taking-part-in-boards-restructure-new-electoral-bill/ … @NEBEthiopia said it found the explanation by Berhanu that @ETHZema's legal professionals have actively participated in this process to be a \"misrepresentation of facts.”", "Birkirkara FC is delighted to announce the signing of the Ethopianian National Women's Team player, @LozaAbera", "The irony of #Ethiopia hosting internet freedom forum https://www.bbc.com/news/live/world-africa-47639452?ns_mchannel=social&ns_source=twitter&ns_campaign=bbc_live&ns_linkname=5d8af4d417953a0663cfa354%26The%20irony%20of%20Ethiopia%20hosting%20internet%20freedom%20forum%262019-09-25T07%3A48%3A23.959Z&ns_fee=0&pinned_post_locator=urn:asset:513d66c5-7a27-4590-a816-db8ef3a08ade&pinned_post_asset_id=5d8af4d417953a0663cfa354&pinned_post_type=share … Ethiopia lost at least $4.5m (£3.6m) each day that the internet was down,#Netblocks\n\nYet digital rights activists in Ethiopia see the conference as a milestone - & an opportunity to raise their concerns", "Update:Top marks for Ethiopian who wrote exams after labour https://www.bbc.com/news/live/world-africa-47639452?ns_mchannel=social&ns_source=twitter&ns_campaign=bbc_live&ns_linkname=5d8a0ad117953a0663cfa230%26Top%20marks%20for%20Ethiopian%20who%20wrote%20exams%20after%20labour%262019-09-24T12%3A45%3A14%2B00%3A00&ns_fee=0&pinned_post_locator=urn:asset:de1a2c17-acfc-40cd-a8bd-3e6ce436ab22&pinned_post_asset_id=5d8a0ad117953a0663cfa230&pinned_post_type=share … “When she was admitted to the hospital for delivery,I ensured everything was in a good condition & left her at the hospital with relatives.I rushed to the education bureau,”Tadese, Almaz's husband", "Marta Megra from #Ethiopia sets new record for women's full marathon at #Hengshui https://www.prnewswire.com/news-releases/marta-megra-from-ethiopia-sets-new-record-for-womens-full-marathon-at-hengshui-300924900.html … Aychew Bantie Dessie, also from #Ethiopia, came in first at the men's full marathon when he clocked in at 2 hours, 8 minutes and 51 seconds.", "#Ethiopia: Bill Unlocks Mobile Money Service http://disq.us/t/3iftwky  The draft directive allows 3 levels of transactions. Under the first level,the maximum permitted account balance is 3,000 Br, with an aggregate daily & monthly transaction limit of 300 Br 6,000 Br, respectively.", "Day #2 of -- Innovation for Development Workshop. Today’s agenda is focused on the work of development agencies in fostering the #innovation ecosystem, and discussing the lessons from the Israeli experience to be implemented in #Ethiopia.", "Great conversation with President Farmaajo today about Somalia’s progress towards debt relief, advancing federalism, and fighting terrorism. The U.S. is committed to assisting #Somalia on its path toward stability and security. @US2SOMALIA", "Lensa Mekonnen: #Ethiopia's Tourism Revival  https://aje.io/3ks5h \n\"My Ethiopia is our long-lasting traditions and cultures. My Ethiopia is our family-centred lifestyle. My Ethiopia is our authenticity,\" Lensa Mekonnen, [former] CEO of state-owned Tourism Ethiopia.", "Amid frosty relations resulting from maritime dispute, the leaders of Somalia and Kenya met in New York for the first time since March; agreed to restore relations to previous status; take diplomatic steps to build confidence b/w the two govts and people, per @TheVillaSomalia", "Members of #ENDF, #Oromia Police & a student (who was given ride), a total of 5, who were on travel ambushed & killed over the weknd (Strday) in Arero district of #Borena zone, South #Ethiopia. \n\nDistrict admin Kiya Dido accuse armed men for the killing.", "#Ethiopia:#AddisAbeba City Admin said it has finalized preparations to dispatch 100 new buses to the city transport system as of tomorrow.The City Admin said as part of its plans to alleviate dire transport shortage,further measures will be taken to increase mass transport system", "For years, drought and famine plagued the Abraha Atsbeha village in Ethiopia. The @giz_gmbh , alongside other donors, stepped in to work with the village and help restore soil fertility and cultivate farmland. #GermanyInAfrica", "#Ethiopia's reform process opens doors for fora like #FIFAfrica19 that were previously impossible to host here with opportunities for research, business, regulations, and policymakers on emerging #internetfreedom areas. Starting from a low base, where should we start and focus?", "#Kenyan Delegation arrives in #Somaliland to establish Consulate https://www.horndiplomat.com/2019/09/24/kenyan-delegation-arrives-in-somaliland-to-establish-consulate/ … On April 26,2019 #Kenya assigns Phillip Githiora to establish the Kenyan mission in #Hargeisa, perhaps an indication #Nairobi will finally recognize the self-declared semi-autonomous state", "#TheShadowKingNovel launches today. It's been a long road but I have been grateful for your past kindness & current generosities. Thank you. \n#Ethiopia #WWII #WomenInWar #literature #fiction", "#Somaliland MPs Attend 64th Commonwealth Parliamentary Conference in Kampala #64CPC2019 https://www.horndiplomat.com/2019/09/24/somaliland-mps-attend-64th-commonwealth-parliamentary-conference-in-kampala/ … via @twitter.com/@Horndiplomat", "Analysis: Why pastoral, Agro-pastoral livelihoods in Horn of #Africa face an inevitable threat  https://addisstandard.com/analysis-why-pastoral-agro-pastoral-livelihoods-in-horn-of-africa-face-an-inevitable-threat/ … The intensity & frequency of climate-driven natural disasters & conflicts are increasing,  stripping away the limited assets of the poor & vulnerable. #Ethiopia", "#Ethiopia to commission #Chinese-built 254 MW #hydro dam https://www.iol.co.za/business-report/international/ethiopia-to-commission-chinese-built-254-mw-hydro-dam-33492116 … The Genale Dawa III hydro dam, located in southeastern Ethiopia, is expected to be commissioned before the end of 2019, Moges Mekonen, Communication Director at Ethiopia Electric Power, said.", "My take on Asian values and the lessons for Ethiopia...", "Live from #Hosaena, the capital city & the administrative center of #Hadiya Zone, in #SNNPRS. A celebration of Yahode Mesqela (ያሆዴ መስቀላ),a New Year celebration of the diverse community of Hadiya. \n\nHappy New Year to the beautiful people of Hadiya.  \nhttps://www.facebook.com/EBCzena/videos/722742774835287/?__tn__=kC-R&eid=ARBjYs9IwDwMFk3gcUBR7-JH0_zzsT8W_1JUnvv3vf_DKGduoPL9609FQDYHFlTrniXK4np38ZQ8XwqC&hc_ref=ARTRbYZlkMpH9pK0Mk6p2t_X9lfrMjXZlepGQwOlruCVfOhsFnRA7VBxz1sfHLlv2A4&fref=tag&__xts__[0]=68.ARCNlvY8Q7u1o-TnFq3IcrDkHSoLbPS4l3a4IVJEVAbr6LLxGK09lD3c83eEE6cniU3zGd7t1qyGQV0VQOvt1P3u_aAewVhnQV16WT0L7VAKfuC2qRa_nmeCa9qn4vpwITPlKhNxEur6cRId7EEXhETvbFIsTVmCbJzVE6MFmLRSRd-JdFWYKyMkYfDb-yd6c_O266BZ20r5ioGeWOckn7OR7TkFSzy0r7259NbbaE_roSOAQD38CrU2-CcWGEN0Us6iThmP5v0jqZ7rnNej_ZpHYnCE_GSxyhctUb14b0Qa6r4QLsL5CGQsmXpv6ZhcWqmwIW2S8crz2FwOTRa4ib0TxnPMaxKMrms1 …", "How #Asian values can transform Ethiopia’s labor force https://addisstandard.com/opinion-how-asian-values-can-transform-ethiopias-labor-force/ … There is much more  the Ethiopian labor force can learn from Asia that is as much needed in #Ethiopia as replicating Asia's economic model; values such as discipline, harmony & social responsibility.", "Communities in #Ethiopia's #Somali Region face chronic drought linked to climate change https://p.dw.com/p/3Q6pi?maca=en-Twitter-sharing … \"The Somali Region has suffered from chronic #drought for several years, with the worst stretch recorded in 2016, from which many households have yet to recover.\"", "#Ethiopia tenders for additional 200k mt of milling wheat \nhttps://www.agricensus.com/Article/Ethiopia-tenders-for-additional-200k-mt-of-milling-wheat-8600.html …\nEthiopia’s state grain importer opened a new milling wheat tender on Monday, its second in the space of a week, to take total volumes in the market to 600,000 mt", "The  Embassy together with the  Min of Innovation & Tech & @UNDPEthiopia launched today, the Innovation for Development Workshop in Addis. Israeli experts will present their experience in innovation & discuss the opportunities for developing the innovation ecosystem in .", "#Ethiopia:Pupils in gov. schools in [#AddisAbeba] to eat free meals https://africa.cgtn.com/2019/09/23/pupils-in-government-schools-in-ethiopia-to-eat-free-meals/ … ‘‘We are planning to feed more than 300,000 students,”Zelalem Mulatu,Addis Abeba City Education Bureau deputy said.The city admin was expanding a scheme that had been feeding 70,000 pupils", "At #ClimateActionSummit today, President Sahle-Work\nZewede announced a major coalition initiative that #Ethiopia was leading on Energy Access, shared #Ethiopia’s success in planting world record, over 350 million, trees in a day. @mfaethiopia @TayeAtske @PMEthiopia @addisstandard", "#Boeing to pay bereaved 737 families $144,500 each https://www.bbc.com/news/business-49803068 …\n\"$144,000 doesn't come close to compensating any of our families or any of the families,\" said Nomaan Husain, a Texas-based attorney who is representing 15 families.", "How #Ethiopia’s #BeBlocky is gamifying learning to code for thousands of kids https://disrupt-africa.com/2019/09/how-ethiopias-beblocky-is-gamifying-learning-to-code-for-thousands-of-kids/ … “Some of us were introduced to programming late in high school, but for most it was very new and the introduction couldn’t get any harder,” Nathan Damtew", "Happenning;\n\"The Quest for Sustainable Peace in Ethiopia; Trajectories\" conference in Mekelle, Tigray.\nMany political elites from all over #Ethiopia in the hall. We'll update you more.", "Ethio Telecom & Commercial Bank of Ethiopia (CBE) sign agreement that will enable clients to make their monthly payments via the bank.@ethiotelecom post payment clients can now pay their service fees using the bank’s services, CBE Birr, Internet Banking, & Mobile Banking & ATMs", "PM Abiy \"received Siraj in his office today to appreciate him for placing country & people above himself in upholding the rule of law. He shared there are impon't lessons to learn from such law enforcement agents who protect the peace & security of fellow citizens in honesty\" PMO", "PM Abiy Ahmed awarded a certificate of recognition to Siraj Abdella, a member of the #Afar Regional State Police. Siraj was in the news this weekend after he refused to accept a bribe of 40,000 birr from arms smugglers. \"I refused b/c it will hurt the future of #Ethiopia,\"he said", "I have seen horrific pictures posted by Al-Shabaab. I send condolences 2 the families of the brave Somali Armed Forces' martyrs felled by the enemy. I call upon FGS that is busy imposing embargo on the people of Jubaland to instead rescue our soldiers being massacred by the enemy", "The Hessian Peace Prize by the State of #Hessen in #Germany was warded today to PM @AbiyAhmedAli. Minister of Peace, Muferiat Kamil, accepted the prize on behalf of PM Abiy at a ceremony held in the City Council Hall of #Wiesbaden, the capital city of Hessen State. @dw_amharic", "All of the passengers in one of the buses are feared to have been killed, while a few have survived from the 2nd bus, raising fears of higher number of causalities. The accident happened off an area called \"Yechereka\", near a bridge leading toward #Dembecha, @AMMAONLINE2 reported", "#Ethiopia: 16 people killed so far when an Isuzu truck crashed into two mid-sized public buses & a Bajaj in West #Gojam zone, Dembecha surrounding area in #Amhara regional state.The actual No.of causalities is not known yet in the accident suspected to have been caused by speed.", "‘Nature does not negotiate’ says UNSG @antonioguterres .  A wake-up call that #ClimateChange threatens #Peace and security, here in #Ethiopia  and worldwide. If we don’t take care of nature, it won't take care of us.  Worth remembering on this year’s #InternationalDayOfPeace.", "Detailed report from @addisstandard on what seems to be a major op to round up #AlShabaab and ISIS members (some who transited #Djibouti & #Somaliland) plotting attacks in #Ethiopia. Ethiopian officials attribute success to intel cooperation among multiple countries.", "Good question. @addisstandard has a more detailed report https://addisstandard.com/news-ethiopian-intelligence-says-it-arrests-dozens-of-suspected-al-shabaab-isis-members-planing-to-carry-out-attacks/ …", "#Ethiopia’s privatization urgency sparks debate https://newbusinessethiopia.com/investment/ethiopias-privatization-urgency-sparks-debate/ … Why are we I a rush to sell these assets of the people,” Kibur Gena questions, “I don’t think we are free from the international financiers pressure such as, the #WorldBank…We are all grown ups and know it.”", "\"#Moody's decision to affirm the rating at B1 recognizes a combination of credit strengths including strong growth potential supported by large infrastructure projects, underpinned by foreign direct investment and donor support.\" #Ethiopia #Economy", "#Moody's changes #Ethiopia's outlook to negative,affirms B1 rating https://www.moodys.com/research/Moodys-changes-Ethiopias-outlook-to-negative-affirms-B1-rating--PR_410488 … The decision to change the outlook to negative reflects rising fiscal & external risks related to the decline in gov't revenue generation & rise in State-Owned Enterprise external debt...", "Swapping traffic for a workout on #Ethiopia's streets https://www.bbc.com/news/av/world-africa-49761770/swapping-traffic-for-a-workout-on-ethiopia-s-streets … Sunday 22 September is #WorldCarFreeDay2019 - but in #Ethiopia it happens on the last Sunday of every month, across the country.\n\nThe first Car Free Day was held in Ethiopia in December 2018. @amirabiy", "News: #Ethiopian intelligence says it arrests dozens of suspected #alShabaab, #ISIS members \"planing to carry out attacks\" https://addisstandard.com/news-ethiopian-intelligence-says-it-arrests-dozens-of-suspected-al-shabaab-isis-members-planing-to-carry-out-attacks/ … The operation involved foreign security & intelligence apparatus from #USA,#Italy,#France, #Spain,#Djibouti, #Somaliland, & #Puntland", "Mekelle (Giba Dam) water supply development project is being officially inaugurated In the presence of the #Tigray NRS Vice President & China Ambassador to #Ethiopia! A very good news & a much needed intervention! ድሕሪ ነዊሕ ትፅቢት", "BREAKING: Former President Sharif Sheikh Ahmed says current Govt is “headed down the wrong path” says federal Govt leaders are “violating basic rights” of citizens. Ahmed was speaking a day after he was blocked from flying to Kismayo to attend the inauguration of Jubaland leader.", "The Somali govt has suspended all flights to Kismayo in the period between Sept. 23-26, local media. The inauguration of Jubaland leader Ahmed Madobe is on Sept 26. On Sunday the govt blocked former Pres Sharif Sheikh Ahmed from travelling to Kismayo to attend the inauguration.", " a police officer in afar turned down a bribe offer of 40shi birr from illegal gun traffickers, \"40ሺህ ብርና መሳሪያ እንስጥህ አሉኝ፣ የወደፊቱን ኢትዮጵያ ሚጎዳ ነገር ነው ብዬ እምቢ አልኩ\"  #ethiopia deserve guys like this n more!\nhttps://m.facebook.com/story.php?story_fbid=2743143635717495&id=541629952535552 …", "#Ethiopia is growing out of its classic #Peugeot Taxis https://jalopnik.com/ethiopia-is-growing-out-of-its-classic-peugeot-taxis-1838311414?utm_medium=sharefromsite&utm_source=jalopnik_twitter&utm_campaign=sharebar … \"These Peugeots were THE choice for taxi drivers across the country,particularly in the south-eastern city of #Harrar, where dry warm conditions were perfect for keeping the machines in working order.\"", "President Sahle-Work Zewede at the #EnergyActionForum: “Our goal is to move from energy poverty to sustainable energy for all - for Ethiopia & for the continent” @mfaethiopia @Denmark_Addis @addisstandard @Denmark_UN @UNFCCC @PMEthiopia", "As drought compounds security woes, #Somalis flee to #Ethiopia: https://www.unhcr.org/news/stories/2019/9/5d8495984/drought-compounds-security-woes-somalis-flee-ethiopia.html … \"Crop failures, livestock die-offs, and Al-Shabab extortion demands are driving thousands of farmers and pastoralists to abandon their lands and seek refuge.\" via @refugees", "LATEST fresh protests break out in eastern city of Port Said calling for Sisi to step down", "One of many national treasures, the Irreechaa festival is a pillar of the Oromo culture exemplifying thanksgiving. PM Abiy Ahmed & @ShimelisAbdisa met with Aba Gadas and elders this morning to discuss the upcoming Irreechaa festival & other issues.\n\nMore: http://bit.ly/2kLTOQO ", "#Ethiopia: Preparations are underway to celebrate the 14th Nations, Nationalities, and People’s Day (#NNPD) in #AddisAbeba, the House of Federation (HoF) said.\nThis year’s celebration will be hosted by the #Oromia regional state. https://fanabc.com/english/2019/09/preparations-underway-to-celebrate-14th-nnpd-in-addis-ababa/ …", "Update: Businessman Drowns in Hilton Swimming Pool", "Somalia: At a ceremony in Mogadishu on Saturday, President Mohamed Abdullahi Farmajo signs the anti-corruption bill into law, paving the way for the formation of the Independent Ethics and Anti-Corruption Commission.", "#Eritrean government takes over more Church schools  https://www.vaticannews.va/en/africa/news/2019-09/eritrean-government-takes-over-more-church-schools.html#.XYYGsWrkwyx.twitter …\nAlthough Eritrea is a multi-ethnic and multi-religious country, the relationship between state and religion has been a troubled one since the country’s independence in 1991.", "#Ethiopia up coming celebration #Irreecha, a thanksgiving holiday among the ppl of Oromia. They celebrate Irreecha to thank Waaqa (God) for blessings & mercies they have received throughout the previous year & also to welcome the new season of plentiful harvests. @Landoforigins", "#Ethiopia: Minwuyelet Atnafu owner & major shareholder of multiple businesses such as Star Business Group, Abyssinya Bank,& Tana Transport, has passed away. Minwuyelet has had a history of battling criminal charges until the last charges against him & others were dropped in 2013.", "I went to Addis recently, it has become the new Nairobi for #Somalia’s political and business elites, legacy of Monica Juma’s misguided policies towards #Somalia. Somalis feel brotherly towards Ethiopia, despite the old hostility. H.E Uhuru Kenyatta can still revise this trend!", "UPDATE: protests have now spread to all major cities in #Egypt calling for the removal of President Abdel Fattah el-Sisi. Here’s a thread on what we know so far. #ميدان_التحرير", "#Somaliland and #Ethiopia signs a memorandum of understanding related on media development.\n\nSomaliland's minister of information and his counterpart of Ethiopia jointly signed the MoU in Addis Ababa on Thursday.", "#Toronto man who won $10M in lottery dies under mysterious circumstances in #Ethiopia https://www.cbc.ca/news/canada/toronto/toronto-man-lottery-ethiopia-gebru-1.5292361?__vfz=medium%3Dsharebar … Michael Gebru, 41, died under mysterious circumstances in Ethiopia, his cousin  told CBC News.", "News: #Ethiopia, #Denmark to host global meeting tackling #ClimateChange in #NewYork https://addisstandard.com/news-ethiopia-denmark-to-host-global-meeting-tackling-climate-change-in-new-york/ … As an integral part of the Energy Transition Track, Ethiopia, Denmark & SEforALL are hosting the “Energy Action Forum” leading up to the summit in New York on 22 Sep.", "#Ethiopia:Balcha Riba assigned to lead newly established Communication Authority, which is tasked to oversee the restructuring of the telecom market. Balcha has been with telecommunication agency previously & now head of Standard Directorate at Ministry of Innovation & Technology", "#Ethiopia eyes more irrigation projects https://www.press.et/english/?p=12124 … Eth. announced it was planning to increase the number of irrigation projects aiming at alleviating food insecurity. \n\n\"More irrigation projects have been designed to scale up mechanized agriculture...\"Sileshi Bekele", "4 years ago today @Apposit launched an electronic voucher system with @EthiopianATA to facilitate the sale of ag inputs to farmers. To date we've  facilitated  the sale of over 92 million USD of agricultural inputs and outputs with over 385,000 farmers in Ethiopia.", "In a departure from similar events of photo festivals in the past, Capture Addis Photo Festival is open to all residents who want to participate by “submitting pictures they took of Addis Abeba, to express the way they see their city in their own ways.” @captureAddis", "#Ethiopia: Addis to host first of its kind 7-day Photo Festival https://addisstandard.com/art-news-addis-to-host-first-of-its-kind-7-day-photo-festival/ … @captureAddis will host  3 types of photo competitions based on photos captured by the city’s residents & submitted: professionals, regular residents of Addis & the diplomatic community.", "#Sanlam plans to enter #Ethiopia as it seeks to reduce #SouthAfrica dependence https://www.theafricareport.com/17427/sanlam-plans-to-enter-ethiopia-as-it-seeks-to-reduce-south-africa-dependence/ … #Africa’s largest insurer #Sanlam is in “very advanced” discussions with a prospective partner in Ethiopia to take advantage of the country’s economic growth prospects", "#Ethiopia: 497 smuggled handguns seized from oil tanker truck in #BahirDar https://borkena.com/2019/09/18/497-smuggled-handguns-seized-from-oil-tanker-truck-in-bahir-dar/ … \"The report also added that the National Information and Security Agency, and community members tipped the region’s police department about it.\"", "#KenyaAirways stops flying to #Gabon, #Benin (effective October 14, 2019) https://www.standardmedia.co.ke/business/article/2001342566/kenya-airways-stops-flying-to-gabon-benin … Parliament voted in July to renationalise the loss-making airline, which is labouring under a mountain of debt and has had three changes of chief executive in the past five years", "Chinese anti-poverty foundation opens office in #Ethiopia http://www.xinhuanet.com/english/2019-09/19/c_138405219.htm … \"Today, with the setting up of the office,the message is this:in addition to the official support, Chinese civil societies have also joined the campaign to fight shoulder to shoulder...\"Amb.Tan Jian", "The 175km long Bahir Dar-Zema River-Felege Berhan’s concrete road is being inaugurated today. The road is expected to help residents to get access to transport services, enable farmers to supply their products to markets and boost the productivity of BahirDar’s Industrial Park.", "The Bahir Dar – Tis Esat’s 22.3 kms long road construction project has been commenced. The Project is expected to boost the tourism potential of the area, and would enhance the wellbeing of the localities through job creation and income earnings.", "Professionals of the joint -- Smallholder Horticulture Project (SHP) are taking part in a tailor-made training in #Israel, organized by @MASHAVisrael & @IsraelinET. Another milestone of the project to further develop a competitive & sustainable avocado sector in #Ethiopia.", "#Eritrea Should End 18 Years of Darkness https://www.hrw.org/news/2019/09/18/eritrea-should-end-18-years-darkness …\n11 high ranking government officials & 10 journalists. \n \n\"Only one of the 21 people arrested has ever been seen again; reliable, yet unconfirmed, reports suggest at least 10 may have died while in detention.\"", "Professor Fetien Abay is a leader in gender-responsive plant breeding in Ethiopia. And as In-country Coordinator for PHLIL-Ethiopia, she is actively working to improve post-harvest practices and reduce losses. #herimpact #endhunger", "Vice President of Somaliland @VPsomaliland travelled to Kuwait and the UAE.\n\nIn his departure statement the Vice President said Somaliland & UAE are close friends & strong allies. We work together to promote regional peace, security & economic prosperity in the region", "#Egyptian tuk-tuk start-up Halan to expand to #Ethiopia https://reut.rs/2V5jqFU “#Adama is a very small place in Ethiopia...& it has a lot of two-wheelers & three-wheelers. It’s a great place to test our product...We’ve already done tens of rides there,\"Mounir Nakhla, #Halan CEO", "#Djibouti:2nd Meeting Of #IGAD Task Force On The Red Sea & Gulf Of Aden https://www.horndiplomat.com/2019/09/19/djibouti2nd-meeting-of-igad-task-force-on-the-red-sea-and-gulf-of-aden/ … The task force underscored the need for cooperation,inter-alia, in combating illegal unreported & unregulated fishing; pollution & dumping of toxic waste; violent extremism, piracy etc", "Intra-Gulf Competition in #Africa’s Horn:Lessening the Impact https://www.crisisgroup.org/middle-east-north-africa/gulf-and-arabian-peninsula/206-intra-gulf-competition-africas-horn-lessening-impact … For political,economic & ideological reasons,#SaudiArabia, the United Arab Emirates,  #UAE,#Qatar & #Turkey are locked in a push-pull to set the rules for a Middle Eastern region long in turmoil", "Thank you everyone I'm very humbled. But once again, I am humbled from the safety of Ethiopia, while those who aided me risk danger & remain anonymous. As for the full story...it will be published on @AddisStandard soon via the website http://AddisStandard.com .", "#HappeningNow just signed a USD3.6 million grant agreement w/ Sweden & @MoF_Ethiopia to provide timely & strategic support 2 #Ethiopia on core #governance and #peace building issues. UNDP will work tirelessly w/ longstanding partners like Sweden 2 support democracy & peace in ET.", "Exceptionnal moment today with jazz legend Mulatu Astatke @MulatuAstatke1 who was awarded the national order of the Arts and Letters by French Minister of Culture @franckriester for his contribution to world culture and music history. Mulatu is revered by many in France.", "Mr. Prime Minister @AbiyAhmedAli \n\nI am looking forward to hearing from your office about the progress made to renovate the Obelisks of Axum. \n\nEveryone please use the #SaveAxumObelisks hashtag while requesting. This should def trend in #Ethiopia\n#SaveAxumObelisks @PMEthiopia", "Denmark and Ethiopia have cooperated towards sustainable wind power since 2017 #ETHwind. Next week, we bring our experiences and ambition to the world at the @UNClimateSummit.\nWe have the solutions – we just need action!\n#BiggestNoBrainer", "#Tunisian autocrat Zine El Abidine Ben Ali dies at 83 https://www.middleeasteye.net/news/tunisian-autocrat-zine-el-abidine-ben-ali-dies-83 … Ben Ali died in #SaudiArabia at the age of 83, several days after reports emerged on 13 September that he had been hospitalised in #Riyadh and was in critical condition.", "Women In Leadership: A Q& A with President @SahleWorkZewde https://deliverforgood.org/women-in-leadership-qa-with-president-sahle-work-zewde/ … \"The health of girls and women is directly linked to and imperative to achieving our development goals. This understanding is changing the priorities of many countries including #Ethiopia.\"", "Ethiopia Delivers Message on the 63rd General Conference of the IAEA,  Vienna,  Austria", "Unlocking Somaliland.\nOn the southern coast of the Gulf of Aden,sits Somaliland’s Berbera port. It occupies a strategic position in the Horn of Africa and lies on a busy shipping route for traffic to and from the Middle East and Eastern Africa @DP_World @addisstandard @nytimes", "Analysis: Family members arrested for planning child marriage for 15-year-old girl in #Ethiopia https://addisstandard.com/analysis-family-members-arrested-for-planning-child-marriage-for-15-year-old-girl-in-ethiopia/ … “We've registered good results in the fight against harmful practices, & promoting institutional delivery (at a health center)& a savings culture among women.\"", "EPHI is evaluating the last year’s joint plan with regional & city administrations health bureaus & will come up with joint plan for the 2012 EC. A discussion was held on the draft joint plan focusing on Laboratory Capacity Building, PHEM & Research and Technology Transfer.", "Muruts Beyene:Living in the #Ethiopia-#Eritrea Borderland https://aje.io/e7s2g  Muruts' Irob community is a minority ethnic group of about 30,000 people.Already small in number,a redefined border would mean that some of their tiny population would be split between two countries", "#UAE police campaign to crack down on illegal money transfer https://www.khaleejtimes.com/news/crime-and-courts/new-uae-police-campaign-to-crack-down-on-illegal-money-transfer- … The move comes after the recent arrest of five #Asian managers of mobile shops who allegedly transferred funds to countries like #India, #Pakistan, #Bangladesh, #Ethiopia & #Sudan without license", "#Ethiopia a kilo of creamy Tigray  (premium) honey is being sold at $125 in Dubai [Mall of the Emirates]. Last I checked a kilo of the same is ~200ETB in Addis. \n\nIf this huge export price difference (2000%) is narrowed by half, it'd greaty improve the livelihood of beekeepers.", "#UAE, #Ethiopia advancing military cooperation https://www.wam.ae/en/details/1395302787759 … Lt. General Hamad Mohammed Thani Al Rumaithi, Chief of Staff of the UAE Armed Forces, has reviewed prospects for advancing military cooperation with Ethiopia at a meeting here with General Adem Mohammed.", "Stopover: #AddisAbeba, gateway to the flavours of #Ethiopia https://dailymaverick.co.za/article/2019-09-18-stopover-addis-ababa-gateway-to-the-flavours-of-ethiopia/ … Expect to be surprised by the stark contrast between skyscrapers and informal traders, or the pursuit of the latest fashions alongside the observance of ancient customs.", "Developing the tourism sector is one of the pillars of job creation and attracting investments for the Government of #Ethiopia. Preservation of heritage sites is therefore one of key priority areas in the sector. 1/5", "Jubaland alleges that Federal govt is plotting an “invasion and aggression” to destabilise Kismayo. Statement also says flight restrictions worsened humanitarian situation. Fed Govt ordered last month that int’l and local flights going to and from Kismayo to stopover at Mogadishu", "Great news to those who struggle to understand the course of cancer and couldn't find meaning out of the protracted and challenging journey. \n\nA descriptive reference book about the overview of cancer & its treatment options, written with simple Amharic, is inaugurated today.", "and e) #Ethiopia will forfeit its rights to equitable and reasonable utilization of the Blue Nile water resources. #GERD #Egypt", "of GERD indefinitely b)GERD will primarily be there to compensate for Egyptian water deficit, serving as second backup reservoir to HAD; c) GERD will not deliver its economic return to Ethiopia; d) The proposed Permanent coordination Mechanism infringes on Ethiopia’s sovereignty;", "“The request by Egypt is not practical and, therefore, Ethiopia outright rejects it,” the document obtained by AS reads & concluded that when all the elements of the Egyptian proposal are considered in aggregate, the commutative effect will result in: a) Prolong the filing...", "News: #Ethiopia \"outright rejects\" #Egypt's proposal on the filling,operation of grand dam https://addisstandard.com/news-ethiopia-outright-rejects-egypts-proposal-on-the-fillingoperation-of-grand-dam/ … A classified document obtained by AS discussing #Ethiopia’s position on the demands made by #Egypt provided reasons for its outright rejection on various bases.#GERD", "#French Minister of Culture, Franck Riester, has officially launched renovation project of the rock-hewn churches of #Lalibela,one of the #UNESCO World Heritage sites in #Ethiopia. French Gov't will provide the funding and technical support for the project https://fanabc.com/english/2019/09/french-culture-minister-launches-lalibela-renovation-project/ …", "Fire at school outside #Liberia's capital kills at least 27 https://apnews.com/f77ad68ce3174479accfb618f62896eb … The fire around midnight gutted a dormitory and school building where students slept about 7 miles (11 kilometers) east of Monrovia, police spokesman Moses Carter said.", "#Senegal to offer free breast, cervical cancer treatment https://www.theeastafrican.co.ke/scienceandhealth/Senegal-to-offer-free-breast-cancer-treatment/3073694-5277562-txtaxwz/index.html … \"Senegal's government says that women suffering from breast or cervical cancer will be offered free chemotherapy in public hospitals from the beginning of October.\"", "The upcoming #Sidama referendum should trigger a much-needed  conversation on a complementary #ethnic and #Ethiopian identity.\n\nMy latest for  @AJEnglish\n@addisstandard @Int_IDEA @SumitBisarya @addis_fortune\n@Haimanotwua @tselemma\nhttps://aje.io/8rl8u ", "In the early 1950s the Ethiopian Emperor, Haile Selassie, sent thousands of #Ethiopian troops to fight in the #Korean war. They were called the #Kagnew Battalions & they formed part of the American-led UN force supporting #SouthKorea", "Did you know the health benefits of adding leaves of common rue to your coffee as traditionally done in Ethiopia? Common rue plant is antibacterial, antiviral, anti-inflammatory and anti-oxidant! \n\n#WellnessWednesday #EUinEthiopia", "For too long we have perpetuated subsistence agriculture by not treating farmers as business people. They're the most important economic actors in any value chain & respond well to market solutions. Regrettably, many development projects may say this but not designed accordingly.", "#SouthSudan May Plunge Back Into Full-Scale Conflict,#UN Warns https://news.yahoo.com/south-sudan-may-plunge-back-061145277.html … Both armed opposition groups & the gov't are forcibly recruiting children in Juba and Western Bahr el Ghazal, and in Greater Bahr el Ghazal, according to UN Human Rights Commission for S. Sudan", "#Israel: Benjamin Netanyahu’s gamble to hold elections for a second time this year collapsed in a stunning deadlock https://www.bloomberg.com/news/articles/2019-09-18/stunning-election-deadlock-leaves-netanyahu-israel-unmoored … “The results here are less good for him than in April; and in April he didn’t make a government,” Simon Davies.", "Alternative education for #HIV-positive children in Ethiopia https://p.dw.com/p/3OnQT?maca=en-Twitter-sharing … It is difficult to gauge the current prevalence of HIV in , especially since testing campaigns have had issues with data collection. But as per UNAIDS, 690 000 ppl were living with HIV in 2018", "#Ethiopia:Despite government directive issued in Sep.2017 banning the use of high-powered V8 & Prado 4 cylinder vehicles in urban areas by high-level officials, officials continued violating the directive. In fact some use more than one luxury vehicles https://www.press.et/Ama/?p=18196&fbclid=IwAR3jkGW0x-dzYjqPXKMA1182RxS7-_O4hn3aJT1ed8NZDb0E5BQOvuDh8pc …", "#Kenya: Sh47m Equity cash robbery probe extends to #Ethiopia https://www.businessdailyafrica.com/news/Sh47m-Equity-cash-robbery-probe-extends-to-Ethiopia/539546-5277120-14k1yue/index.html … \"Search for Sh47 million stolen from Equity Bank during last week’s plane heist at Odda Airstrip in #Moyale, #Marsabit, is expected to extend to Ethiopia.\" via @BD_Africa", "Young Africans’ Dreams Are Focus of #Kenya,#Ethiopia, #Uganda Oscar Picks https://variety.com/2019/film/news/kenya-uganda-ethiopia-oscar-selections-kony-order-from-above-subira-1203338945/#utm_medium=social&utm_source=twitter&utm_campaign=social_bar&utm_content=bottom&utm_id=1203338945 … \"Ethiopia has chosen Jan Philipp Weyl’s “Running Against the Wind,”the story of two brothers whose lives take very different paths when they decide to follow their dreams...\"@variety", "Two #Nigerian men have lost their lives after they swallowed hard substances during a flight from #Brazil to #Ethiopia.\n\nhttps://sabiupdates.com/two-nigerian-men-die-after-drug-they-swallowed-burst-open-in-their-stomach-during-a-flight/ …", "#SouthAfrica apologises to #Nigeria over #xenophobic attacks https://www.bbc.com/news/world-africa-49726041 … Nigeria has been outspoken in its condemnation of the violence. A fortnight ago, it withdrew a delegation from a major international conference taking place in South Africa.", "Recycling old tyres to make sandals in #Ethiopia https://www.bbc.com/news/av/world-africa-49728171/recycling-old-tyres-to-make-sandals-in-ethiopia …\nCobblers in Ethiopia's southern region are making shoes and sandals in a unique way... by recycling used tyres.", "Colonel Belay of the ENDF is a welcome visitor today. He's soon off on a UK Defence Academy course for Defence Staff College instructors. Bring back some ! Our partnership goes from strength to strength  #Ethiopia @UKinEthiopia @JSCSCShrivenham #trustedpartners @DefenceHQ", "Boosting mental health capacity in #Ethiopia https://www.hsph.harvard.edu/news/features/boosting-mental-health-capacity-in-ethiopia/ … For his lifelong contributions to the field of mental health,Atalay Alem, a professor of psychiatry at Addis Abeba University,was honored with the annual Harvard Award in Psychiatric Epidemiology & Biostatistics", "#Ethiopia:10 people killed & 5 injured at a wedding ceremony in Goro Gutu wereda,E.#Hararghe,#Oromia region, after they were run over by an Isuzu truck last night. The wedding goers were walking from the groom's house to the bride's house. Police are searching for the driver. FBC", "Update: This was after another killing of two civilians in Kellem #Wellega zone Gidami town on Sep.14. Eye witnesses said they were killed by members of fed defense force, but authorities deny & say a preceding bomb attack blur the facts about the culprits", "#Ethiopia: Abebe Tekalign, Mayor of #Guliso town, West #Wollega zone,#Oromia region, was gunned down by armed men in civilian clothes inside his home, Tesfa Likasa, the zone's security head said. He was killed on Sep.15 & his killing is being investigated  https://www.bbc.com/afaanoromoo/oduu-49724411 …", "Two 'killed in exchange of fire' on Satur. night in Gidami town of #Kellem zone after 'unknown men  opened fire & thrown a grenade at security forces', official says.\n\nResidents accuse both deployed forces & armed group who are active in the area. #Ethiopa", "AMISOM Commander visits #Djibouti & #Ethiopian forces on assessment mission\nhttp://amisom-au.org/2019/09/amisom-commander-visits-djibouti-and-ethiopian-forces-on-assessment-mission/ …\nGen. Lakara reminded the military commanders, led by Col. Mohamed Ibrahim Moussa; his deputy Col. Teklebirhan Hailu...of the need to adhere to the timelines in accomplishing tasks", "#Egypt & #Ethiopia at odds as talks over Blue Nile dam... https://reut.rs/30356n2  The comments in a note circulated to diplomats last week show the gap b/n the two countries on a project seen as an existential threat by Egypt,which gets around 90% of its fresh water from the Nile", "#Japan's #Itochu confirms support for #Ethiopia garment sector - http://just-style.com ", "Ethiopian flag proudly flying against an intensely blue sky in Stockholm!", "#Ethiopia-#Tigray: A 17-year-old-girl's hope for a better life turns into a frightening journey https://shar.es/aXxrao  “Seeing her again was like a miracle. We gave everything we had to the smugglers; we have nothing left. However, I am happy to get my daughter back.” #Migration", "Today, HE Dr. Frehiwot Woldahanna, State Minister for the Energy Sector presented #Ethiopia’s long-term Energy Sector Development Strategy. Huge tasks ahead as generation must expand from 4.3GW to 31.4GW supplying 24.3 million households by 2030 #EnergyTransition #SDG7 #SDG13", "ACWA’s ‘record’ bid wins 250MW Scaling Solar duo in #Ethiopia https://www.pv-tech.org/news/acwa-power-bags-250mw-project-duo-in-ethiopia#.XYCHJ4FRXHI.twitter … The Gad and Dicheto projects are planned for the eastern regional states of #Somali and #Afar, and are part of a six-project portfolio that make up round two of Ethiopia’s Scaling Solar program.", "#Ethiopia:Former PM Hailemariam Dessalegn & his wife Roman Tesfaye held discussions with #Wolaita community& shared their experiences in life & d/t responsibilities. \"We also have given guidance & counseling on their aspiration to see advanced #Wolaita, #Ethiopia & beyond,\"Roman", "#Ethiopia are you an entrepreneur working on innovative #agritech, #biotech #mine tech, #nanotech? If so, Impulse, accelerator program for #Africa, is the event for you. Sheraton Addis at 5:00pm. Confirm impulsebyocpafrica@gmail.com", "Pleased to have met #ONLF officials today in Addis office led by Hasan Moalin and Khalsia Ugas.\nI congratulated them on the bold decision to negotiate a peaceful settlement and end the war.\nWe discussed the return of the displaced in many parts of the Horn in refugee camps.", "The U.S. Embassy strongly condemns the violence perpetrated against humanitarian aid workers in Gambella on September 5, 2019, which resulted in the deaths of two staff members of Action Against Hunger, a non-governmental organization.", "#Lebanese man leaves #Ethiopia after seven-day disappearance https://www.thenational.ae/world/mena/lebanese-man-leaves-ethiopia-after-seven-day-disappearance-1.910557 … “Hassan Jaber was asked to step aside after he showed his plane ticket to board a bus to the plane.His relatives lost sight of him after they got on the bus. There was an information blackout...\"", "In #Ethiopia, busted VW #Beetles 'pimped out' for hip youth https://sg.news.yahoo.com/ethiopia-busted-vw-beetles-pimped-hip-youth-031213092.html?soc_src=social-sh&soc_trk=tw …  \"...these days, a younger generation of drivers - some of them inspired by shows like the old MTV hit \"Pimp My Ride\" - are investing large sums to give their Beetles a 21st-century upgrade.\"", "Foreign Minister Gedu Andargachew held talks with Turkish Amb. Yaprak Alp on enhancing Turkish inv't to #Ethiopia. Turkey has recently designated Ethiopia as one of the ten target countries for it's inv't.", "During his visit @franckriester will meet with high level government officials & with the #Lalibela and National Palace projects’ stakeholders. He will also inaugurate the exhibition: “20 years of Ethiopian contemporary painting” at the Alliance Ethio-Française of Addis-Abeba.", "News: #France to bestow the French National Order of Arts and Letters on Mulatu Astatke https://addisstandard.com/news-france-to-bestow-the-french-national-order-of-arts-and-letters-on-mulatu-astatke/ … This will be done during the visit of French Minister of Culture, Franck Riester in #Ethiopia on the 18th and 19th of September", "Held resource mobilization meeting for the establishment of center of excellence for Cancer in #AddisAbaba for IGAD region. Ethiopia has a strong political commitment to make the center a reality by allocating resource and land. @PMEthiopia @igadsecretariat @amb_mahboub"]}