{"tweets": ["It was a pleasure to speak today with Ethiopian Prime Minister Dr. Abiy Ahmed to congratulate him on receiving the Nobel Peace Prize. We discussed our strong relationship and the importance of ensuring a sustainable peace agreement in #SouthSudan.", "Ethiopia , top troop contributing country to @UNPeacekeeping, is an important partner in the implementation of the #A4P initiative. Whether it is as part of @UNISFA_1, @unamidnews or @unmissmedia, Ethiopian troops greatly contribute to the implementation of our mandates.", "#Ethiopia: Ethiopian Prime Minister Dr. Abiy Ahmed is holding peace conference in Ambo town with residents of Ambo town, West Shewa Zone, South West Shewa Zone, Burayyu town, Holata and Weliso towns.", "Our Embassy is honored to do all we can to facilitate the extraordinary work of Save a Child’s Heart & Children Cardiac Center of #Ethiopia. It gives me great pleasure to work with people who have a heart of gold doing their best to save little hearts in Ethiopia. Thank you! https://twitter.com/fitsumaregaa/status/1183845096371998721 …", "#Ethiopia has completed the preparation of a draft Foreign Policy proclamation, which will replace the country’s Foreign Policy that was on work for the last 18 years.", "#Egypt agrees to solve issues related to Grand Ethiopian Renaissance Dam through negotiation with #Ethiopia.", "#Ethiopia: Ethiopian Prime Minister Dr. Abiy Ahmed meets Egyptian President Abdel Fattah el-Sisi on sidelines of #Russia- #Africa summit. #Egypt", "#Ethiopia and #Russia sign agreement on cooperation in peaceful use of nuclear energy.", "#Ethiopia: Ethiopian Prime Minister Dr. Abiy Ahmed meets Russian President Vladimir Putin on sidelines of #Russia- #Africa summit.", "PM Abiy Ahmed met with members of the Security Council at the Office of the Prime Minister to discuss regional peace and security issues. The members of the Security Council congratulated PM Abiy for his Nobel Peace Prize award and requested his inputs for regional peace. 1/2", "#Ethiopia: “Ethiopian Government has no intention to hurt either Sudan or Egypt with its Grand Renaissance Dam, the benefit that Ethiopia obtains from the dam will also benefits Egypt”- Prime Minister Dr.  Abiy Ahmed", "“Ethiopia gives priority to neighboring countries in its foreign relations, but not in its domestic affairs”- Prime Minister Dr. Abiy Ahmed", "“ኢትዮጵያ ለጎረቤት አገራት  ቅድሚያ የሚትሰጠው በውጭ ጉዳይ እንጂ  በኢትዮጵያ የውስጥ ጉዳይ አይደለም”- ጠቅላይ ሚኒስትር ዶ/ር ዐቢይ አህመድ ከፓርላማ አባላት ለተነሱላቸው ጥያቄዎች ከሰጡት ምላሽ የተወሰደ", "\"በውግያ ነው ችግር የሚፈታው ብለው የሚያምኑ አመራሮች ሞተው ማሳየት ነው እንጂ የደሃ ልጆቸን ማስገደል የለባቸውም፤ ችግር የሚፈጥር አስተሳሰብ በክላሽ መፍትሔ አመጣለሁ ብሎ የሚያስብ ነው\" - ጠቅላይ ሚኒስትር ዐቢይ አህመድ", "Some of the glimse show of the lauching ceremony ‘Medemer’ book in Addis Ababa, Mellinum Hall , today October 19,2019.#Medemer #Ethiopia.", "#Ethiopia: The long awaited book by PM  @AbiyAhmedAli ‘Medemer’ is being launched today Oct 19, 2019 at the Millennium Hall with over 8000 Ethiopians from all parts of the country in attendance. Moreover, the book l also being launched in over 30 other cities nationwide.#Medemer.", "Ethiopia’s tourism sector carries great potential in generating revenue & creating job opportunities. As one of the priority areas, investments & innovations in the sector are key. \n\nWatch: Yesterday and Today: Generational Legacy - http://bit.ly/2BkhlNg \n#PMOEthiopia", "Leadership of ODP celebrated Prime Minister Abiy Ahmed earlier today at the Office of the Prime Minister for his Nobel Peace Prize recognition.\n\n#NobelPeacePrize", "Ethiopian Prime Minister Ahmed invited Prime Minister Netanyahu to make an official visit to Ethiopia.", "PM Netanyahu spoke with Ethiopian PM Abiy Ahmed and congratulated him on winning the Nobel Peace Prize. The Ethiopian PM told Netanyahu that he was impressed by his visit to Israel [last month] and that he admires the developments that have taken place in Israel in recent years.", "We went out as a country for a green #Ethiopia, planting throughout the rainy season. The season of caretaking has begun with PM Abiy returning to the Lideta site to water the seedlings he planted a few months ago. We call upon all to nurture seedlings planted.\n\n#PMOEthiopia", "#Ethiopia: Ethiopia’s Federal Attorney General says, it is finalizing the preparation of a draft law believed to curb human trafficking.  According to the draft law, people involved in act may be punished with death penalty.", "#Ethiopia: Prime Minister Abiy Ahmed met with President Sauli Niinistö of Finland and his delegation earlier today. The President expressed his congratulatory message to Prime Minister Abiy for his Nobel Peace Prize win. #PMOEthiopia", "Delighted to attend the 2019 Health sector Annual Review. Under the leadership of Minister @amirabiy an ambitious strategy towards enhanced multisectoral collaboration for a healthy and prosperous #Ethiopia is being set out.", "#Ethiopia: Ethiopian Prime Minister Dr. Abiy Ahmed arrived in #Juba, #South Sudan to take part in IGAD meeting aimed at reconciling  the Sudanese Transitional government and armed groups.", "My warmest congratulations to my great friend and courageous statesman @AbiyAhmedAli. The #NobelPeace Prize is the acknowledgement of his strong leadership in transforming into action the desire for peace of the people of an entire region. Abiy:  Italy is and will be at your side", "Heartfelt congratulations to @PMEthiopia @AbiyAhmedAli who champions peace and reconciliation, inclusion, gender equality and protecting the environment. The @UN looks forward to accompanying you on these vital efforts #ForPeopleForPlanet\n#NobelPeacePrize https://twitter.com/antonioguterres/status/1182593451201712129 …", "የዓለም ጤና ድርጅት ዋና ዳይሬክተር ዶ/ር ቴድሮስ ጠ/ሚ ዐቢይ የኖቤል የሰላም ተሸላሚ በመሆናቸው ባስተላለፉት መልዕክት ጠቅላይ ሚኒስትሩ ከኤርትራ ጋር ሰላም እንዲኖር አድርገዋል ብለዋል፡፡\n ዶ/ር ቴድሮስ ኢትዮጵያዊ በመሆኔ ኩራት ይሰማኛል ብለዋል", "I am humbled by the decision of the Norwegian Nobel Committee. My deepest gratitude to all committed and working for peace. This award is for Ethiopia and the African continent. We shall prosper in peace!", "Wise words from our new Peace Laureate, Abiy Ahmed Ali.", "Congratulations to Prime Minister @AbiyAhmedAli, winner of the 2019 Nobel Peace Prize, and to all people working for reconciliation between Ethiopia and Eritrea.", "Congratulations to my brother & friend Prime Minister @AbiyAhmedAli, 2019 Nobel Peace Prize Laureate. Well deserved! Your remarkable commitment to Ethiopian unity, as well as regional peace and cooperation, are an inspiration to many in Africa.", "Joint Communique Issued at the end of the Official Visit of H.E. Abdallah Hamdok, Prime Minister of the Republic of the Sudan to the Federal Democratic Republic of Ethiopia.\n\n#PMOEthiopia", "President Uhuru Kenyatta has sent a congratulatory message to Prime Minister Abiy Ahmed of Ethiopia for being awarded the 2019 Nobel Peace Prize.\n\nhttp://www.president.go.ke/2019/10/11/president-kenyatta-congratulates-ethiopian-pm-abiy-ahmed-for-nobel-peace-prize-award/ …", "I sincerely congratulate @PMEthiopia H.E Abiy Ahmed Ali on his @NobelPrize success this year. He is a deserving winner and I have enjoyed working with him on strengthening regional cooperation.\n\nCongratulations PM Abiy.", "My sincere congratulations to my dear friend Dr Abiy Ahmed @PMEthiopia on winning the #NobelPeacePrize. He is a wise man who has brought peace and hope to his country and region. The prize is a well-deserved honour for an extraordinary leader.", "ጓደኛዬ ጠቅላይ ሚንስትር ዐቢይ አሕመድ የኖቤል የሰላም ሽልማትን በማሸነፉ የተሰማኝን ደስታና ጥልቅ ስሜት ለመግለፅ እወዳለሁ፡፡ ጠቅላይ ሚንስትሩ ለቀጠናው ላመጣው ሰላምና ተስፋ ሽልማቱ  ይገባዋል፡፡ @AbiyAhmedAli", "“ጠቅላይ ሚኒስትራችን  ዐቢይ  የ2019 የኖበል ሠላም ሽልማትን ስላገኙ እንኳን ደስ አለዎት፣ እንኳን ደስ አለሽ እናት አገር ኢትዮጵያ፣ በአገራችንና  በዓለም ዙርያ የምትኖሩ የኢትዮጵያ ልጆች ሁሉ እንኳን ደስ አላችሁ ” ፕሬዝዳንት ሳህለወርቅ ዘውዴ", "#UN Chief Antonio Guterres congratulates Prime Minister Abiy Ahmed  for being awarded the Nobel Peace Prize. \n\n\"His vision helped #Ethiopia and #Eritrea achieve a historic rapprochement & his leadership has set a wonderful example for others in & beyond Africa\", Guterres said.", "The 2019 Nobel Peace Prize is also meant to recognise all the stakeholders working for peace and reconciliation in Ethiopia and in the East and Northeast African regions.\n\n#NobelPrize #NobelPeacePrize", "In close cooperation with Isaias Afwerki, the President of Eritrea, this year’s Peace Laureate Abiy Ahmed quickly worked out the principles of a peace agreement to end the long “no peace, no war” stalemate between Ethiopia and Eritrea.\n\n#NobelPrize #NobelPeacePrize", "In Ethiopia, even if much work remains, Peace Laureate Abiy Ahmed has initiated important reforms that give many citizens hope for a better life and a brighter future. As Prime Minister, Abiy Ahmed has sought to promote reconciliation, solidarity and social justice.\n\n#NobelPrize", "The Norwegian Nobel Committee believes it is now that Abiy Ahmed’s efforts deserve recognition and need encouragement. The committee hopes that the 2019 #NobelPeacePrize will strengthen Prime Minister Abiy in his important work for peace and reconciliation.\n\n#NobelPrize", "Congratulations to PM @AbiyAhmedAli who has been awarded the 2019 Nobel Peace Prize. #NobelPeacePrize #Ethiopia", "Congratulations!!!\nEthiopian PM wins the Nobel Peace Prize 2019.", "Warm congratulations on behalf of the European Union Delegation in Ethiopia to H.E. Prime Minister @AbiyAhmedAli @PMEthiopia for having been awarded the #NobelPrize2019 #NobelPeacePrize for his efforts to achieve peace and international cooperation", "#Ethiopia #AbiyAhmed #Peaceprize #Nobelpeaceprize", "#Ethiopia: Ethiopia's Prime Minister Dr. Abiy Ahmed wins 2019 Nobel Peace Prize", "PM @AbiyAhmedAli welcomed Presidents @KagutaMuseveni, Uhuru Kenyatta, Salva Kiir, @M_Farmaajo, PM Abdalla Hamdok & Nabil Mohamed Ahmed, Head of Delegation of the Republic of Djibouti. All are visiting Ethiopia for inauguration of Unity Park. 1/2\n\n#PMOEthiopia\n#የትዉልድአሻራ", "Good Morning Ethiopia. Today marks the inauguration of ‘Unity Park’ which is a manifestation of the MEDEMER idea, inviting us to takes stock of our positive capital from the past (our historical and cultural assets) and build upon it for future generations. 1/2", "Irrechaa, Oromo Thanks Giving Day celebration at Addis Ababa, Hora Finfinne (in Pictures)", "#Ethiopia: A priceless 18th-century Ethiopian crown is set to be returned from the Netherlands to Addis Ababa after a one-time refugee found it in a suitcase and hid it in his apartment for two decades.\nhttps://news.yahoo.com/hidden-21-years-ethiopian-crown-set-return-home-054141584.html …", "የታደሰዉ ቤተመንግስት ከመስከረም 30 ጀምሮ ለጉብኝት ክፍት ይሆናል።\n\n#የትዉልድአሻራ\n#PMOEthiopia", "Since 2007, the U.S. Government has invested more than 442 million U.S. dollars through @PMIgov to help Ethiopia’s malaria control efforts. https://bit.ly/2nGSFvc  #USInvestsInEthiopians #ZeroMalaria", "#Ethiopia: Yesterday @UNmigration\n assisted 92 #Ethiopians, stranded in #Yemen, to safely return back home. Of these, 50 are adults (22 Men, 28 Female) and 42 are minors. #IOMEthiopia", "#Ethiopia: Oromo Political parties have signed an  agreement to work together, and vowed to play a role in  making the coming Ethiopian election free, fair and democratic.", "#Ethiopia: Prime Minister Abiy Ahmed launched the ‘Beautifying Sheger’  project to be built by the Chinese construction giant CCCC. In his remarks at the launch event, he thanked the Government of China for the continued support. #PMOEthiopia", "#Ethiopia: Prime Minister Abiy Ahmed received the special envoy of South Sudan’s President Salva Kiir earlier today with a message from the South Sudan President and to discuss key bilateral and regional issues.\n#PMOEthiopia", "#Ethiopia: The World Tourism Forum President Bulut Bağcı presented the 2019 World Tourism Award to Prime Minister Abiy Ahmed for his commitment to promoting tourism. \n#PMOEthiopia", "#Ethiopia: The first batch of the Ethiopian athletics team that will compete in the 17th IAAF World Athletics Championships arrived in Doha, Qatar.", "In his opening statement Dr Shambhu Acharya, @acharyas1, said \"Strategic policy dialogue is a critical tool to advancing health and wellbeing, and WHO is uniquely placed to engage at this strategic level with governments\" #WHOSRHRPolicyDialogueTraining.", "\"Sexual and reproductive health and rights are fundamental to people's health and survival, to economic development, and to the wellbeing of humanity.\" said Dr Boureima HAMA SAMBO, @DrBoureima speaking in the #WHOSRHRPolicyDialogueTraining.", "A strategic policy dialogue on Sexual and Reproductive Health and Rights (SRHR) where 15 countries will take part commenced today in Addis Ababa, #Ethiopia. #WHOSRHRPolicyDialogueTraining", "የሆራ ፊንፊኔ የኢሬቻ በዓልን ምክንያት በማድረግ የተዘጋጀው ኤግዚቢሽንና ባዛር ዛሬ በአዲስ አበባ የኦሮሞ ባህል ማዕከል ተከፍቷል፡፡", "The  Embassy together with the  Min of Innovation & Tech & @UNDPEthiopia launched today, the Innovation for Development Workshop in Addis. Israeli experts will present their experience in innovation & discuss the opportunities for developing the innovation ecosystem in .", "President @SahleWorkZewde held a bilateral meeting with \n@UNSGeneral @antonioguterresat #UNGA74. The SG reaffirmed his appreciation for the reforms in #Ethiopia and PM Abiy Ahmed Ali's mediation in the Sudan, emphasizing the need to pursue the same with S. Sudan. #Ethipia@UN", "At #ClimateActionSummit today, President Sahle-Work\nZewede announced a major coalition initiative that #Ethiopia was leading on Energy Access, shared #Ethiopia’s success in planting world record, over 350 million, trees in a day. @mfaethiopia @TayeAtske @PMEthiopia @addisstandard", "#Somalia's President  Mohamed Abdullahi Mohamed receives Concordia Leadership Award in US. \nHe shared the award with #Ethiopian Prime Minister Abiy Ahmed and #Eritrean President Isaias Afwerki for their role in promoting peace and economic integration in the Horn of Africa.", "The Hessian Peace Prize  awarded to the Prime Minister of #Ethiopia, Dr. Abiy Ahmed Ali, today September 23,  2019. Ethiopian Minister of Peace Mufariat Kamil received the award on behalf of the Prime Minister.", "Foreign Minister Gedu Andargachew Delivers Opening Remarks at the Energy Action Forum https://ethiopianembassy.be/2019/09/23/foreign-minister-gedu-andargachew-delivers-opening-remarks-at-the-energy-action-forum/ …", "Irreechaa peace race (In Pictures)", "#Ethiopia: Prime Minister Abiy Ahmed and Vice President of the Oromia region, Shimeles Abdissa met with Abba Gadas and elders this morning to discuss the upcoming Irreechaa festival and other issues. #PMOEthiopia", "#Ethiopia: The EU Delegation in Ethiopia is fighting to mitigate and adapt to climate change. The EU contributes with 36 million Euro (1.15 billion Birr) to make Ethiopia's economy grow greener. #EUinEthiopia", "Denmark and Ethiopia have cooperated towards sustainable wind power since 2017 #ETHwind. Next week, we bring our experiences and ambition to the world at the @UNClimateSummit.\nWe have the solutions – we just need action!\n#BiggestNoBrainer", "While studies to determine restoration needs are nearing completion for the Jubilee Palace, the technical work is expected to begin in a few months towards readying the Palace for tourism. 5/5\n\n#PMOEthiopia", "Mr. Riester expressed his visit as a commitment of the President Macron to the preservation of heritage important to both countries, and to sharing technical expertise and skills. 4/5", "Noting the strengthened relations between the two countries PM Abiy recounted the immense support of President @EmmanuelMacron and encouraged expediting the restoration works. 3/5", "PM Abiy Ahmed met with the Minister of Culture of the French Republic, Franck Riester this morning to discuss progress on the restoration work of the Rock Hewn Churches of Lalibela and the Jubilee Palace, currently being supported by France. 2/5", "Developing the tourism sector is one of the pillars of job creation and attracting investments for the Government of #Ethiopia. Preservation of heritage sites is therefore one of key priority areas in the sector. 1/5", "The #UK is working in partnership with #Ethiopia to provide support across key sectors including #aviation, #construction, #water & #energy. Post her recent trip to Addis, Her Majesty’s Trade Commissioner for Africa @ewadesmith discusses opportunities to work together,", "PM Abiy Ahmed met with representatives of the Ethiopian Islamic Affairs Supreme Council and Ethiopian Muslim Arbitration Committee today. The members expressed their desire to engage in cleaning ahead of the Meskel celebration, to honour their fellow Orthodox Christians. \n\n#PMO", "Mexico celebrates 109th Independence Day and 70 yrs. of diplomatic relations b/n #Ethiopia #Mexico. State Minister Dr. Markos @MarkosRike1 &  Amb. Victor @VMTrevino  highlighted the historic relations of the two countries in their statements @EmbaMexEti .", "Ethiopia’s Minister of Foreign Affairs, Gedu Andargachew, today received members of the Standing Committee on Foreign Affairs and Defence of the Parliament of Norway.\nhttps://ethiopianembassy.be/2019/09/16/ethiopias-foreign-minister-receives-norwegian-delegation/ …", "#Ethiopia: Ethiopian Prime Minister Dr. Abiy Ahmed has arrived at Bonga to hold public discussion.", "This week, alongside @DrGete  Deputy Ambassador Alex Cameron launched the next stage in UK technical advice to improve the Government of Ethiopia’s General Education Programme (TARGET).", "#Ethiopia beat all other #EasternAfricancountries last year as the largest recipient of Foreign Direct Investment (FDI), according to a new report authored by financial consulting firm EY.\nhttps://ethiopianembassy.be/2019/09/13/ethiopia-largest-recipient-of-fdi-in-eastern-africa/ …", "The Embassy of Cuba in #AddisAbaba wish all #Ethiopians a happy and joyful new year 2012!. @AngelVillaHdz @VilmaThomasR @mfaethiopia @PMEthiopia @addisstandard @addis_fortune @addistv @DrGetahun @DrGete @Hirut27883484 @demekeMek11 @DrTedros", "የብሪታንያ ኤምባሲ አምባሳደር አልስተር ሚክፌል ለመላው የኢትዮጵያ ህዝብ 2012 ዓ.ም የዘመን መለወጫ በዓልን አስመልክተው መልዕክት አስተላልፈዋል፡፡  \n\nበአማርኛ የሰጡትን የእንኳን አደረሳችሁ መልዕክት እንድትመለከቱ ጋብዘናል\nመልካም አዲስ አመት!", "First Lady Zinash Tayachew has visited the construction progress of Kuskuam Children Care center .\nThe children care center is on the completion stage and will be handover to the Wro Zewde Children care center after landscape work completed soon.", "The UK has enabled over 22,000 households in Ethiopia access to solar home systems. With  $1.5m of UK AID support, D.light designs and manufactures high quality solar home kits of different sizes for a variety of purposes.", "As @UNmigration we support the government of #Ethiopia's development efforts and are attending the High-Level Conference on Ethiopia's Home-grown Economic Reform.\n@PMEthiopia @mfaethiopia @ECA_OFFICIAL", "H.E. President #SahleWorkZewde stated on the closing session of the forum that the next is to be held in Addis Ababa, #Ethiopia in September next year.\nhttps://ethiopianembassy.be/2019/09/08/the-next-world-economic-forum-to-be-held-in-addis-ababa/ …", "#Ethiopia: Ethiopian Ministry of Foreign Affairs Gedu Andargachew leaves for Russia for official work visit.", "The Annual Meeting of Heads of Mission & Higher Officials of the Ministry of Foreign Affairs chaired by Foreign Minister Gedu Andargachew resumed today by conducting  comprehensive discussions with economic stakeholders Investment, Trade, Tourism, Energy, and Social Affairs", "ጠቅላይ ሚኒስትር ዶ/ር ዐቢይ አሕመድ ከኢትዮጵያ ኦርቶዶክስ ተዋሕዶ ቤተ ክርስቲያን ቅዱስ ሲኖዶስ ጋር ተወያዩ", "Things go better when #women are at the table, says #Ethiopia's first female president, Sahle-Work Zewde. Watch the full session here: https://wef.ch/2PEVASd  #af19 @SahleWorkZewde", "Former #Zimbabwe President Robert Mugabe dies, aged 95", "#Ethiopia: The European Union (EU) has provided a € 15 million support to improve the competitiveness of Ethiopia’s coffee sector.", "From today @UNMigration is hosting a group of #SouthAfrican Youth visiting #Ethiopia to gain an understanding of dynamics that inform decision making processes on the continent, particularly on #migration management.\n#Agenda2063\n@AUYouthProgram @auyouthenvoy_ @mfaethiopia", "#Ethiopia: Ethiopian Ministry of Foreign Affairs has condemned the heinous act of violence and looting of properties perpetrated against foreigners including Ethiopian citizens in South Africa.", "Ministry of Foreign Affairs of the Federal Democratic Republic of Ethiopia issues a statement on the Situation of Ethiopian Nationals in South Africa.\nhttps://www.facebook.com/MFAEthiopia/ ", "#Ethiopia: PM Dr. Abiy Ahmed hosted a dinner for more than 1450 young construction workers yesterday evening. The youth who are engaged in the National Palace project have been spending several hours during the day and night, working hard to expedite the project. #PMOEthiopia", "#Ethiopia: President Sahle-Work Zewde has arrived at South Africa to participate on  2019 World Economic Forum for Africa.", "Today @Unmigration staff in #Ethiopia donated 2,160 exercise books to benefit internally displaced #children in the country. Staff responded to the Ministry of Education's call for support, and collected funds required to purchase the books. @UNICEFEthiopia @fdremoe", "Ethiopia National Defense Force troops serving under #AMISOM complete one year long tour of duty. #AMISOM Force Commander, Lt. Gen. Yilma, “You mentored the #SNA for the takeover of the security of their country in line with the Somali Transition Plan.” http://bit.ly/2lTPLSD ", "“I know I have not been able to achieve what I know I am capable of in the marathon, and I have been very discouraged because of the injuries, explains Kenenissa Bekele, Ethiopia's Marathon record holder. His PB of 2:03.03 set in Berlin in 2016 was the 4th fastest marathon ever.", "#Ethiopia: Ethiopian Prime MInister Dr. Abiy Ahmed has visited  Yad Vashem museum in Israel.", "#Ethiopia: Ethiopian Prime Minister Dr. Abiy Ahmed will visit Israel on the coming Sunday.  Israel Prime Minister Benjamin Netanyahu will receive Ethiopian Prime Minister  upon his arrival with a guard of honor at the Prime Minister’s Office in Jerusalem.", "#UKSupportsAU - We are working with @_AfricanUnion to train partner nations in skills to enhance gender parity and prevent sexual based violence in conflict. Gender equality is crucial for peace. #Gender #PSVI @BPST_A", "#Ethiopia: PM Abiy and his delegation held  meetings with development partners to discuss opportunities for investments. They met with Chairman of Japan External Trade Organization (JETRO),  They met  Chairman of the Nippon Foundation. They also met with the President JICA.\n #PMO", "Delighted to help launch the new Peace Building project with partners @CatholicRelief and @Trocaire with the communities of Gedeo and West Guji @Irish_Aid", "Prime Minister Abiy Ahmed visited the Toshiba Energy System Solutions plant and was given a briefing on operations and tour of the steam turbine manufacturing site. PM Abiy made a call to Toshiba to come and invest in #Ethiopia, particularly in geothermal energy.\n\n#PMOEthiopia", "Efforts to reduce #MoneyLaundering are crucial in hindering transnational crime as well as securing continued economic growth in #Ethiopia. Today DK is proud to launch a new phase of our support in strengthening Ethiopia’s capacity to counter money laundering. #dkaid", "#Ethiopia: An Ethiopian man has been sentenced to 4 months in prison for joking about a bomb after boarding a #Kenya Airways flight, Daily Nation reported.", "PM Abiy Ahmed attended the #TICAD7 Special Conference on Peace & Stability in the Horn of Africa with PM Shinzo Abe. In his remarks, PM Abiy shared the region’s progress in peace & stability, calling upon Horn region leaders to invest in intensive jobs creation efforts. 1/2", "Prime Minister Shinzo Abe noted in his opening remarks at the #TICAD7 conference that  peace between Ethiopia & Eritrea is a major breakthrough in heralding normalization in the HoA. @mfaethiopia", "Prime Minister Abiy Ahmed and his delegation are attending the 7th Tokyo International Conference on International Development (TICAD) with other African leaders and development partners.\n\n#PMOEthiopia", "Earlier this year, the UK provided access to clean water and improved sanitation service to over 250,000 people in Welenchiti town, Oromia region. Take a look at the impact this project is having on the local community. \n#WorldWaterWeek2019", "Prime Minister Abiy Ahmed met with the President of the Korea International Cooperation Agency (KOIKA) to discuss further strengthening of the support to #Ethiopia. \n#PMOEthiopia", "Gedeo and Guji key #community leaders and Zonal Attorney Officials convened this weekend (24/8) at a @UNmigration organised meeting in Shashemene, #Ethiopia, to discuss critical peacebuilding efforts. @MoP_Ethiopia", "#Canada will provide $1 million in funding to support the 2020 elections in #Ethiopia. The funding will be provided through the United Nations Development Programme and will be drawn from the $10‑million Promoting and Protecting Democracy Fund.", "The Ethiopian mini Demographic and Health Survey was launched today. It found a positive rise in married women using modern family planning methods, from 35% in 2016 to 41% today.", "Saint Paul Hospital Millennium Medical College is going to donate 180 adult-size manual tricycle wheelchairs for those in need considering their medical condition.\n@SPHMMC_Official @DrSenait @addisstandard @GetachewSS", "Continuing his engagement in South Korea, PM Abiy Ahmed met with Hyundai leadership to discuss the potential expansion of investments in #Ethiopia. 1/2", "A recent support of USD 300mil has been signed under the Korea-Ethiopia Economic Development Cooperation Fund for the 2019-2020 period. 2/2\n\n#PMOEthiopia", "PM Abiy Ahmed met with the President of the EXIM Bank of the Republic of Korea. The parties discussed ongoing and potential new support to #Ethiopia. The EXIM Bank support for currently ongoing projects exceeds 600mil USD. 1/2", "#Ethiopia: PM Dr.  Abiy Ahmed visited the Korea Institute for Science and Technology (KIST) together with his delegation where they were briefed on the contribution of science and technology in building Korea’s strong economy. #PMOEthiopia", "UNHCR donates 150 blankets and 100 jerry cans to Bule Hora referral hospital \n\nThe hospital services an increased number of people in the area, both the local community and returnees, and the assistance from @Refugees will help limit the current service provision gaps.", "#Ethiopia: Ethiopian Parliament has approved Electoral and Political Parties draft Proclamation today.", "የሚኒስትሮች ም/ቤት በዛሬው ዕለት ባካሄደው 73ኛ መደበኛ ስብሰባ በተለያዩ ጉዳዮች ላይ ተወያይቶ ውሳኔ አሳለፈ፡፡", "PM Abiy Ahmed officially closed the tree planting season by planting seedlings with members of the #4billionTrees steering & technical committees. He called upon all Ethiopians to now embark on the caretaking process of planted seedlings to see our efforts bloom.\n\n#PMOEthiopia", "Grant agreement amounting to £120 million (ETB 4.23 billion) were signed today August 23, 2019 between the Federal Democratic Republic of #Ethiopia and the #United Kingdom at a ceremony held at the Ministry of Finance (MoF).", "The UK is providing expertise to Mojo Dry Port in Ethiopia to help break down barriers to trade and investment. This support will help ease day to day activities in the port and reduce trade times and costs.", "Appreciating the homegrown reforms underway, Mr. Sharma affirmed the continued support of the UK Government to #Ethiopia. PM Abiy expressed his gratitude to the UK Government for the continued engagement in Ethiopia’s endeavours. 2/2\n\n#PMOEthiopia", "PM Abiy Ahmed received UK Secretary of State for International Development, @AlokSharma_RDG and his delegation this morning. The two discussed UK’s continued support to Ethiopia in its development endeavours. 1/2", "PM Abiy Ahmed congratulates @PaulKagame and @KagutaMuseveni for signing the peace agreement aimed at easing tensions between their respective countries. PM Abiy hopes this pact will pave the path for strengthening regional cooperation and collective development.\n\n#PMOEthiopia", "PM Abiy Ahmed congratulates Gen. Abdel-Fattah Burhan who was was sworn in as leader of the Sudan Sovereign Council. He also shares his congratulations to  Mr. Abdalla Hamdok who was appointed as Prime Minister, following the August 17 signing of the final transition agreement.", "Very productive discussion with my brother @amirabiy and his team. I am glad to see the progress made on  immunization in #Ethiopia and the ongoing work across the whole of government to strengthen #PrimaryHealthCare and deliver #HealthForAll", "#Kenya  wins AU endorsement for UN Security Council seat.\nHowever, even with AU endorsement Kenya must still win at least two-thirds of UN member states’ votes when the election is held in New York next year in June.", "#Ethiopia: Ogaden National Liberation Front (ONLF) in a press statement it gave today, said the party will take part in the next year Ethiopian election, and wants the election to be conducted as scheduled.", "#Ethiopia: The first Ethiopian Diaspora Festival since the establishment of the Diaspora Agency is set to take place in Addis Ababa next week.", "47 African health ministers are meeting at @WHO’s #RC69AFRO – the continent’s\npreeminent health meeting - in Brazzaville this week to endorse regional policies and\nstrategies to improve people’s health. #UHC2030 #HealthForAll", "Reducing malnutrition in #Africa needs policy changes, from promoting breastfeeding to regulating the marketing of foods & increasing taxes on sugary drinks. It's not a job for ministries of health alone, but the whole of government to address the root causes of malnutrition.", "We now have an #Ebola vaccine that is more than 97% effective and treatments that are more than 90% effective if used early enough. Ebola is preventable and treatable. We need to make sure everyone in the affected area knows that.", "The  Somali Region targets to reach over half a million children (0-59mths) through the joint cross border #polio vaccination campaign.\n\n\"We have started the war against #polio outbreak & together we can win this war and regain a #polio free community @Dr_AggreyB", "Yesterday evening 105 #Ethiopian returnees arrived from Sudan with @PMEthiopia AbiyAhmed, and @UNmigration welcomed them at the Addis Ababa Bole International Airport. The returnees were transported to the IOM Transit Center for accommodation. https://twitter.com/IOMEthiopia/status/1162846370522423297/video/1 …", "Completing the Sudan visit, PM Abiy returned to #Ethiopia with over 100 female victims of trafficking that have been in #Sudan enroute to other countries. Among those that returned with PM also include individuals released from imprisonment for various offenses. \n#PMOEthiopia", "Members of the FFC met with PM Abiy Ahmed ahead of the signing ceremony. Appreciating him for the role #Ethiopia played in facilitating the agreements, they expressed that the constitutional and political agreements will lay a foundation for sustainable democracy and dev’t. 1/2", "Prime Minister Abiy Ahmed, along with his high level delegation arrived in Khartoum this morning to attend a Ceremony marking the Final Agreement to form a transitional government in Sudan. #Ethiopia", "Mr @bulutbagci announced that @wtourismforum board has awarded @PMEthiopia, H.E. Abiy Ahmed, the 2019 #WorldTourismAward for \"Leader in Tourism\".\n\nThe award will be presented to the PM at the World #Tourism Awards ceremony in London in November.\n\nCongratulations Prime Minister!", ".@PMEthiopia, H.E. Abiy Ahmed, is the 2019 recipient of the #WorldTourismAward for \"Leader in Tourism\".\n\nThe Prime Minister is recognised by #WorldTourismForum for his outstanding and exemplary efforts to improve and advance the #tourism industry in #Ethiopia, the #LandOfOrigins.", "#Ethiopia: 3rd Ethio-#Uganda Joint Ministerial Commission concludes by signing agreements on diplomatic issues , service passports, Extradition Agreement, mutual legal assistance and MoU on Correctional services.", "Food security is one of the four pillars of the government's Big 4 development blueprint which also covers affordable housing, manufacturing and universal health coverage.", "The President spoke today at State House, Nairobi during a meeting with Mr Strive Masiyiwa and former Ethiopian Prime Minister Hailemariam Desalegn, the outgoing and incoming AGRA chairpersons respectively.", "President Uhuru Kenyatta has commended the Alliance for a Green Revolution in Africa (AGRA) for its programmes aimed at enhancing food production in the country.", "Foreign Minister Gedu Andargachew,Defence Minister Lemma Megersa & Amb. Alemtsehai addressed Ethiopians in #Uganda on the margins of the  3rd Ethio-Uganda JMC. Members of the community vowed to support the ongoing reform in #Ethiopia @mfaethiopia", "PM  Abiy, Guterres, #EU Commission President, are expected to arrive in #Sudan to attend the signing ceremony of the agreement between the forces of the Declaration of Freedom and Change and the TMC on Saturday over the political and the constitutional declaration documents.", "Our country is managing procurement & distribution of 150-200 Mill condoms/year bn the government, NGO’s, and Social marketers. I believe we can also use similar/customized model to make sanitary pads available and affordable for the underprivileged and all economic group women.", "#Ethiopia: #Rwandan President Paul Kagame receives former Ethiopian President Mulatu Teshome and his delegation.", "#HappeningNow #Japan strengthened its already strong partnership with @UNDP today signing a USD 3 million elections support agreement @NEBEthiopia.  Both partners aware of the pivotal role of #Ethiopia’s upcoming election, for future of democracy and development. @JapanEthiopia", "Big smiles. UK Ambassador @AMcPhailUK pleased to discuss defence cooperation with Chief of Defence, Gen Adem Mohammed. Our partnership goes from strength to strength. The very smart picture (for which many thanks) would look good on my office wall. @UKinEthiopia @DefenceHQ", "UNAIDS warmly welcomes the appointment of Winnie Byanyima as its new Executive Director. Ms Byanyima has more than 30 years of experience in political leadership, diplomacy and humanitarian engagement.", "The African Union (AU) on Wednesday urged concerted efforts against the Ebola outbreak in the Democratic Republic of Congo (DRC) as the death toll climbed to 1,782, Xinhua reported.", "PM Abiy Ahmed met today morning Ambassador Yoshifumi Okamura, Special Envoy of Japanese Prime Minister Shinzo Abe and his delegation. The two discussed on the further strengthening of bilateral relations and in working together on regional peace in Africa. \n\n#PMOEthiopia", "In #Ethiopia, 2-3 million youth enter the labor market every year, said Abisola Alaka, FAO Senior Admin Officer & OMT Chair @UN Career Fair 2019 in Addis, which aims to provide a learning opportunity for students, recent university graduates & young professionals. @FAOEastAfrica", "#Ethiopia: #Diredawa Health Bureau Head Dr. Fuad Kedir said, they are working to contain the outbreak of Chikungunya disease in the town.", "#Ethiopia and #China  plan to build a second industrial park in Adama, a key commercial hub in central Ethiopia.", "Transforming Education is the theme for this year International Youth Day, which comes at a time when the world is facing a “learning crisis”, says Mr Guterres, and students need not only to learn, “but to learn how to learn”.", "This #InternationalYouthDay the UK is working with Ethiopia on achieving 12 years of quality education for every child. Through our Girls Education Challenge Programme we are helping improve learning opportunities for over 78,400 girls. #TransformingEducation @DrGete", "440ኛው የዒድ አልአድሀ  በዓል በደማቅ ስነ ስርዓት ተከብሯል፡፡\nየኢትዮጵያ እስልምና ጉዳዮች ጠቅላይ ምክር ቤት ፕሬዚዳንት ተወካይ ሼህ ሰዒድ አህመድ ሙስጠፋ ፣ ለአገራችን አንድነትና ለሰላም፣  የሚፈለግብንን ሁሉ ማበርከት ይጠበቅብናል ብለዋል፡፡", "EU amb @JBorgstam met with Federal Police Commissioner General Endashaw Tassew to discuss reform needs in Federal Police & possibilities for EU assistance. In Ethiopia EU works w Government & civil society to invest in reforms to secure rule of law & improve the judicial system.", "#Ethiopia: Ethiopian Ministry of Foreign Affairs announced that it has started diplomatic efforts to secure the release of Ethiopians detained in #Johannesburg, #South Africa.", ".@eu_echo is mobilising another €50 million to tackle #drought in the Horn of Africa. This funding will go to food aid, health and nutrition, water access and livelihoods support in #Somalia, #Ethiopia, #Kenya and #Uganda - http://bit.ly/2yI1nvb  (Image © WFP)", "Minister Muferihat Kemil hosts the #Danish Minister for Development Cooperation, Rasmus Prehn. The two discussed the Ethiopian Refugee Legislation, #Ethiopia hosting the Comprehensive Refugee Response Framework Conference, and challenges faced with conflict management & IDPs.", "The EU delivered today additional five 4WD vehicles to MoA for the veterinary laboratories in Tigray, Amhara and Oromia regions. As part of a FAO implemented  project, this will help to eradicate the Ovine Rinderpest  in Ethiopia.", "PM Abiy held a meeting with Danish Minister for Development Cooperation, @RasmusPrehn during which the two discussed issues related to energy policy, jobs creation, increased investments, democracy, climate change and the environment. 1/2", "PM Abiy launched the Investment and Jobs Creation National committee this morning in the presence of Regional Presidents and Federal Ministers. 1/10", "PM Abiy expressed his appreciation of the @WeareTASFA team that traveled from the US heeding the call for professionals in the Diaspora to come share knowledge & skills. He noted their commitment to support their fellow #Ethiopians as exemplary leadership in action.\n\n#PMOEthiopia", "ለኦሮሚያ ክልል ምክትል ፕሬዝዳንት አቶ ሽመልስ አብዲሳ የግመሎች ስጦታ ተበረከተላቸው\n\nለኦሮሚያ ክልል ምክትል ፕሬዝዳንት ሽመልስ ከሱማሌ ክልል ምክትል ፕሬዝዳንት አቶ ሙስጠፋ መሐመድ ኡመር የ7 ግመሎች  ስጦታ ተበርክቶላቸዋል፡፡", "ጠ/ሚር ዐቢይ አሕመድ በወቅታዊ ጉዳዮች ላይ ዛሬ ሐምሌ 25 ቀን 2011 ጋዜጣዊ መግለጫ ይሰጣሉ::\n\nPrime Minister Abiy Ahmed will be giving a press briefing on current issues today August 1, 2019. \n\n#PMOEthiopia", "Hamza Bin Laden, the son of al-Qaeda founder Osama Bin Laden, died in an air strike.", "African health sector experts on Tuesday urged African countries and pan African institutions to increase domestic healthcare financing efforts towards realizing universal health coverage (UHC) for all Africans. (Source: Xinhua)", "#Ethiopia earned more than $1.2 billion from the exports of coffee and oilseeds during the just-concluded Ethiopian fiscal year that ended on July 7.", "The African Union  praised #China for its continuous support of public health in #Africa.", "If every country can break records for planting trees like #Ethiopia — we can counter the effects of deforestation and climate change. \n    \nEvery one of our actions, big and small, count for people and for planet. #GreenLegacy #ClimateAction #GlobalGoals @PMEthiopia", "PM Abiy calls upon everyone in #Ethiopia to go out and #PlantYourPrint. \n\n#PMOEthiopia", "#GreenLegacy in Wolayta Soddo\n\n#አረንጓዴአሻራ በወላይታ ሶዶ\n\n#PMOEthiopia", "Climate change is one of the most serious threats facing our world. If we don’t take action now the extinction of much of the natural world is on the horizon. Ethiopia is a key partner to the UK in addressing climate change. Watch more ", "Ensuring water quality, proper sanitation & hygienic food preparation during mass gatherings have a considerable impact in preventing spread of #cholera\n\nWHO #WASH officers joined forces with Gov't and partners in the special #cholera prevention activities in Kulubi, EastHararghe", "PM Abiy Ahmed met with @WFPChief\n to discuss further strengthening support to #Ethiopia. WFP have been engaged in food security & nutrition, and early warning & climate action among other focal areas. The two planted seedlings as part of the #GreenLegacy initiative. \n#PMOEthiopia", "#HappeningNow: High level briefing on the development of Multisectoral #Cholera control elimination plan for #Ethiopia. @lia_tadesse @EPHIEthiopia @FMoHealth @Dr_AggreyB @UNICEFEthiopia", "Why the British Museum should send the tabots back to #Ethiopia - Richard Brooks\nhttps://www.theguardian.com/commentisfree/2019/jul/21/british-museum-ethiopia-tabots-religious-artefacts-womens-world-cup-garsington-opera?CMP=share_btn_tw …", "Happy to meet Prime Minister Abiy Ahmed @PMEthiopia for the third time this year! Shows the strong partnership Ethiopia-EU. The #EU strongly supports the bold democratic and economic reforms in #Ethiopia. Challenges remain but will be overcome! #AUEU", "Together with Finance Minister of #Ethiopia Ahmed Shide, I signed a 36M€ budget support programme in the area of #climatechange. #EU has demonstrated that economic growth and job creation can go hand in hand with ambitious climate policies. #AUEU #AfricaEuropeAlliance", "A #French delegation led by French Minister of Economy & Finance,  Bruno Le Maire visited\nEthiopian. \nA discussion was  held  between the delegation and #Ethiopian Airlines Executive Management on the areas of partnerships and cooperation between\nthe airline and French companies.", "Mr. LeMaire conveyed France’s appreciation of steps being taken by Ethiopia, particularly to increase competitiveness & business conduciveness & confirmed Ethiopia as an investment destination for France. The two ended their meeting by planting seedlings. \n\n#PMOEthiopia", "PM Abiy received at his office Minister of the Economy and Finance of the French Republic @BrunoLeMaire. The two discussed the continued strengthening of economic cooperation between #Ethiopia & #France. 1/2", "PM Abiy Ahmed nominated for the 2019  Catham House Prize  for his efforts to advance plural politics & free speech in #Ethiopia, the historic peace deal with #Eritrea, progressing gender equality, & injecting hope for a more peaceful and integrated Horn of #Africa.", "#Ethiopia: Foreign Minister Gedu Andargachew holds discussion with Saudi Ambassador to Ethiopia Sami Jamil Abdullah on ways & means of  further bolstering #Saudi Investment in #Ethiopia. \n@mfaethiopia", "#Ethiopia: Sudanese out on the streets of #Khartoum raising Ethiopian flag in  jubilation & appreciation of Ethiopia's role in the recent mediation breakthrough \n@mfaethiopia", "#Ethiopia : Ethiopian delegation led by Prime Minister Dr. Abiy Ahmed arrived in Asmara  for a two-day working visit.  Eritrean President Isaias Afwerki accorded warm welcome to the Prime Minister & his delegation on their arrival at Asmara's International Airport.", "#Ethiopia: UNICEF signs annual work plans worth 1.4 billion birr (US$ 49 million) with the Government of #Ethiopia.", "#Ethiopia: EU invests 1.5 billion birr (45 M€) to assist Govt of Ethiopia to create 400 000 new jobs in agroindustrial parks.", "PM Abiy presided over signing of a $100mil grant MoU b/n the FDRE Min of Finance & UAE Gov't represented by Khalifa Fund for Enterprise Dev’t. The MoU was signed by State Minister Admassu Nebebe & Chairman of the Khalifa Fund Board of Directors, Hussain. J. Al Nowais. #PMO", "“የደስታ ምንጭ ከራስ አልፎ ለወገን ማድረግ መቻል ነው፣ መልካምነት ያላችው ሰዎች መልካምነት በሚዛን የሚለካ አይደለም፤ ለዚህ ድንቅ አገር መልካም መሆን እንደ ክብር መቆጠር አለበት”- ጠቅላይ ሚኒስትር ዶ/ር ዐቢይ አህመድ", "ችግኞችን በመትከል “ስንኖር ኢትዮጵያዊ ከሆንን፣ኢትዮጵያችን አረንጓዴ ማድረግ አለብን፤ስንሞት ኢትዮጵያ ከሆንን ደግሞ ቢያንስ መቃብራችን ጥላ ስር ይሆናል” ጠቅላይ ሚኒስትር ዶ/ር ዐቢይ አህመድ", "Transparency International says young people in Africa, aged 18-34 years, are more likely to pay bribes than older people, aged over 55 years.", "Amb. Hyland signed an agreement with @FDREHOPR Speaker, Tagesse Chafo, to support parliamentary reform agenda. A strong and independent #legislature is a key element of #Ethiopia’s democratic transition. Looking forward to growing our new partnership!", "#Ethiopia: The African Union (AU) on Wednesday called for enhanced monitoring of internet activity in order to combat terrorism activities, (Source: Xinhua)", "#Ethiopia: Hong Kong firm Hop Lun Company (HLH) on Wednesday signed a Memorandum of Understanding (MoU) with Ethiopian officials to manage Bahir Dar Industrial Park (BIP) located in the northern part of Ethiopia.", "#Ethiopia: South Korean Foreign  Minister, Kang Kyung-wha extended an official invitation on behalf of the Government for PM Abiy to visit South Korea.  (Source: Office of Prime Minister)", "#Ethiopia: PM Dr. Abiy Ahmed also met with the Foreign Minister of South Korea, Kang Kyung-wha. The two parties discussed the long standing relations between Ethiopia and South Korea, modernizing the taxation and customs system, provision of support for education. #PMOEthiopia", "#Ethiopia: Prime Minister  Dr . Abiy Ahmed met with the Foreign Minister of Finland, Pekka Haavisto this morning to discuss bilateral issues and the role of Ethiopia in bringing regional peace and stability, particularly in Sudan. \n\n Source: #PMOEthiopia", "#Ethiopia: Following the Prime Minister’s July 8th address to parliament on proposed budget for E.C. 2012, @EyobTolina and @AbebeAbebayehu provided a briefing on the economy, fiscal performance and investments to promote jobs creation. \n\n#PMOEthiopia", "#Ethiopia: Ethiopian National Defense force announced that it is making preparations to file charges against individuals and Media that were engaged in disseminating baseless allegations and false information to create mistrust between the public and  the Defense Force.", "#Ethiopia: Ethiopian Parliament has approved 386.9 billion birr budget for the next Ethiopian fiscal year, which starts today, July 8.", "Ghanaian President Nana Addo Dankwa Akufo-Addo on Sunday pledged to donate 10 million U.S. dollars to the African Union to support the operationalization of the secretariat of the African Continental Free Trade Area (AfCFTA), Xinhua reported.", "African leaders on Sunday officially launched the operational phase of the African Continental Free Trade Area (AfCFTA) Agreement in Niamey.\n\nThe launch occurred at the 12th Extraordinary Summit of the AU Heads of State and Government in Niamey,  Niger. ( Source:  Xinhua)", "Education experts from #China, #Kenya, #Tanzania, #Ethiopia and host #Uganda are meeting in here to discuss how vocational education can fast track Africa's development.", "PM Abiy applauded the diligence & diplomatic skills of the two Special Envoys Ambassador Mohamoud Dirir and Prof. Mohamed Hacen Al-Labatt in facilitating this breakthrough deal. The Government of Ethiopia wishes a prosperous and peaceful new chapter for Sudan.\n\n#PMOEthiopia", "Leaders of civil society organizations are currently meeting with senior government officials at the PMO this morning. This consultation is part of the series of conversations the PMO has held on issues of the reform agenda with various groups in the country. 1/2", "#Sudan's  Military Council and a coalition of protest and opposition groups have reached an agreement to share power during a transition period before a general election, according to an African Union (AU) mediator.", "A court in #Kenya has sentenced a militant Islamist to life in prison for his role in the 2015 Garissa University College attack, which left 148 people dead.\n\nTwo other militants were jailed for 41 years each. (BBC)", "#Sudan military rulers agreed to release all political prisoners.", "#Ethiopia:  Ethiopian Foreign Minister Gedu Andargachew leaves for #Niger to Attend #AU Summit.", "#Ethiopia: Ethiopian Airlines will launch inaugural flight to Marseille, France, tomorrow.", "I strongly condemn the air-strike that killed at least 40 innocent migrants in a detention center in #Libya. It is a horrific crime that must be fully investigated. #Migrants caught in the ceasefire must be protected urgently. My full statement here: \nhttps://au.int/en/pressreleases/20190703/statement-chairperson-african-union-commission-air-strike-libya …", "#Eritrea and #Sudan have agreed to reopen border crossings following talks in Asmara between Eritrean President Isaias Afewerki and the deputy head of Sudan's Transitional Military Council, Lt-Gen Mohamed Hamdan Dagalo.", "AU envoy to #Sudan Mohamed Hacen El Lebatt said that an agreement is expected to be reached  between Sudanese groups.\n\n\"The final agreement between the two parties is just around the corner,\" said Lebatt at a joint press conference with the #Ethiopian mediator Mahmud Dirir.", "#Ethiopia: Joint Communique of the Federal Democratic Republic of Ethiopia and the African Union Commission on the Situation in Sudan.", "#Ethiopia: A Chinese firm, Aviation Industry Corporation of China (AVIC) has started construction on a five-star hotel in Ethiopia's capital, Addis Ababa at a cost of 150 million U.S. dollars, Asrat Begashaw, head of public relations at Ethiopian Airlines.", "ዛሬ ጠዋት የመንግስታቸውን የ2010/11   የስራ አፈጻጻም ሪፖርት ለህዝብ ተወካዮች ምክር ቤት ያቀረቡት ጠቅላይ ሚኒስትር ዶ/ር ዐቢይ አህመድ ረፋዱ ላይ በምክር ቤቱ ቅጥር ጊቢ ውስጥ የዛፍ ችግኞች ተክለዋል፡፡", "“ሕገ መንግስት የአንድ ቀበሌ ህዝብ አይደለም፣ የኢትዮጵያ ህዝብ ሕገ መንግስት ነው፣ አሳማኝ ሀሳብ የቀረበ እንደሆነ በሁሉም ህዝቦች አዎንታ ሊሻሻል ይችላል፤ በቡራ ከረዩ ሕገ መንግስት አይሻሻልም” - ጠቅላይ ሚኒስትር ዶ/ር ዐቢይ አህመድ", "“ሕገ መንግስቱ አይወክለኝም የሚል አካል ለምርጫ መዘጋጀት የለበትም፤ የሀሳብ ነፃነት መብት ጥያቄንም  መጠየቅ አይችልም” -  ጠቅላይ ሚኒስትር ዶ/ር ዐቢይ አህመድ", "#Ethiopia: Ethiopian Economic has shown 7.7% growth over the ending fiscal year, according to the Ethiopian Prime Minister’s government performance report.", "#Ethiopia: PM Abiy Ahmed met with Mahmoud Ali Youssouf, Min for Foreign Affairs and Int’l Cooperation of #Djibouti. \n\nMr. Youssouf carried a message from President Ismaïl Omar Guelleh sharing his condolences to PM Abiy. #PMOEthiopia", "#Ethiopia: President Sahlework Zewde held talks with Dr. Monica Juma,  Kenyan Foreign Minister and Kenyan Ambassador to IGAD.", "An 89-year-old man has been buried with  newspapers in #Uganda as part of his dying wish, according to New Vision newspaper.\n\nDodoviko Ssenyonjo was a reportedly a dedicated reader of local newspapers, and did not trust that relatives would keep his collection after he died", "Oral Cholera Vaccine administration to High-risk population in #Ethiopia has started. via, Ethiopian Health Minister.", "The @WHO gave recognition to FDRE House of People Representative for endorsing strong legislation on Alcohol & Tobacco Control;  being one of the six countries in Africa with such legislation. Also, it is announced that the HPR compound is ”Tobacco Smoke-Free” as of today.", "#Ethiopia: Prime Minister Dr. Abiy Ahmed's father Ahmed Ali has passed away.", "Eritrea is being removed from the United States government's list of countries deemed not to be cooperating fully with U.S.counterterror efforts.\nAccording to VOA, diplomatic breakthrough  contributed to the UN Security Council lifting sanctions on Eritrea late last year.", "The Food &Medicine Administration Proclamation No.1112 article 74(4) that bans advert of alcoholic products through TV, radio & billboard starts to take effect as of today May 29, 2019. According to MOH,it is a must to remove every billboard advertisement & stop alcohol advert.", "House of Resprsentative of Ethiopia appointed Dr Tasew Gebre and Ustaz Abubekir Ahmed as chairperson and vice chair for the newly established Administrative Boundaries and Identity Issues Commission respectively.#Ethiopia", "The new citizenship based Unifed party (Ethiopian Citizens for Social Justice) has elected Professor Birhanu Nega and Ato Andualem Arage today, as the new party head and vice ,respectively.#Ethiopia", "#Ethiopia grouped under the stars of hotel dev't in Africa with Egypt,Nigeria&Morocco-according to the 11th annual survey by W Hospitality Group.\nThe 4 countries head the top ten by no. of rooms in the internationally-branded hotel dev't pipeline, with Egypt in 51 new hotels.", "#Ethiopia: #UNESCO awards Prime Minister Abiy Ahmed the Félix Houphouët-Boigny Prize for Peace for his commendable work in pursuit of peace. \n\n#PMOEthiopia", "In his remarks at the Ethiopian Muslims Ulama conference this morning PM Abiy Ahmed emphasized that a strong Muslim community is the foundation for Ethiopia’s unity.", "#Ethiopia: Addis Ababa Light Rail Transit (AALRT) network has transported more than 29 million people in just nine months, says the Ethiopian Ministry of Transport(MoT).", "Former Ethiopian President Dr. Negaso Gidada passed away today in Germany where he was receiving medical treatment at the age of 76.", "The House of People's Representatives has approved the appointment of three ministers, \n1 Ato Gedu Andargachew - Foreign Affairs Minister\n2. Ato Lema Megersa  - Minister of Defense\n3. Engineer Isha  Mohamed - Ministry of Urban Development and Construction.", "PM Abiy  and President Sahlework  received Ethiopian athletics team that participated in the 43rd edition of the IAAF World Cross Country Championships at a state dinner.\nAthlete Feyisa Lelisa, was also honored for his silver medal victory at the Rio 2016 marathon. \n#PMOEthiopia", "#Ethiopia: The Newly appointed Ethiopian ambassador to America Fitsum Arega presents credentials to American President Donald Trump.", "Prime Minister Abiy Ahmed, First Lady Zinash Tayachew and the Prime Minister’s delegation arrived in Kigali, Rwanda this afternoon for an official state visit. The Prime Minister was received by @PaulKagame. \n\n#PMOEthiopia", "#Ethiopia: The 29th anniversary of the foundation of Oromo Democratic Party (ODP) is being celebrated in Addis Ababa, Millennium hall.", "#Ethiopia: Ethiopian Prime Minister Dr. Abiy Ahmed and Oromia Regional State President Lemma Megersa arrived in Bunno Bedelle Zone, Bedelle town to hold public discussion.", "#Ethiopia: Ethiopian Prime Minister Dr. Abiy Ahmed and Oromia Regional State President Lemma Megersa attended Ethiopian  Commodity Exchange (ECX) 23rd branch opening ceremony in Oromia Region Mettu town.", "Algeria’s president Abdelaziz Bouteflika sent his resignation to the Constitutional Council(state media).", "A discussion platform reviewing the one year journey of reforms is currently taking place at UNECA exploring political, economic, foreign relations, justice and security sector changes undertaken. \n\n#PMOEthiopia", "I was touched by the enthusiasm and joy of the athletes at the Special Olympics Abu Dhabi 2019. It’s exhilarating for me & my dear friend, the Ethiopian Prime Minister, to meet people of determination.  We’re so proud of them and their families.", "Mohamed bin Zayed discusses enhancing bilateral ties with the Ethiopian Prime Minister as well as a number of regional and international issues of mutual interest.", "#Ethiopia: Ethiopian Prime Minister Dr. Abiy Ahmed arrives at Abu Dhabi for official work visit.", "#Ethiopia: Three Ethiopians and two Foreign nationals killed in Ethiopia, West Welega zone by unknown gun men. (Source:-  Oromia Communication Bureau)", "PM of #Ethiopia Dr. Abiy Ahmed and his delegation arrive in Doha, Qatar on an official visit to the country.  Upon arrival to Doha, he received a warm welcome from Qatar Minister of Transport and Communications and Ambassador of Qatar to Ethiopia.  (Via Ethiopian Embassy in Doha)", "Ethiopia's Defence Minister & the Deputy President of Afar Region signed the Agreement with the Afar Liberation Movement while ALM's Chairman & the Head of Political Office were the co-signatories. The Gambella Agreement was signed by the President of Region &the Chairman of GPIM", "#Ethiopia: Ethiopian Political parties have signed agreement on common work principles.", "Prime Minister Abiy Ahmed bid farewell to President Emmanuel Macron earlier today as he concluded his two-day state visit to #Ethiopia.\n\n#PMOEthiopia", "#French President Emmanuel Macron arrives in Lalibela, #Ethiopia.", "#Ethiopia: Ethiopian Ambassador to #Kenya Meles Alem presents his credentials to Kenyan President Uhuru Kenyatta.", "#French President Emmanuel Macron starts his East African visit with a visit to #Djibouti.  He is expected to visit #Ethiopia, Lalibela later today. Ethiopian Prime Minister Dr. Abiy Ahmed is waiting for him in Lalibela.", "On behalf of the FDRE Government, Prime Minister Abiy Ahmed expresses his gratitude to world leaders and the international community for their messages of condolence and support in our time of mourning all the precious lives we lost aboard ET 302. \n\n#PMOEthiopia", "#Ethiopia: An Ethiopian Airlines Boeing 737 passenger jet has crashed on a flight from #Addis Ababa to #Nairobi.\n\nThe Office of the Prime Minister of Ethiopia has extended it’s condolences to the families of  those who lost their lives.", "#Ethiopia: Through the facilitation of Prime Minister Abiy Ahmed, President Uhuru Kenyatta and President Mohamed Abdullahi Mohamed met this morning to discuss extensively on the source of the two countries dispute. \n#PMOEthiopia", "እንወያይ?\n\nከኢትዮጵያ ተፎካካሪ የፖለቲካ ፓርቲዎች ምን ይጠበቃል?\nhttps://www.facebook.com/EBCzena/photos/a.542045289160685/2385278368170692/?type=3&theater …", "PM Abiy held bilateral discussions with Somali President Farmaajo. Their discussion was focused on strengthening regional peace, mechanisms to ensure Kenya-Somali; continuation of joint port dev’t; & ensuring relations with the administration of Somaliland .\n\n#PMOEthiopia", "An 80-year-old woman has enrolled for Primary One at Jesus is King Nursery and Primary School in #Uganda,  Bugandalo Village, Ibulanku Sub-county in Bugweri District, with an aim of becoming a teacher. (Via Daily Monitor, Uganda)", "A UK patient's HIV has become \"undetectable\" following a stem cell transplant - in only the second case of its kind, doctors report in Nature.\nThe  patient, who was being treated for cancer, has now been in remission from HIV for 18 months and is no longer taking HIV drugs. (BBC)", "The leaders of Ethiopia, Eritrea & South Sudan have issued a joint statement highlighting their agreement to materialize shared projects towards regional economic integration. \n\nPM Abiy has finalized his South Sudan trip and has returned to Ethiopia. \n\n#PMOEthiopia", "#Ethiopia: PM Abiy and Eritrean President Isaias  have arrived in Juba, #South Sudan. During their stay in Juba, they will hold discussions with President Salva Kiir and other higher government officials on regional peace, economic ties and infrastructure dev't. \n#PMOEthiopia", "PM Abiy Ahmed, @UKenyatta & Amhara Regional President Gedu Andargachew inaugurated the Debre Birhan Industry Park on the historic day commemorating the Victory of Adwa. The industry park built on a total of 1,100 hectares of land has currently 8 production sheds completed. 1/2", "Gamo elders gave their blessings, bestowing the two leaders with gifts symbolic of the culture. PM Abiy Ahmed noted the Adwa victory as a foundation for our continued triumph against any odds. President Kenyatta also shared that Adwa is a symbol of Africa’s victory.\n\n#PMOEthiopia", "#Ethiopia:  Prime Minister Abiy Ahmed met with Swedish Foreign Minister Margot Wallström this morning. The two discussed on Ethio-Swedish relations and Ms Wallström reiterated Sweden’s continued support to Ethiopia.\n#PMOEthiopia", "#Ethiopia: Kenyan President Uhuru Kenyatta and Ethiopian Prime Minister Dr. Abiy Ahmed are visiting Hawassa Industrial Park. #Kenya", "The Intergovernmental Authority on Development (IGAD) and Germany have signed a 34 million Euros grant agreement during the 46th Ordinary Session of IGAD Council of Ministers  held in Djibouti  yesterday.\nThe project grant will be used for migration and capacity building.", "Opening up of the political space where ideas freely flow has been a key anchor of the reforms. Following the initial political parties discussion forum hosted by Prime Minister Abiy Ahmed a few months ago, a third similar platform is currently in session.#@PMEthiopia", "AfDB has kicked off a feasibility study to explore the potential of electricity cooperative business models in #Ethiopia and #Nigeria and  The effort is part of the Bank’s goal of achieving universal electricity access across #Africa by 2025.", "#Ethiopia: Prime Minister Abiy Ahmed is currently undertaking a discussion session with central committee members of the regional political organizations.\n\n#PMOEthiopia", "The Somali government has moved to calm diplomatic tensions following #Kenya's decision to recall its ambassador to Mogadishu and instruct #Somalia's ambassador to leave #Nairobi.", "United Nations Secretary-General António Guterres  announced the appointment of Major General Mehari Zewde Gebremariam of #Ethiopia as Force Commander of the United Nations Interim Security Force for #Abyei (UNISFA), on Friday", "#Ethiopia:  Ethiopia’s new tobacco control law: a step forward that needs to be complemented by higher taxes: #World Bank", "\"Our heroic national defense forces have overcome both external and internal sovereignty challenges with the highest level of service and commitment.  The institution is the hope and guardian of the nation.\" - Prime Minister Abiy Ahmed", "The Current Africa Union chair person ,Ruwandan President Paul Kagame arrives in Addis Ababa for the 32nd Ordinary Session of the Union.#Ethiopia #AU", "World football governing body -FIFA to inaugurate its regional office in Addis Ababa, in the coming Monday with the presence of the continent’s leaders.#EBC #Ethiopia", "Prime Minister Abiy Ahmed met and discussed with Bill Gates today in his office. \nThe prime minster and the billioner talk was a continous move  while PM Abiy was in Switzerland for Davos Economic Forum. \n#PMOEthiopia", "PM Abiy  met  Founder of the Mo Ibrahim Foundation, Dr. Mo Ibrahim. They discussed on issues of governance and democratization. They also addressed  issues of youth engagement and jobs creation across Africa. appreciated the changes taking place in #Ethiopia.\n\n#PMOEthiopia", "#Ethiopia : Senbere Teferi win Ras Al Khaimah Half Marathon in thrilling finish. Senbere Teferi finished the race in 1:05:45", "#Ethiopia:PM Abiy Ahmed continued with surprise supervisions today, with a visit to the Federal Middle Income Tax Payers Office, where he was briefed on its activities. He met with staff members of the office as well as with tax payers waiting to impart their citizen duties. #PMO", "Eritrean public diplomacy delegation to visit #Ethiopia. The visit aims to strengthen the historical relations and people-to-people ties between two countries. #Eritrea (Source: Ethiopian MoFA)", "#Ethiopia: Ethiopian parliament approved the appointment the members of Reconciliation Commission.", "#Ethiopia: Ethiopian parliament approved the appointment the members of Boundary Administration and Identity Affairs Commission.", "The Funeral Processions for former Ethiopian House of the speaker Ambassador Dawit Yohannes and Ambassador Zerihun Reta Held Today\nThe two ambassadors served their country in various positions for several years.#EBC#Ethiopia", "PM Abiy Ahmed together with the SNNPR & Oromia Regional State Presidents inaugurated the Gidebo Dam project. The dam located in both regional states has a height of 25.8m and length of 335m. Built at a cost of 1.2 billion birr, the dam has 62.5 meter cube capacity.#PMOEthiopia", "#Ethiopia #Eritrea: The three-day workshop that has been conducted from 30 to 01 February at Asmara Palace aimed at strengthening International and Regional Police Cooperation in Eastern Africa concluded adopting various recommendations. #Shabait.com", "Prime Minister Abiy Ahmed is currently attending a discussion with competing political parties. This historical discussion platform which is unique to #Ethiopia’s political history and narrative, follows the initial meeting hosted by the Prime Minister a few months ago. #PMO", "#Ethiopia: The Council of Ministers today approved Ethiopia’s membership to the Africa Continental Free Trade Agreement. The #AfCTA—one of the biggest trade agreement since the creation of the WTO—attempts to create a single market in Africa. #PMOEthiopia", "\"Although #Ethiopia has 570 years Geda System democracy experience, still democracy is at its early stage in the country\"-  Prime Minister Dr. Abiy Ahmed.", "EU Commission Vice President and High Representative of the EU for Foreign Affairs and Security Policy, Ms. Federica Mogherini to vist Ethiopia from starting Feb.2011, said Ethiopian Foreign ministry spokes person, Nebiat Getachew.", "Let Gen Tigabu Yilma Wondimhunegn from #Ethiopia has taken over as the new Force commander of @amisomsomalia #Somalia #Ethiopia.", "#Sudan's Bashir says border with #Eritrea reopens after being shut for a year. @Reuters", "Three-day workshop bringing senior officials from Police, Prosecution Authorities & Office of Attorney Generals from #Eritrea, #Ethiopia, #Kenya,#Somalia & #Uganda convened at #Asmara today. It will focus on police communication systems/legal frameworks. (Source: Eritrean IM)", "#Ethiopia: A charge filed against former Somali Regional State President Abdi Mohammed Umar and 46 others.", "#Ethiopia-#Eritrea Interim High Level Committee, led by the Foreign Ministers of the two countries, is undertaking consultations to regularize trade and transport relations.  These consultations have come in the wake of experience gleaned in four months of trial period.", "German delegation led by #Germany President Frank-Walter Steinmeier Lalibela visit (In pictures)\nPhoto Credit:- Embassy of Germany in #Ethiopia", "#Ethiopia has finalized a cooperation road map to advance its relation with Eritrean to institutional level. #Eritrea", "#Ethiopia: President Steeinmeier of #Germany has received a warm welcome by President Sahle-Work Zewde at the National Palace.", "#Ethiopia: PM Abiy Ahmed is currently presiding over a performance evaluation of Ministerial offices and accountable organizations’ 100-day plans. This planning and execution review process has been put in place to ensure institutional accountability and performance. \n#PMO", "#Ethiopa: Fatuma Sado has won the 38th Osaka International Women’s Marathon, an IAAF Gold Label road race, on Sunday (27), clocking 2:25:39.\nShe  became  the fourth African to win the race after Lornah Kiplagat, Catherine Ndereba and Amane Gobena.", "#Ethiopia: Mohammed al Amoudi released from Saudi Prison.", "PM Abiy inaugurated the Bole Int’l Airport Expansion work built at a total of $363mil. PM Abiy noted @flyethiopian is the pride of Ethiopia embodying the philosophy of Medemer. (1)", "PM Abiy met with the Somali Region V/Head Mustefa Omer & Chair of the Somali People’s Democratic Party, Ahmed Shide to discuss dev’t & security activities of the region. \nThe meeting concluded with PM Abiy providing direction on strengthening the dev’t of the region.#PMOEthiopia", "Deputy Prime Minister of Ethiopia, Demeke Mekonnen visits the Omo Kuraz -3 Sugar Development Project in Bench Maji Zone of SNNPR.\nAs he visits, he learns the project reaches currently a total capacity of production with 12 thousand Quintals sugar per day. #DPMofEthiopia", "#Ethiopia: PM Abiy Ahmed met Chairperson of AUC Moussa Faki Mahamat to discuss the upcoming AU summit and Ethiopia’s role as host country. \nThey also discussed on ways in which the summit can be carried out in a different way from the norm. #PMOEthiopia", "#Ethiopia: Ethiopian athletes dominate Dubai Marathon. In the men's race, Getaneh Molla has won the race, Hirpasa Negasa, and Asefa Mengistu took 2nd and 3rd places respectively. \nIn the women's race, Workinesh Degefa took 2nd, Workinesh Edessa 3rd, Weganash Mekasha 4th places.", "ጠ/ሚር ዐቢይ አሕመድ ፎሬን ፖሊሲ (Foreign Policy) በተባለ ህትመት አለምአቀፍ አሰላሳዮች ዝርዝር ውስጥ ተካተቱ። \n\nPrime Minister Abiy Ahmed listed among Foreign Policy’s Global Thinkers.\n\n#PMOEthiopia", "#Ethiopia: Oromo Liberation Front OLF agreed to take its soldiers to the camps. Oromo Abba Gada’s have mediated between OLF and   ODP and the two parties agree to refrain from any military measures, and OLF agreed to take its armed soldiers to camps within 20 days.", "#Ethiopia: PM Abiy while addressing The WEF said his government has brought about significant changes in the past 9 months.\n\"Ethiopian are born marathon runners. Take that as a signal of our intentions and our level of stamina,\" he said, in reference to the task ahead.", "#Ethiopia: Ethiopian police arrests former EPRDF official Bereket Simon.    Tadesse Kassa is also arrested today. They are suspected of corruption.", "#Ethiopia: Oromo Abba Gadas are mediating between  Oromo Democratic Party (ODP) and Oromo Liberation Front (OLF) here in Addis Ababa.", "#Ethiopia: Prime Minister Abiy Ahmed currently in attendance at the official opening of the 2019 World Economic Forum in #Davos, #Switzerland.\n\n#PMOEthiopia", "#Ethiopia: Prime Minister Dr. Abiy Ahmed met  World Food Program (WFP) Executive Director  David Beasley today.\nPhoto: Office of Prime Minister", "According to Oxfam International report, the top 26 billionaires own $1.4 trillion — as much as 3.8 billion other people.", "#Ethiopia: Italy urges its investors to exploit  Ethiopia's investment opportunities.  Ethiopia's Foreign Affairs Minister Dr. Workineh Gebeyehu held discussion  with European investors in Rome, Italy.", "#Ethiopia: Prime Minister Dr. Abiy Ahmed  arrived at #Rome, #Italy for official work visit.", "#Ethiopia: Ethiopian athletes dominate Mumbai Marathon in women's category. Workinesh Alemu has won the race,  and \n2 Amane Gobena \n3 Birke Debele \n4 Mergertu Alemu \n5 Almaz Negede \n6 Melesech Tsegaye \n7 Zinash Gerado", "#Ethiopia: Prime Minister Dr. Abiy Ahmed leaves for #Italy for official work visit.  After his Italian visit, he  will take part in the World Economic Forum in #Davos, #Switzerland.", "The African Union (AU) has called on the Democratic Republic of #Congo (DR Congo) to postpone the announcement of its presidential election results.", "#Ethiopia: President Kagame and current Chair of the #African Union arrives in #Addis Ababa where he will chair the High Level Consultation Meeting of Heads of State on the Situation in DRC", "On behalf of the Federal Democratic Republic of #Ethiopia, Prime Minister Abiy Ahmed strongly condemns the senseless violent attacks committed on innocent civilians in #Nairobi, #Kenya. He expresses his condolences to the families of the bereaved, and to all Kenyans. #PMOEthiopia", "#Kenya: President Uhuru Kenyatta says Nairobi attackers have been elimnated, more than 700 civilians rescued from attack.", "Breaking: UK MP's rejected May's Brexit deal.", "#Ethiopia: Prime Minister Abiy Ahmed is currently discussing Ethiopian foreign policy with Ethiopian diplomats. The discussions also aim to review the reforms that have been taking place within the Ministry and in Ethiopia’s foreign policy. #PMOEthiopia", "#Ethiopia: AU's 32nd ordinary summit will be held on February 11 at #Addis Ababa.", "Today  a new Afan  Oromo school constructed by the support of Al Maktoum Foundation (based in UAE) is officially opened.\nThank you, HH Sheikk Hamadan Bin Rashid Al Maktom,UAE’s Minster of Finance.", "#Ethiopia: Prime Minister Dr. Abiy Ahmed held talks with #Ireland Prime Minister Leo Varadkar today at his office.", "#Ethiopia: The Guji Abba Gadas declare the week of peace, which will last until the coming Sunday.", "የኢትዮጵያ ኤርትራ ድንበር ጉብኝቱ በምስል:: (ታህሳስ 29 ቀን 2011)\nToday’s visit to the Ethio-Eritrea border in images. (January 7, 2019)\n\n#PMOEthiopia", "#Ethiopia: Prime Minister Dr.  Abiy Ahmed undertook sudden supervision of the offices of the  FederaL Attorney General and the Ethiopian Roads Authority (ERA) today. @PMOEthiopia", "#Ethiopia: Ethiopia's Abiy Ahmed: The leader promising to heal a nation: BBC\nhttps://www.bbc.com/news/world-africa-46735703?fbclid=IwAR1qdp4D-BIEYNfxyLxM_BJZEl1g6nis4Shx4XlvSP-lnVRfcd0arY_Lu6o …", "Nigussu Tilahun appointed as Press Secretary of the Office of Prime Minister of #Ethiopia", "#Ethiopia: Police  have found 498 illegal pistols inside the home of  Amhara Regional State police commander, Wubetu Shiferaw.", "#Ethiopia: Ethiopians Tamirat Tola and Netsanet Gudeta collected their second victories each at the 44th edition of the Boclassic in Bolzano, Italy,yesterday. \nTamirat Tola won the men’s 10km race in 28:12,  while Netsanet Gudeta took the honours in the women’s 5km in 15:46.", "Woman gives birth to four babies in Northern #Ethiopia.", "#Ethiopia has successfully completed its two-year term in the UN Security Council today, December 31st, 2018.", "#Ethiopia defended Africa’s positions on issues of peace and security, promoted enhanced cooperation & partnership between #UN and #AU,advanced balanced & principled positions on international issues and worked to strengthen the role of UN Peacekeeping. #EthiopiaatUN", "#Ethiopia: Abiy Ahmed: The Ethiopian Prime Minister who captured Africa's imagination - CNN", "#Ethiopia: OLF Delegation led by Gelassa Dilbo returend to Ethiopia today. Higher Officials from the Oromo Democratic Party have received them at Bole International Airport.  The Welcoming ceremony of the delegation will be held at Oromo Culture Centre here in Addis Ababa.", "P.M Abiy Ahmed today launched a national initiative to improve Ethiopia’s investment climate ultimately contributing huge impact on job creation program at national level. #@PMEthiopia", "#Ethiopia: Ethiopian parliament has approved draft proclamation to establish Reconciliation Commission to ensure sustainable peace, justice and national unity in the country.", "#Ethiopia: Oromia Police Commission has expressed  readiness to take necessary measures against those forces who are instigating violence in Oromia Regional State.", "PM Abiy Ahmed talked to Ambo Preparatory School students this morning. Stating that Ambo is the statue of Oromo liberation, he asked the students to reflect on the immense potential & future possibilities for this generation & encouraged them to prepare themselves to realize it. https://twitter.com/PMEthiopia/status/1077104574555553792/photo/1pic.twitter.com/xwOjhWHltJ ", "644 million birr grant agreement has been signed b/n #Ethiopia and the #EU. The grant is to improve health and nutrition of Ethiopian citizens with specific emphasis on improving health and nutrition of women and adolescent girls and children under five years of age.", "#Ethiopia: Foreign Minister Workneh Gebeyehu welcomed Prof. Asmerom Legesse, a renowned Eritrean scholar at his offices today  with great honor and privilege and thanked him for his relentless contribution to introducing the Gadaa System to the world.", "#Ethiopia: Prime Minister Abiy Ahmed is attending the National Tax Revenue Movement launching ceremony under the theme “Delivering on my Responsibility! Demanding my Rights!” #PMOEthiopia", "#Ethiopia: Deputy Prime Minister Demeke Mekonnen met with the President of the Republic of the #Sudan, Omar al-Bashir in Khartoum on Wednesday.", "Ethiopian Parliament has approved the draft proclamation to establish the Boundary and Identity Affairs Commission with majority vote", "Ethiopian Parliament declares a National Day of mourning for the former Ethiopian President Girma W/Giorgis to be effected for Wednesday, December 19, 2018.EBC", "#Ethiopia  Abba Gada's, Religious leaders, and elders have discussed with Somaliland religious leaders on the relations between the peoples' of the two countries.", "#Ethiopia: Awol Arba elected as chief administrator of Afar Regional State.", "#Ethiopia: World Health Organization (#WHO) Director General Dr. Tedros Adhanom expressed deepest condolence on the passing of former Ethiopian President Girma W/giorgis.", "Former Ethiopian President Girma W/Giorgis passed away at the age of 94 while he was admitted in Tor Hailoch hospital last night. #EBC", "#Ethiopia: European ambassadors have lauded the changes  that  are observed in Ethiopia under the leadership of Ethiopian Prime Minister Dr. Abiy Ahmed. They also appreciated Ethiopia's role in bringing horn African countries together. The ambassadors vowed to support Ethiopia.", "#Ethiopia: Ethiopian Prime Minister Dr. Abiy Ahmed held discussion with 30 European ambassadors.", "#Ethiopia: 66 of the Ethiopian soldiers who were marched on the Prime Minister's Office last October were punished  by the military court.", "President Isaias Afwerki will proceed from Mogadishu to Nairobi for a working visit to the Republic of #Kenya on the invitation of President Uhuru Kenyatta.\nSource: Eritrean Information Minister", "President Isaias Afwerki has departed to Mogadishu today for a working visit to the Federal Republic of Somalia.  President Isaias's  historic visit is part and parcel of the consultative Tripartite Summits of the Heads of State and Government of #Eritrea, #Ethiopia and @Somalia", "#Ethiopia: A panel discussion is being held on the current status of Ethiopian Grand Renaissance Dam. It is disclosed that the civil work of the dam has reached 80-82%, while its electro- mechanical work has reached 23-25%", "#Ethiopia: Ethiopian polices arrests two former National Intelligence and Security Service (NISS) senior officials.  They are suspected of human rights violations.", "#Ethiopia: Prime Minister Abiy Ahmed and Presidents al-Bashir and Omar Guelleh visited the new Jimma Medical Centre and its expansion project. The hospital provides service to 15million people with 1600 staff members, 32 intensive care units, 800 beds. \n#PMOEthiopia", "Sudanese President Omar al- Bashir has arrived in Jimma to visit development projects in the city. #Ethiopia #Sudan", "Djibouti's President Ismail Omar Guelleh arrived in Jimma to visit Development projects in the city. Upon arrival he received warm welcome from Ethiopian Prime Minister Dr. Abiy Ahmed. #Ethiopia #Djibouti.", "#Ethiopia: Ethiopian Prime Minister Dr. Abiy Ahmed and First lady Zinash Tayachaw arrived in Jimma  to visit  development projects in the city", "#Ethiopia: \"Although we speak different languages, we have one  language in common, i.e. Ethiopianism\"- Prime Minister Dr. Abiy Ahmed.", "#Ethiopia: Prime Minister Dr. Abiy Ahmed is set to welcome President Omar al-Bashir of #Sudan and President Ismail Omar Guelleh of #Djibouti at Jimma Airport, today for a visit to development projects in the city. @PMO", "#Ethiopia: PM Abiy Ahmed held discussions with Mr. Borge Brende, President of the World Economic Forum (WEF), who officially invited PM Abiy Ahmed to attend the upcoming World Economic Forum scheduled to take place in Davos, #Switzerland in January, 2018.\n#PMOEthiopia", "\"Although we speak different languages, we have one  language in common, i.e. Ethiopianism\"- Prime Minister Dr. Abiy Ahmed.", "My visit to #Ethiopia is a signal that it is one of our most important partners in #Africa. My discussions in Addis Ababa today w PM Abiy Ahmed have again proven one fact: We not only have good bilateral relations but we share a common interest in a prosperous future for Africa.", "Good meeting in Addis Ababa with representatives of the @_AfricanUnion where we discussed the EU-African-Forum #africaeurope2018 and common challenges such as creating perspectives for young people in Africa, development cooperation and #migration.", "I was touched by the very warm welcome by Prime Minister of #Ethiopia Abiy Ahmed in Addis Ababa today.", "It was a great pleasure to meet the president of #Ethiopia @SahleWorkZewde, the first woman to hold this office. We both want to further strengthen our bilateral ties as well as those between the #EU & the @_AfricanUnion.", "#Ethiopia: Political parties based in Oromia have agreed  to establish a forum.", "#Djibouti's FM said #Eritrean President will visit to his country.\n“#Ethiopian Prime Minister Abiy Ahmed is launching initiatives that create conducive environment for the reconciliation and he broadened the scope of the stability and prospect for peace in the region,” he said.", "#Ethiopia: Ethiopian Federal Police arrested 5 officials of Benishangul Gumuz Regional State who are suspected to be involved in recent conflicts happened in Oromia and Benishangul Gumuz states border areas.", "The #USA has renewed a “permanent diplomatic presence” in #Somalia, the State Department said, nearly 30 years after the U.S. embassy was closed as a civil war raged in the Horn of Africa country. (Via Reuters)", "#US Assistant Secretary of State for African Affairs Tibor Naggy  met Eritrean President Esaias Afeworki.  Both sides agreed to work together to consolidate the @Eritrea-#Ethiopia Peace Agreement.", "#Ethiopia  to start MasterCard service to enhance transaction. It has to be recalled that the country has allowed On Arrival Visa for Africans visiting Ethiopia.", "The Global Citizen Festival held in Johannesburg on Sunday raised 100 billion rand ($7.3 billion) in pledges from world leaders and organizations to end extreme poverty in #Africa.", "\"We would like to have the same type of positive relations with #Eritrea as we do with #Ethiopia,\" a key ally  the Assistant Secretary of State for African Affairs Tibor Nagy said during a visit to its capital Addis Ababa.", "Extremely productive meeting @EthioInvestment with US Assistant Secretary of State HE Tibor Nagy @AsstSecStateAF in increasing US investments to Ethiopia and tapping into #AGOA, #OPIC and #MCC, and starting direct Bilateral Trade talks between #US and #Ethiopia.", "#Ethiopia, #Sudan, reiterates importance of establishing joint forces to secure common border.", "#Ethopia has  passed Dubai, the world’s busiest airport by international traffic and the third-busiest by passenger traffic, as the lead gateway to sub-Saharan Africa.", "#Ethiopia: Oromo Democratic Party (ODP) and Oromo Democratic Front (ODF) have signed a Memorandum of Understanding to work together. ODP is a member of the ruling coalition, while ODF is one of the political parties that were returned back to Ethiopia recently from exile.", "#Ethiopia: Ethiopian Prime Minister Dr. Abiy Ahmed and members of 81 political parties are discussing on the reforms required to ensure the upcoming election is free, fair,  credible and the shared responsibilities of all. (Source: PM Office)", "#Ethiopia: The International Organization for Migration (IOM) announced on Monday that it has evacuated over 100  voluntary Ethiopian migrants in Yemen through Sanaa International Airport.", "#Ethiopia: Prime Minister Dr. Abiy Ahmed has started the meeting with 81 opposition political parties, including those who have arrived from out of the country recently. (Source: Office of PM)", "The European Investment Bank (EIB) has signed a new 15 year US$227mn loan agreement with the African Export-Import Bank (Afreximbank). The loan aims to support trade-related productive investments in Africa. (Source: African Review)", "#Ethiopia and  UK have agreed to expand bilateral cooperation. The trade volume between Ethiopia and the #UK has reached $2 billion.", "#Ethiopia: “If we can conduct free, fair, and credible election, whoever wins with the election, the final winner will be Ethiopia” – Prime Minister Dr. Abiy Ahmed", "PM Abiy Ahmed  at opening of the conference on ‘Political Reform in #Ethiopia highlighted that we now stand a political crossroads which requires us to ask whether we use this as a golden opportunity or backtrack the progress we have made thus far through the reforms.#PMOEthiopia", "#Ethiopia: Ethiopian Electoral Board Chairperson Birtukan Mideksa, Ethiopian Prime Minister Dr. Abiy Ahmed, and Ethiopian Federal Supreme Court President Meaza Ashenafi, (In Pictures)", "#Ethiopia: US Assistant Secretary of State for African Affairs Tibor P. Nagy to visit Ethiopia.", "Prime Minister Abiy Ahmed met with a delegation of the European Investment Bank (EIB) comprising Werner Hoyer (Bank President) and its vice today, to discuss on common issues of cooperation and future financing options for development projects in Ethiopia.\n  #PMOEthiopia", "#Ethiopia: Ethiopian Parliament has approved the appointment of Birtukan Mideksa as Election Board Chairperson. She served as a judge in a Federal court. She was also member of the opposition party.", "#Ethiopia: Ethiopian Parliament to approve the appointment of Election Board Chairperson tomorrow.", "Major General Kife Dagnew appears in the Fedral High Court with his lawyer today in association with corruption charges.\nHe asked for public defense lawyer claiming that he cannot afford to pay on his own, last Wednesday.", "Afar Regional State and Central Committee of the Afar National Democratic Party agreed that in order to be part of nation wide reform and make the reforms much more successful, veteran party officials will make space for new leadership to takeover.#Afar#Ethiopia", "Afar Regional State and Central Committee of the Afar National Democratic Party agreed that in order to be part of nation wide reform and make the reforms much more successful, veteran party officials will make space for new leadership to takeover.#Afar#Ethiopia", "#Ethiopia: PM Abiy met  Marie-Claude Bibeau, Minister of Int'l Dev't of the Government of Canada  today. Bibeau reaffirmed her Government’s support to Ethiopia in the democratization and development reforms going on in the country. (Source: Office of PM)", "#Ethiopia: Prime Minister  Abiy  in a press release he gave today said, Ethiopia should not be the country in which criminals will live in proudly. He also said the process to bring criminals to justice will continue, and the plan is to make the country free from criminals.", "#Ethiopia:Police arrests  former Ethiopian National Intelligence and Security Service (NISS) Deputy head Yared Zarihun. He was also served as Federal Police Commission Commissioner.", "ODP and OLF have agreed to work together for the development of the country. It has to be recalled that the two parties have signed an agreement in Asmara. #Ethiopia", "Prime Minister Dr. Abiy Ahmed received Dimitris Avramopoulos, Commissioner of Migration, Home Affairs and Citizenship of the European Commission and his delegation. The have discussed on ways of enhancing historical ties and strategic alliance b/n  Africa and Europe. #Ethiopia", "Former Metals and Engineering Corporation (METEC) General Director  Brigadier General Kinfe Dagnaw is arrested. #Ethiopia", "Ethiopian Federal Attorney General has announced the arrest of 63 suspects who are suspected of human right abuses in different torture houses, bomb attack on the Prime Minister Dr. Abiy Ahmed support rally, and corruption cases of Metals and Engineering Corporation. #Ethiopia", "ክቡር ጠ/ሚር አብይ አህመድ ለኤርትራው ፕሬዝዳንት ኢሳያስ አፈወርቂና ለሶማሊያዉ ፕሬዝዳንት መሀመድ አብዱላሂ ፋርማጆ መሀመድ ሽኝት አድርገዋል::\n\nH.E. Prime Minster Abiy Ahmed has bid farewell to the Presidents of Eritrea and Somalia.", "Ethiopian Prime Minister Dr. Abiy Ahmed urges health graduates to deliver free health services in #Somalia and #Eritrea. #Ethiopia", "Ethiopin Prime Minister Abiy Ahmed, Eritrean President Esaias Afeworki and Somalian President Mohammed Abdullahi Mohammed have visited Lake Tana. #Ethiopia #Somalia #Eritrea (Photo Credit: PM Office)", "The next tripartite meeting  of #Ethiopia, #Somalia and #Eritrea will be held in  Somalia, Mogadishu.", "Joint Statement from the Leaders of #Ethiopia, #Eritrea and #Somalia (Source: Office of PM)", "Ethiopian Prime Minister Dr. Abiy Ahmed, Eritrean President Esaias Afeworki and Somalian President Mohammed Abdullahi Mohammed have visited Bure Agro-Industry Park. ( Source:- Office of PM). #Ethiopia #Eritrea #Somalia", "Prime Minister Dr. Abiy Ahmed and Presidents of Eritrea and Somalia have  visited Dembia Woreda irrigation Project. #Ethiopia #Somalia #Eritrea", "The Prime Minister and his Deputy in Gonder (In Pictures)", "Ethiopian Prime Minister Dr. Abiy Ahmed, Eritrean President Esaias Afeworki and Somalian President Mohammed Abdullahi Mohammed are currently visiting Gonder University. #Ethiopia #Eritrea #Somalia", "Welcoming ceremony of Eritrean President Esaias Afeworki in Gonder, Ethiopia. #Ethiopia #Eritrea", "Eritrean President Esaias Afeworki and Somalian President Mohammed Abdullahi Mohammed have arrived in Ethiopia’s historical city of Gonder for tripartite summit.#Ethiopia #Eritrea #Somalia", "I wanted to announce that I will be moving back to Ethiopian Investment Commission—as a Commissioner. I have enjoyed my time immensely as a Chief of Staff serving a historic Prime Minister who will no doubt transform the country for the better. #Ethiopia", "The UN Security Council is preparing to lift sanctions on Eritrea, diplomats said Friday. The decision to lift the sanction is said to be made on November 14, 2018. #Eritrea #UNSC\nhttps://www.france24.com/en/20181102-un-lift-sanctions-eritrea-after-us-shift?ref=tw …", "The U.S. government has provided $125,000  to restore Abba Jifar palace  with additional funds, approximately $220,000, provided by the Ethiopian Authority for Research and Conservation of Cultural Heritage and the Oromia Culture and Tourism Bureau. #Ethiopia #US", "The Government of #Ethiopia officially launched the issuance of visa on arrival for all African citizens, at an event held on Thursday (November 1) at the Headquarters of the African Union.", "Meaza Ashenafi and Solomon Areda elected as President and Vice president of Ethiopia's Federal Supreme Court respectively. #Ethiopia", "Ethiopian Prime Minister Dr. Abiy Ahmed arrives in Frankfurt to meet Ethiopian Diaspora. #Ethiopia #Germany", "World Bank approves $1.2 bln in grants, loans to Ethiopia. #Ethiopia #World", "\"Armed groups operating in the name of OLF and engaged in violence in Western Oromia should refrain from their acts. Unless the government will take appropriate measures to enforce the law and safeguard the security of citizens\"- Lemma Megers, Oromia State President. #Ethiopia", "Ethiopian Prime Minister Dr. Abiy Ahmed arrives in German, Berlin for official visit today. #Ethiopia #Germany", "Ethiopian Prime Minister Dr. Abiy Ahmed with French President (In Pictures)", "Ethiopian Prime Minister Dr. Abiy Ahmed meets French President Emmanuel Macron today. #Ethiopia #France", "Ethiopian Prime Minister Dr. Abiy Ahmed arrived at Paris, France for official visit. He is expected to meet French President Emmanuel Macron and will fly to Germany after concluding France visit. #Ethiopia #France", "Air pollution is the “new tobacco”,  Dr.  Tedros Adhanom, head of the World Health Organization has warned, saying the simple act of breathing is killing 7 million people a year and harming billions more. #WHO #Ethiopia", "Women Leaders in the World.#Ethiopia", "Uganda levied 2% tax on alcoholic drinks and soft drinks to raise funds for HIV treatment.#Ethiopia #Uganda", "Prime Minister Dr. Abiy  met  Mr. António Vitorino, DG of the International Organization for Migration. PM Abiy appreciated @IOM’s work & commitment to the orderly and humane management of migration, and requested  IOM to enhance its engagement in #Ethiopia ( via,Office of PM)", "Consistent with PM Abiy Ahmed’s vision of a closer and full regional integration in #Africa—where minds are open to ideas and markets are open to trade, Ethiopia will start on arrival visa to all Africans starting from November 9, 2018. #Ethiopia @AfricanUnion", "U.S congratulates Ambassador Sahelwork Zewde on her selection as Ethiopia’s first woman President. #Ethiopia", "UN Chief congratulates Sahle-Work Zewde &  Ethiopians, on the first woman president & new cabinet in which women ministers head key departments. The African continent is leading the way in showcasing that women's engagement and leadership are crucial to lasting peace. #Ethiopia", "#Ethiopia elected to be a member of the United Nations Committee on the Peaceful Uses of Outer Space. ( Source: Ethiopia at #UN)", "#Ethiopia and #Norway, long-term partners in the fight against #climatechange, signed yesterday a grant agreement amounting 180 million Norwegian kroner (about €19 million) to support Ethiopia’s Climate Resilient Green Economy (CRGE) Strategy. ( Source: Ethiopia Mission EU)", "\"Congratulations to my sister @SahleWorkZewde on your election as the first female President of #Ethiopia . Wishing great success to you and all the people of our country\",  Dr. Tedros Adhanom, WHO Director General.", "Foreign Ministers of #Eritrea, #Ethiopia and #Italy held  tripartite meeting on the margins of the Second Italy-Africa Forum in Rome.  They discussed on ways to enhance economic cooperation; joint work for stabilization of Somalia; as well as lifting of UNSC sanctions on Eritrea", "The Chairperson of the Commission of the African Union, Moussa Faki Mahamat, welcomes the election, today, of Ambassador Sahle-Work\nZewde as the new President of the Federal Democratic Republic of Ethiopia by the Ethiopian parliament. #Ethiopia", "Ambassador Sahlework Zewde appointed as Ethiopia's President. She became the first female president in Ethiopian History. #Ethiopia", "Ethiopian President Dr. Mulatu Teshome resigns. The joint session of Ethiopian House of Peoples' Representatives and House of Federation is expected to appoint the new president today.", "Calzedonia, one of Italy’s biggest apparel manufacturer, inaugurated its first #Africa factory in #Mekele. Given the logistical proximity to #Massawa, the investment will strengthen the regional economy. PM Abiy congratulates the Calzedonia’s team. #Ethiopia #Eritrea.", "UN Chief Antonio Guterres commended  Ethiopian Prime Minister Dr. Abiy Ahmed for appointing a cabinet with full gender parity.  Women’s leadership & gender equality in all areas are not only priorities for the UN and the AU, but essential to a peaceful & prosperous world.", "HE PM Dr Abiy Ahmed met this afternoon with Dr Peter Sands, Executive Director, Global Fund For AIDS, Tuberclousis & Malaria. PM Abiy appreciated the strong & sustained support & assured the Fund his committment to ensure the use of the resources for intended purposes. #Ethiopia", "Update: Here is a list of merged, reorganized and new Federal Government Organs according to Proclamation 1097/2018. #Ethiopia", "Here is the list of the Federal Ministries/ Commissions and their accountable federal government organs according to Proclamation 1097/2018 that defines the power and duties of the Executive Organ of the Federal Democratic Republic of Ethiopia. #Ethiopia", "Ethiopian parliament has approved the appointment of 16 new cabinets today. #Ethiopia", "Ethiopian Prime Minister presents Mufarit Kamil  to be Ethiopian Minister of Peace. #Ethiopia", "Ethiopian Prime Minister Dr. Abiy Ahmed appoints 50%  women as Ethiopian Cabinet members. According to the Prime minister, this decision is the first in the history of Ethiopia and probably in Africa.#Ethiopia", "Ethiopian Parliaments has approved the proclamation to determine the powers and duties of the executive organs. #Ethiopia", "The President of the Republic of Slovenia Borut Pahor met Ethiopian President Dr. Mulatu Teshome here in Addis Ababa today.\nThe two leaders have discussed on ways of advancing bilateral relations of the two countries in investment, trade, and others sectors. #Ethiopia #Slovenia", "https://www.facebook.com/EBCzena/posts/2163284693703395 …", "የወቅቱ ጠቅላይ ሚኒስትር ዶ/ር ዐቢይ አህመድ እና የቀድሞው ጠቅላይ ሚኒስትር አቶ ኃይለማርያም ደሳለኝ በጋራ ሆነው ፕሮጀክት ለመጎብኘት በተገናኙበት ወቅት በተለያዩ ጉዳዮች ላይ ውይይት አድርገዋል", "“ [Prime Minsiter Abiy Ahmed] is taking bold decisions in restoring peace and security... in the region. [AfDB] is here to support the vision of the Prime Minister.” President of African Development Bank (#AfDB) Akinwumi Adesina #Ethiopia", "Ethiopian Prime Minister Dr. Abiy Ahmed meets #AfDB delegation led by AfDB President Akinwumi Adesina and discussed on ways the bank can support Ethiopia's irrigation sector, youth job creation, energy and private sector dev't. (Source: Office of PM). #Ethiopia", "የትምህርት ሚኒስቴር የየከፍተኛ ትምህርት ተቋማትን የተማሪዎች የቅበላ ጊዜ ይፋ አደረገ https://www.facebook.com/EBCzena/posts/2161102410588290 …", "#EBC በወቅታዊ ጉዳይ ላይ የተደረገ ውይይት ክፍል 2", "#EBC በወቅታዊ ጉዳይ ላይ የተደረገ ውይይት ክፍል 1", "ጠ/ሚኒስትር ዶ/ር ዐቢይ አህመድ በሞተር የሚሰሩ 36 ዊልቸሮችን ለአካል ጉዳተኞች ለገሱ", "ጠቅላይ ሚኒስትር ዶ/ር አብይ አህመድ ለጣሊያን ጠቅላይ ሚኒስትር ጁሴፔ ኮንቴ በብሄራዊ  ቤተመንግስት የራት ግብዣ  አድርገዋል፡፡", "Italian Prime Minister Giuseppe Conte arrived at Addis Ababa, Ethiopia.  Up on his arrival, Ethiopian Prime Minister Dr. Abiy Ahmed and Foreign Minister Dr. Workineh Gebeyehu welcomed him. #Ethiopia #Italy", "የጣሊያኑ ጠቅላይ ሚኒስትር አዲስ አበባ ገቡ\n****************\nየጣሊያኑ ጠቅላይ ሚኒስትር ጁሴፔ ኮንቴ ዛሬ አዲስ አበባ የገቡ ሲሆን፣ ጠቅላይ ሚኒስትር ዶ/ር ዐቢይ አህመድና የውጭ ጉዳይ ሚኒስትር ዶ/ር ወርቅነህ ገበየሁ አቀባበል አድርጋውላቸዋል፡፡", "#EBC የኢህአዴግ ጉዞ እና ወቅታዊ ሁኔታ ላይ ያተኮረ ውይይት ክፍል 2", "#EBC የኢህአዲግ ጉዞ እና ወቅታዊ ሁኔታ ላይ ያተኮረ ውይይት ክፍል 1", "Ethiopian government urges OLF to disarm those members of the Front that were not disarmed yet. Ethiopian Government Communication Affairs State Minister Kassahun Gofe said government will take disarmament measures if the OLF is not willing to disarm its members. #Ethiopia", "ከኤርትራ ወደ ኢትዮጵያ የገቡት የትግራይ ህዝብ ዴሞክራሲያዊ ንቅናቄ (ደምህት) ወታደሮች በውቅሮ ከተማ የቁርስ ግብዣ ተደርጎላቸዋል፡፡", "አይኤምኤፍ የ2018/19 የዓለም ምጣኔ ሀብት ዕድገት ትንበያውን ከለሰ http://5.77.45.143/web/ebcnews/-/-2018-19-", "ፕሬዝዳንት ዶ/ር ሙላቱ ተሾመ ለይፋዊ የስራ ጉብኝት ወደ ቱርክ አቀኑ http://5.77.45.143/web/ebcnews/-/--1645", "2ኛው የአፍሪካና ቱርክ የኢኮኖሚና ቢዝነስ ፎረም ከነገ ጀምሮ በኢስታምቡል ይካሄዳል http://5.77.45.143/web/ebcnews/-/2--1", "በአነስተኛ ማሳ ላይ ለሚሰሩ አርሶ አደሮች በበሬ ዋጋ ዘመናዊ ማረሻ ሊቀርብ ነው http://5.77.45.143/web/ebcnews/-/--1642", "In relation to the recent conflict that erupted in Burayu town, Gamo elders and Oromo Abba Gadas made reconciliation today.", "የአፍሪካ ሀገሮችና ጃፓን ዘላቂ ልማት ለማስመዝገብ በሚያስችሉ ጉዳዮች ላይ ተስማሙ http://5.77.45.143/web/ebcnews/-/--1639", "የ2011 ዓ.ም የፌዴሬሽንና የህዝብ ተወካዮች ምክር ቤት የጋራ ስብሰባ የመክፈቻ ስነ ስርዓት በፎቶ \n\nምንጭ፤ የኢህአዴግ ጽ/ቤት", "የኢሬቻ በዓል በቡራዩ መልካ አቴቴ፣ በገላን ጨፌ ቱማና በሰበታ መልካ ሰበታ እየተከበረ ነው", "#EBC ጠቅላይ ሚንስትር ዶ/ር ዐቢይ አህመድ በሃዋሳ ስቴዲየም ደማቅ አቀባበልና ምርቃት ላደረጉላቸው የሲዳማ ሽማግሌዎች እና ለሃዋሳ ከተማ ነዋሪዎች ታላቅ ምስጋና አቀረቡ::", "የሲዳማ ሽማግሌዎች እና የሃዋሳ ከተማ ነዋሪዎች 11ኛው የኢህአዴግ ድርጅታዊ ጉባዔ ተሳታፊዎችን በሃዋሳ ስታዲየም ተገኝተው በዚህ መልኩ ነበር አሸኛኘት ያደረጉት!!", "የሲዳማ የሀገር ሽማግሌዎች  እንኳን ደህና መጣችሁ  በማለት በኢህአዲግ 11ኛ ጉባኤ ለተሳተፉ አመራሮች  ቡርሳሜ የተሰኘ ከእንሰት የተሰራ ባህላዊ የቁርስ ግብዣ አደረጉ ።", "Dr. Abiy Ahmed re- elected as Chairman the ruling Ethiopian Peoples' Revolutionary Democratic Front (EPRDF).  Mr. Demeke Mekonnen also re- elected as Deputy Chairman of EPRDF. #Ethiopia", "https://www.facebook.com/EBCzena/posts/2149564411742090 …", "የድምፅ አሰጣጡ ስነ ስርዓት ተጠናቆ የቆጠራ ስነ ስርዓት እየተካሄደ ነው", "Ethiopian #peacekeepers in #Juba receive medals during a celebratory ceremony in honor of their service for #peace in #South Sudan. #Ethiopia", "Amb. Taye Atskeselassie met with Deputy Secretary-General of the UN, Ms. Amina Mohammed & briefed her about recent developments in #Ethiopia & the Horn of Africa region. Deputy Secretary Amina assured the Ambassador that the #UN continues supporting these developments.", "ከሰሀራ በታች ያሉ የአፍሪካ ሀገራት አዝጋሚ ዕድገት እያሳዮ ነው፦ አለም ባንክ http://5.77.45.143/web/ebcnews/-/--1619", "ከሰሀራ በታች ያሉ የአፍሪካ ሀገራት አዝጋሚ ዕድገት እያሳዮ ነው፦ አለም ባንክ http://5.77.45.143/web/ebcnews/-/--1616", "#EBC ዘጋቢ ፊልም \"ጠመዝማዛው መንገድ\"", "\"Our forefathers liberated Africa politically, and current African leaders like Dr. Abiy Ahmed need to liberate Africa economically\" The Tanzanian Chama Cha Mapinduzi party represenatative said on EPRDF 11th organizational conference. #Ethiopia", "EPRDF stars its 11th conference at Hawassa. EPRDF friend parties invited from abroad have attended the event. #Ethiopia", "አዴፓ65  የማዕከላዊ ኮሚቴ አበላትን መረጠ፡፡\n\nበአዲሱ የማዕከላዊ  ኮሚቴ አበላት ምርጫ አዳዲስ አበላት በብዛት ተመርጠዋል\n\nዝርዝሩን ከደቂቃዎች በኋላ እናቀርባለን", "#EBC ኢቲቪ 57 ቢዝነስ ምሽት 2 ሰዓት ዜና …መስከረም 21/2011 ዓ.ም - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-ebc-57-2-21-2011- …", "በዘንድሮው ዓመት የሁለተኛ ደረጃ ትምህርታቸውን ካጠናቀቁ ኤርትራውያን ስደተኞች መካከል 150ዎቹ በኢትዮጵያ ከፍተኛ ትምህርት ተቋማት በነጻ ይማራሉ http://5.77.45.143/web/ebcnews/-/-15-1", "Ethiopia's Federal Attorney General announces that it has completed investigation on the financiers of the suspects of the bomb blast that happened here in Addis Ababa last June, and the result will be publicized next week. #Ethiopia", "The Irreechaa, Oromo Thanksgiving festival was celebrated colorfully at Lake Arsedi (Hora Arsedi) of Bishoftu town. Abba Gadas, tourists and millions of people have attended the event. #Ethiopia", "https://www.youtube.com/watch?v=P8wcIa9t_fQ … https://www.youtube.com/watch?v=P8wcIa9t_fQ …", "የኢሬቻ በዓል አከባበር ልዩ ባህላዊ ገጽታዎች የሚያሳዩ ተጨማሪ ፎቶዎች!!", "የኢሬቻ በዓል አከባበር ልዩ ገጽታዎች በፎቶ ሲቃኝ!!", "ሚሊዮኖች ተሳታፊ በሆኑበት የዘንድሮው ታላቁ የኢሬቻ በዓል ላይ የተለያዩ የአገሪቱ ብሄር ብሄረሰቦች ተሳታፊ ነበሩ፡፡", "The Irreechaa festival, which is the thanksgiving day of the Oromo people will be celebrated tomorrow at Hora Arsedi of Bishoftu town. #Ethiopia", "#EBC etv የቀን 6 ሰዓት ቢዝነስ ዜና…መስከረም 19/2011 ዓ.ም", "የውጭ ጉዳይ ሚኒስትር  ዶ/ር ወርቅነህ ገበየሁ ከአሜሪካ አቻቸው   ማይክ ፖምፒዎ ጋር ተወያዩ፡፡\n\nሚኒስትሮቹ በሁለትዮሽና በቀጠናዊ ጉዳዮች ላይ ያሉ ትብብሮችን ማጠናከር በሚቻልበት ጉዳይ ላይ ተወያይተዋል፡፡", "#EBC ኢቲቪ 57 ምሽት 2 ሰዓት አማርኛ ዜና በቀጥታ ይከታተሉ \n\nhttps://www.youtube.com/live_dashboard ", "https://www.youtube.com/live_dashboard  https://www.youtube.com/live_dashboard ", "#EBC የከፍተኛ ትምህርት አግባብነትና ጥራት ኤጀንሲ ም/ዋና ዳይሬክተር አቶ ታምራት ሞታ ጋር የተደረገ ቆይታ", "https://www.facebook.com/story.php?story_fbid=2139598362738695&id=541629952535552 …", "Ethiopian Christians are celebrating the finding of the true cross, 'Demera' festival across the nation.  #Ethiopia", "Dr. Workneh Gebeyehu met with United Nations Secretary-General António Guterres on the sidelines of #UNGA73 and exchanged views on developments in Ethiopia and the Horn of Africa region.  #Ethiopia #UN", "የህንዱ ፕሬዚዳንት አንድራ ሞዲ 500 ሚሊዮን ደሃ ህንዳዊያንን ተጠቃሚ የሚያደርግ በአለም ትልቅ የተባለለትን የጤና መድህን ይፋ አደረጉ http://5.77.45.143/web/ebcnews/-/--1575", "PM Abiy Ahmed met with a delegation from IMF who are here for the annual “Article IV Consultations.” The #IMF team presented their findings on the economic & financial developments in #Ethiopia. PM Abiy noted sustaining Ethiopia’s rapid & stable growth is his utmost priority.", "በዛሬው ዕለት ለሚካሄደው የፊፋ የአመቱ ኮከቦች ምርጫ እንግሊዝ የሚገኙት የኢትዮጵያ ብሔራዊ ቡድን ዋና አሰልጣኝ ኢንስትራክተር አብርሃም መብራቱ ከተለያዩ አለም አገራት ከተጋበዙ የብሔራዊ ቡድን አሰልጣኞች እና ተዋቂ ተጨዋቾች ጋር", "#EBC etv መድረክ - የህግ የበላይነት ላይ የቀረበ ውይይት", "#EBC የልቦና ውቅር - ኢትዮጵያዊነት ፤ አሰባሳቢ ማንነት በአንድ አገር ልጅነት - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-e-53 …", "#EBC የአባይ ዘመን - ጮቄ ከየት ወዴት - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-e-55 …", "#EBC እሁድ ስፖርት - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-e-52 …", "#EBC ኢቲቪ የቀን 7 ሰዓት ስፖርት ዜና…መስከረም 13/2011 ዓ.ም - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-ebc-7-13-201-9 …", "ብርቱ ወግ\n\n በራኒ ማንጎ ዙሪያ \nከኢትዮጵያ ምግብ መድሃኒት ጤና እንክብካቤ አስተዳደርና ቁጥጥር ባለስልጣን በቅርቡ ዋና ዳይሬክተር የሆኑት ወ/ሪት ሔራን ገርባ ጋር የተደረገ ቆይታ ክፍል - 2 http://www.ebc.et/web/ebcnews/-/-ebc-9 …", "\"ፈታኝ ሳጥን/Fetagn satin\" ከተናፈቀችው አርቲስት ባዩሽ አለማየሁ ጋር ዕሁድ ምሽት ይጠብቁን\n\nበዳዊት ጣሰው", "#EBC ኢቲቪ 57 ምሽት 2 ሰዓት ቢዝነስ ዜና…መስከረም 11/2011 ዓ.ም", "#EBC ኢቲቪ 4 ማዕዘን የቀን 7 ሰዓት ቢዝነስ ዜና…መስከረም 11/2011 ዓ.ም - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-ebc-4-7-11-2011- …", "#EBC ኢቲቪ 4 ማዕዘን የቀን 7 ሰዓት ስፖርት ዜና…መስከረም 11/2011 ዓ.ም", "Ethiopia's  Amb. to UN Taye Atskesellassie met UN Under Secretary General for Economic & Social Affairs, Mr. Lui Zhenmin, discussed about enhancing cooperation between #Ethiopia and DESA to accelerate implementation of the 2030 Agenda for Sustainable Development.", "#EBC ኢቲቪ 4 ማዕዘን የቀን 7 ሰዓት ቢዝነስ ዜና…መስከረም 09/2011 ዓ.ም HD", "የኢትዮጵያ መንግስትና ኦብነግ በአስመራ ተወያዩ http://5.77.45.143/web/ebcnews/-/--1551", "#EBC ኢቲቪ 57 ምሽት 2 ሰዓት ቢዝነስ ዜና…መስከረም 07/2011 ዓ.ም - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-ebc-57-2-07-2011- …", "Police arrested more than 600 individuals involved in recent Burayu and Addis Ababa conflicts. In Addis Ababa, Police has taken measures against some groups  that tried to instigate ethnic violence and tried to snatch weapons from police and 5 died as a result. #Ethiopia", "#EBC የአፍላው ዳና - ዘጋቢ ፊልም - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-e-51 …", "#EBC ኢቲቪ 4 ማዕዘን የቀን 7 ሰዓት ስፖርት ዜና…መስከረም 07/2011 ዓ.ም - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-ebc-4-7-07-201-3 …", "#EBC ጤና ይስጥልኝ ኢትዮጵያ...መስከረም 07/2011", "ጠቅላይ ሚ/ር አብይ በአዲስ አበባ ዙሪያ የደረሰውን ግድያ: ድብድባና ዘረፋ በጥብቅ አውግዘው መንግስት አጣርቶ ተገቢ እርምጃ እንደሚውስድ ገልጸዋል:: ህይወታቸው ላለፈ ወገኖች የተሰማቸውን ጥልቅ ሃዘን ገልጸው ለቤተሰቦቻቸው መጽናናትን ተመኝተዋል::", "ጠቅላይ ሚኒስትር ዶ/ር ዐቢይ አህመድ እና ፕሬዝዳንት ኢሳያስ አፈወርቂ የሳኡዲ አረቢያን ከፍተኛ የኒሻን ሜዳሊያ ተሸለሙ", "ሳኡዲ አረቢያ 437,396 ህገ ወጥ ስደተኞችን ከሃገሯ አባረረች - displayPage - ebc http://www.ebc.et/web/ebcnews/-/-437-396- …", "Leaders of the Oromo Liberation Front (OLF) have arrive at Addis Ababa. The leaders were based in Eritrea. Government officials and huge number of supporters welcomed them up on arrival at Bole International Airport. #Ethiopia", "Ethiopia and  Eritrea to sign new peace agreement in Saudi. UN chief Antonio Guterres and African Union Commission chairman Moussa Faki Mahamat are also expected to attend the event. #Ethiopia #Eritrea", "ለኦሮሞ ነፃነት ግንባር (ኦነግ)  አመራሮች አቀባበል ለማድረግ በርካታ  ሰዎች ወደ መስቀል አደባባይ እየገቡ ነው", "#EBC ኢቲቪ 57 ምሽት 2 ሰዓት ቢዝነስ ዜና…መስከረም 03/2011 ዓ.ም - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-ebc-57-2-03-2011- …", "# EBC ኢቲቪ 4 ማዕዘን የ7 ሰዓት ስፖርት ዜና……. መስከረም 03/2011 - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-ebc-4-7-03-2011 …", "#EBC ኢቲቪ 4 ማዕዘን የ7 ሰዓት ቢዝነስ ዜና……. መስከረም 03/2011 - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-ebc-4-7-03-20-1 …", "\"Prime Minister Abiy Ahmed has initiated groundbreaking reforms across most every area of Ethiopian society since taking office in April.  He deserves tremendous credit for his boldness in tackling issues that previous governments have not addressed,\"- Tibor @AsstSecStateAF", "#EBC ኢቲቪ 57 ምሽት 2 ሰዓት ስፖርት ዜና…መስከረም 1/2011 ዓ.ም - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-ebc-57-2-1-201-2 …", "አሰብ አቅራብያ የሚገኘው የቡሬ - ድባይ ሲማ ድንበር የአከፋፈት ስነ ስርዓት በፎቶ", "መደመር በቡሬ ግንባር!!", "ቡሬ ግንባር ቆይታ የደረጉት ጠ/ሚንስትር ዶ/ር ዐቢይ አህመድና ፕሬዚዳንት ኢሳያስ አፈወርቂ ዛላንባሳ ግንባር ገብተዋል፡፡", "ቡሬ ግንባር", "#EBC ኢቲቪ የቀን 7 ሰዓት ስፖርት ዜና…ዻጉሜ 04/2010 ዓ.ም - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-ebc-7-04-2010- …", "#EBC ኢቲቪ 57 ምሽት 2 ሰዓት ስፖርት ዜና…ዻጉሜ 02/2010 ዓ.ም - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-ebc-57-2-02-201-1 …", "#EBC ኢቲቪ 57 ምሽት 2 ሰዓት ቢዝነስ ዜና…ዻጉሜ 02/2010 ዓ.ም - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-ebc-57-2-02-2010- …", "#EBC ኢቲቪ 4 ማዕዘን የቀን 7 ሰዓት ስፖርት ዜና…ዻጉሜ 02/2010 ዓ.ም - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-ebc-4-7-02-201-1 …", "#EBC ኢቲቪ 4 ማዕዘን የቀን 7 ሰዓት ቢዝነስ ዜና…ዻጉሜ 02/2010 ዓ.ም - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-ebc-4-7-02-2010- …", "የአስረኛ ክፍል ውጤት ዛሬ ይፋ እንደሚደረግ ተገለፀ \n\nየሀገር አቅፍ ትምህርት ምዘናና  ፈተናዎች ኤጀንሲ እንዳስተወቀው ውጤቱን በተመለከተ ዝርዝር መግለጫ 10 ሰዓት ላይ ይሰጣል፡፡", "ኢንጅነር ስመኘው በቀለ ራሳቸውን እንዳጠፉ ፖሊስ ገለጸ", "ኢንጅነር ስመኘው በቀለ ራሳቸውን ማጥፋታቸውን የፖሊስ የምርመራ  ውጤት እንደሚያሳይ ተገለፀ፡", "Ethiopian Embassy in Eritrea opening ceremony (In Pictures)", "በኤርትራ የኢትዮጵያ ኤምባሲ በይፋ ተከፈተ\n\nበኤርትራ የኢትዮጵያ ኤምባሲ በዛሬው ዕለት በይፋ ስራውን ጀመረ።\nጠ/ሚኒስትር ዶ/ር ዐቢይ አህመድ እና የኤርትራው ፕሬዚዳንት ኢሳያስ አፈወርቂ ኤምባሲውን መርቀው ከፍተዋል።\n\nበተስፋዬ አባተ", "ጠቅላይ ሚንስትር ዶ/ር ዐቢይ አህመደድ ጉብኝት በአሰብና በምጽዋ  ወደብ", "#EBC ኢቲቪ 57 ምሽት 2 ሰዓት ስፖርት ዜና…ነሐሴ 30/2010 ዓ.ም - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-ebc-57-2-30-201-4 …", "Ethiopian Prime Minister  Abiy Ahmed, Eritrean president Esaias Afeworki, and Somalia's President Mohammed Abdullahi Mohammed met in Asmara.The three leaders will hold a tripartite summit this evening on enhancement of regional ties of partnership. #Ethiopia #Eritrea #Somalia", "#EBC ኢቲቪ 57 ምሽት 2 ሰዓት ቢዝነስ ዜና…ነሐሴ 30/2010 ዓ.ም - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-ebc-57-2-30-201-3 …", "ብርቱ ወግ - የኢትዮጵያ የምግብ መድሃኒት እና ጤና እንክብካቤ ባለስልጣን አሰራር ዙሪያ የቀረበ - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/--1484 …", "#EBC እጅ ከምን - ቆይታ ከድምፃዊ ማዕበል አብረሃ /ዌቨ ስላሲያን ጋር/ - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-e-50 …", "ጠቅላይ ሚኒስትር ዶ/ር ዐቢይ አህመድ  ከአሰብ እና ምጽዋ ወደቦች ጉብኝት በኋላ አስመራ ገቡ", "ጠቅላይ ሚኒስትር ዶ/ር ዐቢይ አህመድ  የቻይና ህዝቦች ብሔራዊ ኮንግረስ  ሊቀመንበር  ሊ ዚሃነሹ ጋር በቻይና በነበራቸው ቆይታ የኢትዮጵያና የቻይና መንግስትና ፓርቲ፣ እንዲሁም የሁለቱ አገራት ህዝቦችና  ግንኙነት ላይ ውይይት አድርገዋል፡፡", "https://www.facebook.com/EBCzena/posts/2107956729236192 …", "ጠቅላይ ሚኒስትር ዶ/ር ዐቢይ አህመድ አሰብ አየር መንገድ ሲደርሱ በፕሬዝዳንት ኢሳያስ የተደረገላቸው አቀባበል (በፎቶ)", "Ethiopian Prime Minister Dr. Abiy Ahmed has arrived at Asmara and visited Assab and Massawa ports. The Prime Minister is on two days work visit in Eritrea and in his stay there he will held tripartite discussions with Somali President and Eritrean President.", "#EBC ኢቲቪ 57 ቢዝነስ ምሽት 1 ሰዓት ዜና…ነሐሴ 28/2010 ዓ.ም - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-ebc-57-1-28-201-1 …", "በ2ኛው የኢቢሲ ስፖርት ሽልማት በእግር ኳስ ዘርፍ ወንዶች የመጨረሻ ሶስት ዕጩዎች", "በ2ኛው የኢቢሲ ስፖርት ሽልማት በእግር ኳስ ዘርፍ ሴቶች የመጨረሻ ሶስት ዕጩዎች", "በ2ኛው የኢቢሲ ስፖርት ሽልማት በአትሌቲክስ ዘርፍ ወንዶች የመጨረሻ ሶስት ዕጩዎች", "የአለም አቀፉ የፖስታ ድርጅቶች ህብረት ጉባኤ በአዲስ አበባ ተጀመረ።\n\nየአለም አቀፉ የፖስታ ድርጅቶች ህብረት ጉባኤ በአዲስ አበባ እየተካሄደ ነው። http://www.ebc.et/web/ebcnews/-/--1463 …", "የኢፌዴሪ ጠቅላይ ሚኒስትር ዶክተር ዐብይ አህመድ በቻይናው ጠቅላይ ሚኒስትር ይፋዊ የሆነ ደማቅ አቀባበል ተደረገላቸው።", "#EBC ኢቲቪ 4 ማዕዘን 7 ሰዓት ስፖርት ዜና…ነሐሴ 28/2010 ዓ.ም - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-ebc-4-7-28-201-5 …", "#EBC ኢቲቪ 4 ማዕዘን 7 ሰዓት ቢዝነስ ዜና…ነሐሴ 28/2010 ዓ.ም - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-ebc-4-7-28-201-4 …", "አርቲስትና አክቲቪት ታማኝ በየነ ባህርዳር ገባ\nባህርዳር አለም አቀፍ የአየር ማረፊያ ሲደርስ ደማቅ አቀባበል ተደርጎለታል።", "#EBC የአንጋፋዎቹ ታማኝ በየነ እና አለምፀሀይ ወዳጆ ደማቅ አቀባበል - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-e-49 …", "#EBC የአንጋፋዎቹ ታማኝ በየነ እና አለምፀሀይ ወዳጆ ደማቅ አቀባበል", "የኢትዮጵያ አየር መንገድ 7ኛውን የቦንይንግ 777 የጭነት አውሮፕላንኑን መረከቡን አስታወቀ፡፡ \n\nአየር መንገዱ የተረከበው የጭነት አውሮፕላን አዲስ አበባ መግባቱንም ገልጿል፡፡", "ጠቅላይ ሚኒስትሩ ዶ/ር ዐቢይ አህመድ በቻይና የህዝቦች ጀግኖች መታሰቢያ ሃውልት ስር የአበባ ጉንጉን አስቀመጡ", "ለአርቲስትና አክትቪስት ታማኝ በየነ በሚሊኒየም አዳራሽ የአቀባበል መድረክ ተዘጋጅቶለታል\n\nፎቶ አማራ መገናኛ ብዙሃን", "#EBC ከዳሽን እስከ ዳሎል \" የባህል ፈርጦች \" ነሃሴ 26 /2010 ዓ.ም", "#EBC ካስማ - የመዘዋወር ነፃነት ዙሪያ የቀረበ ውይይት ነሐሴ 26/2010 ዓ.ም - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-ebc-26-201-2 …", "#EBC ኑሮና ቢዝነስ - ስራ አጥነት በኢትዮጵያ ነሐሴ 26/2010 ዓ.ም - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-ebc-26-2010- …", "#EBC ኢቲቪ 7 ሰዓት ቢዝነስ ዜና…ነሐሴ 26/2010 ዓ.ም https://www.youtube.com/embed/UCDkGHwdCvo …", "#EBC የቤተሰብ ወግ 63 ዓመት የጋብቻ ህይወት ካከበሩ ቤተሰቦች ጋር የተደረገ ቆይታ", "ታማኝ በየነን ለመቀበል ብዙዎች ከማለዳው 12 ሰዓት ጀምሮ በቦሌ ዓለምአቀፍ አየር ማረፊያ እየተጠባበቁ ነው ጥቂቱን በፎቶ", "#EBC ኢቲቪ 57 ምሽት 2 ሰዓት ቢዝነስ ዜና…ነሐሴ 24/2010 ዓ.ም - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-ebc-57-2-24-201-2 …", "የኢትዮጵያ ሱማሌ ክልል ፖሊስ ኮሚሽነር የነበሩት ፈርሃን ተሃሪ በቁጥጥር ስር ውለው ፍርድቤት ቀርቡ", "#EBC ኢቲቪ 4 ማዕዘን ቢዝነስ የቀን 7 ሰዓት ዜና… ነሐሴ 24/2010 ዓ.ም - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-ebc-4-7-24-201-1 …", "#EBC ኢቲቪ 4 ማዕዘን ስፖርት የቀን 7 ሰዓት ዜና… ነሐሴ 24/2010 ዓ.ም - VideoDisplayPAge - ebc http://www.ebc.et/web/ebcnews/-/-ebc-4-7-24-2010- …", "#EBCጠቅላይ ሚኒስቴር ደክተር አብይ አህመድ ከኢትዮጵያ ሶማሌ ክልል ከተውጣጡ የሃገር ሽማግሌዎች ወጣቶችና ሴቶች ተወካዮች ጋር ያደረጉት ውይይት ክፍል - 1 https://www.youtube.com/embed/lxhLoVdZn4w …", "ኤርትራ በውጭ የሚገኙ ዜጎቿ መመለስ እንደሚችሉ ገለጸች\n****************************\nከኤርትራ በማንኛውም ምክንያት  የተሰደዱ ዜጎች ያለምንም ገደብ ወደ ሃገራቸው መመለስ እንደሚችሉ የውጭ ጉዳይ ሚንስትሩ ኡስማን ሳሊህ ገለጹ። http://www.ebc.et/web/ebcnews/-/--1425 …", "Ethiopian Macroeconomic Committee chaired by Prime Minister Dr. Abiy Ahmed has removed the current diaspora account limit of USD 50,000, and  Diaspora account holders can now save unlimited amount in foreign currency. (Source:- Office of PM) #Ethiopia", "#EBC ኢቲቪ 57 ቢዝነስ ምሽት 2 ሰዓት ዜና…ነሐሴ 22/2010 ዓ.ም", "# EBCየአባይ ዘመን - የጣና ነገር . . .", "ከ20 አመታት በላይ በስደት የኖረው አርቲስትና አክቲቪስት  ታማኝ በየነ ነሃሴ 26  ጠዋት  ወደ ሃገሩ ይገባል ተብሎ ይጠበቃል፡፡ http://www.ebc.et/web/ebcnews/-/--57 …", "YouTube https://www.youtube.com/embed/V2WoKYkm7Qs …", "https://www.youtube.com/watch?v=X-o_IwfYz6A …", "የአትዮጵያ መንግስት ተወካዮችና የትግራይ ህዝቦች ዲሞክራቲክ ንቅናቄ በአስመራ እየተወያዩ ነው", "https://www.facebook.com/EBCzena/posts/2097647226933809 …", "https://www.youtube.com/watch?v=N-if6KjNVSo …", "https://www.youtube.com/watch?v=N-if6KjNVSo … https://www.youtube.com/watch?v=N-if6KjNVSo …", "German Chancellor Angela Merkel has lauded Ethiopia and Eritrea peace agreement, and invited Prime Minister Dr. Abiy Ahmed to visit Germany. #Ethiopia #Eritrea #Germany", "በክልሉ ብሎም በሀገር የለውጥ ሂደት ውስጥ ወጣቶች ግንባር ቀደም ተዋናይ መሆን እንደሚገባቸው የኦሮሞ ህዝብ ዴሞክራሲያዊ ድርጅት /ኦህዴድ/ ገለፀ፡፡ http://www.ebc.et/web/ebcnews/-/--1409 …", "Ethiopian Prime Minister Dr. Abiy Ahmed has received Egyptian delegation led by Foreign Minister Sameh Shoukry and discussed bilateral issues. (Source: PM Office). #Egypt #Ethiopia", "ጠቅላይ ሚኒስትር ዶ/ር ዐቢይ አህመድ በግብጽ የውጭ ጉዳይ ሚኒስትር ሳሜህ ሹክሪ  የሚመራ የልዑካን ቡድንን ተቀብሎ አነጋገሩ፡፡ ጠቅላይ ሚኒስትሩ ከግብጽ ፕሬዝዳንት አብዱልፈታህ አልሲሲ የተለከላቸውን ደብዳቤም ተቀብለዋል፡፡", "የሱማሌ ክልልፕሬዝዳንት በክልሉ በተከሰተው ብጥብጥ የተጎዱት ተቋማት ይጎበኛሉ።", "መጠቀም ከቻልን አፍሪካ በርካታ ዕድሎች አሏት - ዶ/ር ዐቢይ አህመድ\n\n", "#EBC \"የአባይ ዘመን\" የጣና ነገር…ነሐሴ 21/2010 ዓ.ም \n\n", "#EBC \"እንደራሴ\" በብሄራዊ ፓርኮች ላይ ያተኮረ ፕሮግራም ከባለድርሻ አካላት ጋር የተደረገ ውይይት ክፍል 2 …ነሐሴ 21/2010 ዓ.ም\n\n", "የቀድሞ የኢትዮጵያ ሶማሌ ክልል ርዕሰ መስተዳድር አቶ አብዲ ኦማር መሐመድ በቁጥጥር ስር ዋሉ", "#EBC ድርብ ጀግና ነሐሴ 20/2010", "#EBC የልቦና ውቅር ..ነሐሴ 20/2010", "#EBCየይቅርታ መደመርና አንድነት ዘመን ለኢትዮጵያ ክፍል 1", "ጠቅላይ ሚኒስትር ዐቢይ አህመድ የአዲስ አበባ ከተማ አስተዳደር አዲስ ዓመትን ምክንያት በማድረግ የአቅመ ደካሞችን ቤት ለማደስ የያዘው መርሃግብር ተሳታፊ ሆኑ", "ጠቅላይ ሚኒስትር ዶ/ር አብይ አህመድ በቻይና የነጻ ትምህርት ዕድል /ስኮላርሺፕ/ ላገኙ ሰልጣኞች ሽኝት አድርገውላቸዋል", "#EBC ኢቲቪ 57 ስፖርትምሽት 2 ሰዓት ዜና…ነሐሴ 18/2010 ዓ.ም", "https://www.facebook.com/EBCzena/posts/2091604880871377 …", "#EBC በብሔራዊ የመረጃና ደህንነት አገልግሎት አጠቃላይ የሰራ እንቅስቃሴ ዙሪያ ከተቋሙ ዋና ዳይሬክተር ጀነራክ አደም መሃመድ ጋር የተደረ ቆይታ ክፍል 2", "#EBC በብሔራዊ የመረጃና ደህንነት አገልግሎት አጠቃላይ የሰራ እንቅስቃሴ ዙሪያ ከተቋሙ ዋና ዳይሬክተር ጀነራክ አደም መሃመድ ጋር የተደረ ቆይታ ክፍል 1", "#EBC ኢቲቪ 4 ማዕዘን ስፖርት የቀን 7 ሰዓት ዜና… ነሐሴ 18/2010 ዓ.ም", "የብሔራዊ የአደጋ ስጋት ስራ አመራር ኮሚሽን የአደጋ ክስተት ስጋት ስራ አመራር ስርአትን ለማጠናከር የሚያስችሉ ድጋፎችን ለማግኘት ከአለም አቀፍ ድርጅቶችና መንግሥታት ጋር ግንኙነት በመፍጠር እየሠራ ይገኛል፡፡ http://www.ebc.et/web/ebcnews/-/--1379 …", "https://www.facebook.com/EBCzena/posts/2090917364273462 …", "ጠቅላይ ሚኒስትር ዶ/ር ዐቢይ አህመድ ቪዬትናም ፕሬዝዳንት ትራን ዳይ ኳንክ ጋር ተወያዩ", "ኢትዮ ቴሌኮም የአገልግሎት ታሪፍ ማሻሻያን በዝርዝር ይመልከቱ", "ጠቅላይ ሚኒስትር ዶ/ር ዐቢይ አህመድ ከአሜሪካ የልኡካን ቡድን ጋር እየተወያዩ ነው", "የደቡብ አፍሪካ መንግስት በመሬት ይዞታ ህጓ ላይ ማሻሻያ እንደምታደርግ ማሳወቋን ተከትሎ ፕሬዝዳንት ዶናል ትራምፕ ተቃውሟቸውን አሰምተዋል፡፡\nhttp://5.77.45.143/web/ebcnews/-/--1366 http://5.77.45.143/web/ebcnews/-/--1366", "በአማራ ክልል ቆቦ ከተማ  የሶለል አከባበር በፎቶ\n በመቅደስ ጥላሁን", "የ2010 የአሸንዳ በዓል አከባበር ከመቐለ ቀጥታ ስርጭት https://www.facebook.com/EBCzena/posts/2087749631256902 …", "1439ኛው የኢድ አል አድሃ በዓል ተከበረ\n\n1439ኛው የኢድ አል አድሃ (አረፋ) በዓል በመላው ሀገሪቱ  ዛሬ በመላ አገሪቱ ተከብሯል፡፡\n\nበተለይ  በአዲስ አበባ ህዝበ ሙስሊሙ በዓሉን በስግደትና በፀሎት  በአዲስ አበባ ስታዲየም  በዓሉ ተከብሯል፡፡", "#EBC ኢቲቪ 57 ስፖርት ምሽት2 ሰዓት አማርኛ ዜና …ነሐሴ 14/2010 HD", "#EBC \"እንደራሴ\" በዱር እንስሳ መኖሪያ ፓርኮች /ብሔራዊ ፓርኮች/ ወቅታዊ ጉዳይ ላይ ያተኮረ .ነሐሴ14/2010", "#EBC ሰላም የተጠሙ ድምፆች ..ነሐሴ 13/2010", "#EBC \"ዓይናችን \"ፈውስ የሚያሻው ፈዋሽ ነሐሴ 11/2010", "#EBCኢቲቪ 4 ማዕዘን ስፖርት የቀን 7 ሰዓት ዜና… ነሐሴ 14/2010 ዓ.ም", "https://www.facebook.com/EBCzena/posts/2083856481646217 …", "ጠቅላይ ሚኒስትር ዶ/ር ዐቢይ አህመድ የትምህርት ፖሊሲ ሪፎርም  ፎረምን  ከፈቱ", "https://www.facebook.com/EBCzena/posts/2083485015016697 …", "#EBC\" ከዳሎል እሰከ ዳሽን\" የአጥር ማህደር ነሐሴ 12/2010 ዓ.ም", "Former UN Chief Kofi Annan dies aged 80.  #UN", "Prime Minister Dr. Abiy Ahmed congratulated the 2018 graduates of Defense Command College.  He said on the occasion that rule of law is the  foundation that keeps our society together, and hence the government won’t tolerate the increasing tendency to disregard the law.#Ethiopia", "የመከላከያ ሚኒስቴር የአዛዥነት እና ስታፍ ኮሌጅ ያሰለጠናቸውን ከፍተኛ መኮንኖችን ጠቅላይ ሚነስትር ዶከተር ዐቢይ አህመድ በተገኘበት አስመረቀ", "https://www.facebook.com/EBCzena/posts/2078356528862879 …", "Ethiopian Airlines set to resume flights to Somalia after a 41-year absence. #Ethiopia #Somalia", "The upcoming Beijing Summit of the Forum on China-Africa Cooperation will be a good showcase of South-South cooperation, Meles Alem, Spokesperson of the Ethiopian Ministry of Foreign Affairs said on Thusday.#Ethiopia #China #Africa", "የበጀት ዓመት የአገራችንን ብሄራዊ ጥቅም ለማስከበር በዲፕሎማሲ መስክ በርካታ ተግባራት ማከናወኑን የውጭ ጉዳይ ሚኒስትር ዶ/ር ወርቅነህ ገልጸዋል፡፡", "Representatives of the Amhara Region and the Amhara Democratic Forces Movement, (ADFM), signed a Reconciliation Agreement in Asmara .   The Agreement provides for the ADFM to pursue its political activities in Ethiopia through peaceful means. #Ethiopia", "Bosch Appliances signals Ethiopia entry http://5.77.45.143/web/news-en/-/bosch-appliances-signals-ethiopia-entry", "ኢቢሲ የ2010 ምርጥ ስፖርተኞችን ለሽልማት እጩዎችን ለይቷል:: እርስዎ ምርጥ ለሚሉት ስፖርተኛ ድምፅ ለመስጠት ሊንኩን ይጫኑ፤ ገፁንም  follow  እና  Retweet ያድርጉ\nhttps://fans.vote/media-news-publishing/ebc …", "የእርስዎን የዓመቱ ምርጥ ስፖርተኛ በ #ኢቢሲዜና ፌስ ቡክ ገፅ በመግባት ይምረጡ፡፡ https://www.facebook.com/EBCzena/posts/2076276459070886 …", "ወደ ትምህርት ቤት በጀልባ ሲጓዙ የነበሩ 22 ሱዳናዊያን ህፃናት የመስጠም አደጋ ደረሰባቸው፡፡ http://www.ebc.et/web/ebcnews/-/--54 …", "https://www.facebook.com/EBCzena/posts/2075289489169583 …", "https://fans.vote/v/ACw415359B8  https://fans.vote/v/ACw415359B8 ", "#EBC በምህረት አዋጁና በሽብርተኝነት የውሳኔ ሃሳብ ላይ የተደረገ የእንደራሴ የመጨረሻ ክፍል ውይይት፡፡\n", "https://www.facebook.com/EBCzena/posts/2073452076019991 …", "የኢትዮጵያ ኦሎምፒክ ኮሚቴ አትሌት ፈይሳ ሌሊሳ ወደ አገሩ እንዲመለስ ጥሪ አቀረበ", "የአዲስ አበባ ፖሊስ ምክትል ኮሚሽነርን ጨምሮ በሰኔ 16ቱ የቦንብ ጥቃት ተጠርጥረው በቁጥጥር ስር የነበሩ 11 የፖሊስ አባላት በዋስ ተለቀቁ", "Ethiopian Tourism Board has pledged to offer 25% service discount for Ethiopian Diasporas who will be travelling to Ethiopian for Ethiopian New Year. #Ethiopia", "Prime Minister Dr. Abiy  Ahmed visits operational Industrial Park in Dukem  new industrial park in Jimma & coffee forests around Jimma & Bonga today to encourage & support investors. #Ethiopia", "ጠቅላይ ሚኒስትር ዶ/ር ዐቢይ አህመድ የጅማ ኢንደስትሪ ፓርክን ጎበኙ", "#EBC \"ነገን ዛሬ\" ኢትዮጵያዊ እሴት የሚዳስስ ዝግጅት ነሐሴ 05/2010", "#EBC \"አውደ ሰብ ፕሮግራም የኃይሌ ፊዳ የህይወት ታሪክ ያስቃኘናል ክፍል 2… ነሐሴ 05/2010 ዓ.ም", "ጠቅላይ ሚንስትር ዶ/ር ዐቢይ አሕመድ በመንበረ ፓትረያርክ በመገኘት ብፁዕ ወቅዱስ አቡነ ማርቆርዮስን ጎበኙ", "Eritrean delegation composed of Foreign Minister Osman Saleh & Presidential Adviser Yemane G/ab have departed to Ethiopia today. Delegation will deliver message from President Isaias Afwerki to Prime Minister Abiy Ahmed & discuss progress of implementation of the Agreement (EIM)", "Ethiopian Health Minister Dr. Amir Aman met Mr. Ivan Roberts, Minister-Counsellor & Head of Development Cooperation at the Embassy of Canada in Ethiopia. They have discussed on further expanding Ethio- Canada collaboration on reproductive & maternal health services. #Ethiopia", "አቶ ጀዋር  አማራ ክልልን ጎበኙ\n*****************\n\nአቶ ጀዋር መሐመድ የአማራ ክልልን የጎበኙ ሲሆን፣ ከአማራ ክልል ፕሬዝዳንት አቶ ገዱ አንዳርጋቸው እና ከሌሎች የክልሉ ባለስልጣናት ጋር በባህርዳር ውይይት አድርገዋል፡፡", "In response to HE PM Abiy’s call the Ethiopian Tourism Board agreed today to ensure reduced price & unforgettable experience for all visiting diaspora for #Ethiopia-n New Year. The Board asked  ET, Hoteliers, Tour & Taxi Asso’s for discounted package. @Landoforigins @flyethiopian", "ጠቅላይ ሚኒስትር ዶ/ር ዐቢይ አህመድ ከሳውዲ አረቢያ ውጭ ጉዳይ ሚኒስትር አደል ቢን አህመድ አል ጁበይር ጋር በጽህፈት ቤታቸው እየተወያዩ ነው፡፡", "HE Prime Minister Dr Abiy Ahmed announces the formation of the Ethiopian Diaspora Trust Fund Advisory Council and its members. He thanks and encourages all individuals and groups who have taken initiatives to cooperate with the Council. #Ethiopia", "ጋና ለአይነ ስውርነት የሚዳርገውን የትራኮማ በሽታን በአፍሪካ በቀዳሚነት በማጥፋቷ የአለም የጤና ድርጅት የእውቅና ምስክር ወረቀት አበረከተላት፡፡ http://www.ebc.et/web/ebcnews/-/--1262 …", "Prime Minister Dr. Abiy Ahmed met  Penny Mordaunt, UK’s Secretary of State for International Development. Penny lauds Ethiopia's reform and expressed the commitment UK to support Ethiopia. #Ethiopia", "#EBC \"እንደራሴ\" በምህረት አዋጁ መፅደቅና የሽብርተኝነት ፍረጃው መነሳት ላይ ያተኮረ ውይይት ሐምሌ30/2010", "#EBC ጤና ይስጥልኝ ኢትዮጵያ-ነሐሴ 02/2010 ዓ.ም", "The Government of the Federal Democratic Republic of Ethiopia & the OLF have signed a Reconciliation Agreement today in Asmara.The Agreement, reached between President of the Oromo Region, Mr. Lemma Mergesa & OLF Chairman, Mr. Dawd Ibsa forprovides   termination of hostilities.", "GCAO Minister; Ahmed Shide gives Statement on the current situation in Somaligna. https://www.facebook.com/EBCzena/posts/2058879507477248 …", "https://www.youtube.com/watch?v=-o0p9RrPYpE … https://www.youtube.com/watch?v=-o0p9RrPYpE …", "#EBC በኢትዮጵያ ሶማሌ ክልል ዙሪያ ከመንግስት ኮምኒኬሽን ጉዳዮች ጽሕፈት ቤት የተሰጠ መግለጫ", "#EBC \"ፍለጋ\" ከአንጋፋው አርቲስት ጌታቸው ደባልቄ ጋር የተደረገ ቆይታ", "አክቲቪስት ጀዋር መሐመድ በግንጪና በአምቦ ከተሞች ጉብኝት እያደረገ ነው", "https://www.youtube.com/watch?v=0ZHIkw0Gu48 … https://www.youtube.com/watch?v=0ZHIkw0Gu48 …", "የኦሮሚያ ሚዲያ ኔትዎርክ (OMN)  የአዲስ አበባ ቅርንጫፍ የምረቃ ስነ ስርዓት ቀጥታ ስርጭት https://www.facebook.com/EBCzena/posts/2055566747808524 …", "በአሜሪካን የተካሄደውን መርሀ  ግብር ተከትሎ  ዛሬ  በአዲስ አበባ ሚሊንየም አዳራሽ የኢትዮጵያ ኦርቶዶክስ ተዋህዶ ቤተክርስትያን አንድነት የሚያበስር የእርቀ ሰላም መርሀ ግብር ተካሂዷል። http://www.ebc.et/web/ebcnews/-/--1229 …", "#EBC የብዝሃ ህይወት መንደር", "#EBC  ጤናዎ በቤትዎ - ጡት ማጥባት ዙሪያ የቀረበ ውይይት https://www.youtube.com/watch?v=ozAS9-wjdm8 …", "#EBC ቢዝነስ የቀን 7 ሰዓት ዜና… ሐምሌ 28/2010 ዓ.ም", "#EBC የቤተሰብ ወግ - የቤተሰብ ጉባኤ", "“The U.S. is a strong supporter of the reform efforts led by Prime Minister Abiy Ahmed and his administration and we look forward to cooperating and to help the reforms succeed.”, U.S. Embassy spokesperson Nicholas Barnett said. #Ethiopia", "This is what I’m talking about!\n\nWhen proper leadership are given full reins, they become creative and proactive, tackling recurring issues in new and innovative ways.\n\nGo @amirabiy !\n\n#Ethiopia", "“We had given up real efforts to resolve the [Ethio-Eritrea] situation, it has been there for 20 years. Shouldn’t we, when ...this very bold, historic leader coming in...from Ethiopia, devote this UN GA...to give him the most prominent speaker’s role?“ Swedish Ambassador to UN.", "#EBC ኢቲቪ 4 ማዕዘን ስፖርት የቀን 7 ሰዓት ዜና… ሐምሌ 26/2010 ዓ.ም", "#EBC ኢቲቪ 4 ማዕዘን ቢዝነስ የቀን 7 ሰዓት ዜና… ሐምሌ 26/2010 ዓ.ም", "የአርቲስት ፍቃዱ ተ/ማርያም የአስክሬን ሽኝት ስነ ስርዓት", "ማክሰኞ ሐምሌ 24 ቀን 2010 ዓ.ም. ያረፈው አርቲስት ፍቃዱ ተክለማርያም የቀብር ሥነ ሥርዓት በቅድስት ሥላሴ ካቴድራል ከመፈጸሙ አስቀድሞ በብሔራዊ ቴያትር የክብር አሸኛኘት ሲደረግለት የሚያሳዩ ፎቶዎች፡፡\n\nምንጭ፡  ኢትዮጵያን ሪፖርተር", "https://www.facebook.com/EBCzena/posts/2049500391748493 …", "ጠቅላይ ሚኒስትር ዐቢይ  ከሁለቱ ፓትሪያርኮች ጋር ከአውሮፕላን እስከ ቦሌ \nምንጭ፡ የፍፁም አረጋ", "ለላፉት ሁለት አስርት ዓመታት በስደት ላይ የነበሩት ብፁዕ ወቅዱስ አቡነ መርቆሬዎስ አዲስ አበባ ገቡ", "#EBC ጤና ይስጥልኝ ኢትዮጵያ ሐምሌ 25 /2010", "#EBC ኢቲቪ 57 ቢዝነስ ምሽት 2 ሰዓት ዜና…ሐምሌ 24/2010 ዓ.ም", "#EBC 2017 የወጪ ንግድ ገበያ ማስፋት", "#EBC ዓይናችን - የ8ኛ ዙር የካ አያት ቁጥር 2 የጋራ ህንፃ ኗሪዎች ቅሬታ", "#EBC ኢቲቪ 4 ማዕዘን ቢዝነስ የቀን 7 ሰዓት ዜና… ሐምሌ 24/2010 ዓ.ም", "#EBC ኢቲቪ 4 ማዕዘን ስፖርት የቀን 7 ሰዓት ዜና… ሐምሌ 24/2010 ዓ.ም", "ኤርትራና ሶማሊያ ዲፕሎማሲያዊ ግንኙነታቸውን ለማደስ ተሰማሙ\n *************************************************\nበስምምነቱ አገራቱ ዲፕሎማሲያ ግንኙነታቸውን ለመጀመርና አምባሳደሮቻቸውን ለመለዋወጥ ተስማምተዋል ተብሏል። http://www.ebc.et/web/ebcnews/-/--1199 …", "https://www.facebook.com/EBCzena/posts/2045146725517193 …", "https://www.facebook.com/EBCzena/posts/2044952838869915 …", "https://www.facebook.com/EBCzena/posts/2044948512203681 …", "Prime Minister Abiy Ahmed and his delegation arrived in Minnesota. #Ethiopia"]}